[
  {
    "name": "R in Action, Second Edition",
    "isbn": "1617291382",
    "pages": 300,
    "status": "MEAP",
    "authors": ["Robert Kabacoff"],
    "categories": ["Java", "BackEnd"],
    "timesSold": 1492,
    "saleprice": 200.67,
    "longDescription": "JavaServer Faces helps streamline your web development through the use of UI components and events (instead of HTTP requests and responses). JSF components (buttons, text boxes, checkboxes, data grids, etc.) live between user requests, which eliminates the hassle of maintaining state. JSF also synchronizes user input with application objects, automating another tedious aspect of web development. JavaServer Faces in Action is an introduction, a tutorial, and a handy reference. With the help of many examples, the book explains what JSF is, how it works, and how it relates to other frameworks and technologies like Struts, Servlets, Portlets, JSP, and JSTL. It provides detailed coverage of standard components, renderers, converters, and validators, and how to use them to create solid applications. This book will help you start building JSF solutions today.",
    "id": 343,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kabacoff2.jpg",
    "year": 1967,
    "discount": 0,
    "stock": 14
  },
  {
    "name": "JavaServer Faces in Action",
    "isbn": "1932394125",
    "pages": 744,
    "year": 2004,
    "longDescription": "JavaServer Faces helps streamline your web development through the use of UI components and events (instead of HTTP requests and responses). JSF components (buttons, text boxes, checkboxes, data grids, etc.) live between user requests, which eliminates the hassle of maintaining state. JSF also synchronizes user input with application objects, automating another tedious aspect of web development. JavaServer Faces in Action is an introduction, a tutorial, and a handy reference. With the help of many examples, the book explains what JSF is, how it works, and how it relates to other frameworks and technologies like Struts, Servlets, Portlets, JSP, and JSTL. It provides detailed coverage of standard components, renderers, converters, and validators, and how to use them to create solid applications. This book will help you start building JSF solutions today.",
    "status": "PUBLISH",
    "authors": ["Kito D. Mann"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1491,
    "saleprice": 187.7,
    "id": 156,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mann.jpg",
    "discount": 17,
    "stock": 43
  },
  {
    "name": "iText in Action",
    "isbn": "1932394796",
    "pages": 688,
    "year": 2006,
    "shortDescription": "I've been using iText for over a year, but I still learnt an awful lot while reading this book.\" --JavaLobby",
    "longDescription": "Say you need a tool to add dynamic or interactive features to a PDF file and you decide to search on Google for \"Java PDF.\" What do you think you'd find Why, at the top of the page you'd find \"iText,\" of course. A leading tool for programmatic creation and manipulation of PDF documents, iText is an open source Java library developed and maintained by Bruno Lowagie, the author of this book, with the help of many contributors. While at the entry level iText is easy to learn, developers find they soon need its more advanced features. Written by the master himself, iText in Action now offers an introduction and a practical guide to the subject--you will gain a sound understanding of the Portable Document Format and how to do interesting and useful things with PDF using iText. iText in Action introduces iText and lowers the learning curve to its advanced features. Its numerous, valuable examples unlock many of the secrets hidden in Adobe's PDF Reference. The examples are in Java but they can be easily adapted to .NET using one of iText's .NET ports: iTextSharp (C#) or iText.NET (J#).",
    "status": "PUBLISH",
    "authors": ["Bruno Lowagie"],
    "categories": ["Web Development", "Java", "BackEnd"],
    "timesSold": 1478,
    "saleprice": 76.45,
    "id": 148,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lowagie.jpg",
    "discount": 0,
    "stock": 5
  },
  {
    "name": "Clojure in Action",
    "isbn": "1935182595",
    "pages": 475,
    "year": 2011,
    "shortDescription": "Clojure in Action is a hands-on tutorial for the working programmer who has written code in a language like Java or Ruby, but has no prior experience with Lisp. It teaches Clojure from the basics to advanced topics using practical, real-world application examples. Blow through the theory and dive into practical matters like unit-testing, environment set up, all the way through building a scalable web-application using domain-specific languages, Hadoop, HBase, and RabbitMQ.",
    "longDescription": "Clojure is a modern implementation of Lisp for the JVM, ideally suited for general programming and specialized tasks like creating domain specific languages. Like Haskell and Scala, Clojure supports the functional style of programming. By combining first-class functions, lexical closures, multimethods, and a full-fledged macro system, you get more than what typical OO languages can possibly offer. Moreover, you get ultra-clean code that reflects Lisp's famously-concise style. That means far fewer bugs when compared to stateful languages such as Java or C++. Clojure in Action is a hands-on tutorial for the working programmer who has written code in a language like Java or Ruby, but has no prior experience with Lisp. It teaches Clojure from the basics to advanced topics using practical, real-world application examples. Blow through the theory and dive into practical matters like unit-testing, environment set up, all the way through building a scalable web-application using domain-specific languages, Hadoop, HBase, and RabbitMQ. For readers coming from Java, you'll see how Clojure's use of the JVM makes it seamlessly interoperable with existing Java code. Learn how to access the thousands of existing libraries and frameworks. You'll also discover the concurrency semantics built into the language, which enable you to very easily write multi-threaded programs and take advantage of multiple cores in modern CPUs. With cloud-computing and multi-core becoming major trends, this is a huge advantage. WHAT'S INSIDE * A modern Lisp without all the baggage * Functional programming that's also practical * Unit-testing, embedding Clojure, distributed programming, and more * State management and safe concurrency for multi-core CPUs * Create domain specific languages (DSLs) with the macro system * Write web-scale applications that scale transparently across multiple CPUs * Seamless interoperability with thousands of Java libraries * Get performance on level with raw Java",
    "status": "PUBLISH",
    "authors": ["Amit Rathore"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1472,
    "saleprice": 158.57,
    "id": 207,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/rathore.jpg",
    "discount": 12,
    "stock": 0
  },
  {
    "name": "HTML5 in Action",
    "isbn": "1617290491",
    "pages": 375,
    "year": 2014,
    "shortDescription": "HTML5 In Action provides a complete introduction to web development using HTML5. You'll explore every aspect of the HTML5 specification through real-world examples and code samples. It's much more than just a specification reference, though. It lives up to the name HTML5 in Action by giving you the practical, hands-on guidance you'll need to use key features.",
    "longDescription": "The Web is buzzing about HTML5. What is it? Which browsers support what features? When the specification will be complete? HTML5, along with supporting technologies like CSS3, SVG, and JavaScript, gives web developers powerful new features like local storage, better audio and video support, and standards-driven mobile application development. And it's ready to use now, with browser support from Microsoft, Google, Apple, Mozilla, and Opera.\n\nHTML5 In Action provides a complete introduction to web development using HTML5. You'll explore every aspect of the HTML5 specification through real-world examples and code samples. It's much more than just a specification reference, though. It lives up to the name HTML5 in Action by giving you the practical, hands-on guidance you'll need to use key features like:\n\n * The new semantic elements and form input types\n * Native multimedia playback with the video and audio elements\n * Canvas and 2D drawing APIs\n * Offline applications\n * Local and session storage, IndexedDB databases\n * Web workers\n * Geolocation, File API, History API\n * Cross-document Message API\n * Much, much more\n\nWith this book, you can confidently start using HTML5 today. The relevant, easy-to-follow examples will make you a HTML5 master in no time. You'll even learn how to provide fallbacks for browsers that don't support particular HTML5 features.",
    "status": "PUBLISH",
    "authors": ["Rob Crowther", "Joe Lennon", "Ash Blue", "Greg Wanish"],
    "categories": ["HTML", "FrontEnd"],
    "timesSold": 1471,
    "saleprice": 80.23,
    "id": 286,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/crowther2.jpg",
    "discount": 0,
    "stock": 41
  },
  {
    "name": "Spring Dynamic Modules in Action",
    "isbn": "1935182307",
    "pages": 450,
    "year": 2010,
    "shortDescription": "Spring Dynamic Modules in Action introduces Spring DM and OSGi to Java EE developers and architects. It presents the fundamental concepts of OSGi-based apps and maps them to the familiar ideas of the Spring framework. Then, it engages you with the techniques and concepts you'll need to develop stable, flexible enterprise apps. You'll learn how to embed a Spring container inside an OSGi bundle, and how Spring DM lets you blend Spring strengths like dependency injection with OSGi-based services. Along the way, you'll see how Spring DM handles data access and web-based components, and you'll explore topics like unit testing and configuration in an OSGi-based environment.",
    "longDescription": "OSGi is increasingly familiar to Java coders working in distributed environments, but the tools required to implement OSGi-based systems have been slow to develop. Spring Dynamic Modules (Spring DM) is a framework designed to make it easy to build Spring apps that take advantage of the OSGi approach to modular Java development. It simplifies the task of creating true component and service oriented architectures in an OSGi environment using all the powerful features of the Spring framework. Spring Dynamic Modules in Action introduces Spring DM and OSGi to Java EE developers and architects. It presents the fundamental concepts of OSGi-based apps and maps them to the familiar ideas of the Spring framework. Then, it engages you with the techniques and concepts you'll need to develop stable, flexible enterprise apps. You'll learn how to embed a Spring container inside an OSGi bundle, and how Spring DM lets you blend Spring strengths like dependency injection with OSGi-based services. Along the way, you'll see how Spring DM handles data access and web-based components, and you'll explore topics like unit testing and configuration in an OSGi-based environment.",
    "status": "PUBLISH",
    "authors": ["Arnaud Cogoluegnes", "Thierry Templier", "Andy Piper"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1469,
    "saleprice": 156.56,
    "id": 45,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/cogoluegnes.jpg",
    "discount": 0,
    "stock": 14
  },
  {
    "name": "Jaguar Development with PowerBuilder 7",
    "isbn": "1884777864",
    "pages": 550,
    "year": 1999,
    "shortDescription": "Development with PowerBuilder 7 is the definitive guide to distributed application development with PowerBuilder. It is the only book dedicated to preparing PowerBuilder developers for Jaguar applications and has been approved by Sybase engineers and product specialists who build the tools described in the book.",
    "longDescription": "Jaguar Development with PowerBuilder 7 is the definitive guide to distributed application development with PowerBuilder. It is the only book dedicated to preparing PowerBuilder developers for Jaguar applications and has been approved by Sybase engineers and product specialists who build the tools described in the book. Jaguar Development with PowerBuilder 7 focuses on getting you up to speed on Jaguar and PowerBuilder, and it is packed with code samples to guide you every step of the way. It covers each step involved in application development, from setting up the development environment to deploying a production application. Even a PowerBuilder developer with no experience in distributed technologies or Jaguar CTS will learn what it takes to build an application. Jaguar Development with PowerBuilder 7 covers: Developing Component-centric Applications Building Jaguar CTS Components/Clients CORBA Adaptive SQL Anywhere Adaptive Server Enterprise and lots more!",
    "status": "PUBLISH",
    "authors": ["Michael Barlotta"],
    "categories": [
      "PowerBuilder",
      "Client-Server",
      "SQL",
      "BackEnd",
      "Database"
    ],
    "timesSold": 1452,
    "saleprice": 106.73,
    "id": 17,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://firebasestorage.googleapis.com/v0/b/sneakers-f658b.appspot.com/o/librosCoverImages%2FbackupCover.jpg?alt=media&token=fac8620f-a908-4588-a2ed-c1fa07eb12f3",
    "discount": 0,
    "stock": 36
  },
  {
    "name": "Data Munging with Perl",
    "isbn": "1930110006",
    "pages": 304,
    "year": 2001,
    "longDescription": "Your desktop dictionary may not include it, but 'munging' is a common term in the programmer's world. Many computing tasks require taking data from one computer system, manipulating it in some way, and passing it to another. Munging can mean manipulating raw data to achieve a final form. It can mean parsing or filtering data, or the many steps required for data recognition. Or it can be something as simple as converting hours worked plus pay rates into a salary cheque. This book shows you how to process data productively with Perl. It discusses general munging techniques and how to think about data munging problems. You will learn how to decouple the various stages of munging programs, how to design data structures, how to emulate the Unix filter model, etc. If you need to work with complex data formats it will teach you how to do that and also how to build your own tools to process these formats. The book includes detailed techniques for processing HTML and XML. And, it shows you how to build your own parsers to process data of arbitrary complexity. If you are a programmer who munges data, this book will save you time. It will teach you systematic and powerful techniques using Perl. If you are not a Perl programmer, this book may just convince you to add Perl to your repertoire.",
    "status": "PUBLISH",
    "authors": ["David Cross"],
    "categories": ["Perl", "HTML", "FrontEnd"],
    "timesSold": 1435,
    "saleprice": 155.9,
    "id": 54,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/cross.jpg",
    "discount": 0,
    "stock": 44
  },
  {
    "name": "Java Development with Ant",
    "isbn": "1930110588",
    "pages": 672,
    "year": 2002,
    "shortDescription": "The most widely used build tool for Java projects, Ant is cross-platform, extensible, simple, and fast. It scales from small personal projects to large, multi-team J2EE projects. And, most important, it's easy to learn.",
    "longDescription": "Java Development with Ant systematically explores what Ant can do, and how to apply it to your project. Whether you are new to Ant, or an experienced user, this book will show you powerful and creative uses for Ant. The book emphasizes basic concepts you need to know to effectively use Ant starting with Ant's XML-driven build process. It leads you step-by-step through everything you need to know to compile, test, package and deploy an application. It then guides you through the maze of more complex situations common in larger projects such as enterprise Java applications and Web Services. With this book you will gain access to a powerful tool to automatically build, test and deploy your Java software, no matter how simple or complex it might be.",
    "status": "PUBLISH",
    "authors": ["Erik Hatcher", "Steve Loughran"],
    "categories": ["Java", "Internet", "Java", "BackEnd"],
    "timesSold": 1417,
    "saleprice": 169.45,
    "id": 89,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hatcher.jpg",
    "discount": 19,
    "stock": 2
  },
  {
    "name": "MongoDB in Action",
    "isbn": "1935182870",
    "pages": 300,
    "year": 2011,
    "shortDescription": "MongoDB In Action is a comprehensive guide to MongoDB for application developers. The book begins by explaining what makes MongoDB unique and describing its ideal use cases. A series of tutorials designed for MongoDB mastery then leads into detailed examples for leveraging MongoDB in e-commerce, social networking, analytics, and other common applications.",
    "longDescription": "MongoDB is a document-oriented database that's highly scalable and delivers very high-performance, especially with massive data sets that need to be spread across multiple servers. It blends the things you expect with any database like indexing, querying, and high availability with powerful new features like easy horizontal scaling (\"auto-sharding\"), map/reduce aggregation, and a flexible document data model to support dynamic schemas. MongoDB In Action is a comprehensive guide to MongoDB for application developers. The book begins by explaining what makes MongoDB unique and describing its ideal use cases. A series of tutorials designed for MongoDB mastery then leads into detailed examples for leveraging MongoDB in e-commerce, social networking, analytics, and other common applications. Along the way, all of MongoDB's major features are covered, including: * Indexes and explain plans for efficient queries * Atomic operations for managing simple data structures and manipulating complex, rich documents * GridFS for storing and managing large binary objects (images, videos, etc.) in MongoDB * Map-reduce for custom aggregations and reporting * Master-slave replication and replica sets for automated failover * Auto-sharding for automated horizontal scaling The handy reference section on schema design patterns will help ease the transition from the relational data model of SQL to MongoDB's document-based data model. The numerous, detailed examples are implemented in Ruby and include comprehensive explanations. MongoDB has been gaining traction in the developer community for its speed, flexibility, scalability, and ease of use. With production deployments that include SourceForge, Foursquare, and Shutterfly, MongoDB is proving to be a robust and reliable database system that keeps developers happy. Covering everything from installation to application design to deployment, MongoDB In Action is written for the application developer who wants to take advantage of MongoDB and get up and running quickly.",
    "status": "PUBLISH",
    "authors": ["Kyle Banker"],
    "categories": [
      "Next Generation Databases",
      "SQL",
      "MongoDB",
      "BackEnd",
      "Database"
    ],
    "timesSold": 1412,
    "saleprice": 97.68,
    "id": 15,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/banker.jpg",
    "discount": 11,
    "stock": 37
  },
  {
    "name": "POJOs in Action",
    "isbn": "1932394583",
    "pages": 592,
    "year": 2006,
    "shortDescription": "\"POJOs in Action is required reading for battle-weary EJB developers and for new developers who want to avoid the sins of the fathers by using lightweight frameworks. -- C# Online.NET",
    "longDescription": "There is agreement in the Java community that EJBs often introduce more problems than they solve. Now there is a major trend toward lightweight technologies such as Hibernate, Spring, JDO, iBATIS, and others, all of which allow the developer to work directly with the simpler Plain Old Java Objects, or POJOs. Bowing to the new consensus, EJB 3 now also works with POJOs. POJOs in Action describes these new, simpler, and faster ways to develop enterprise Java applications. It shows you how to go about making key design decisions, including how to organize and encapsulate the domain logic, access the database, manage transactions, and handle database concurrency. Written for developers and designers, this is a new-generation Java applications guide. It helps you build lightweight applications that are easier to build, test, and maintain. The book is uniquely practical with design alternatives illustrated through numerous code example",
    "status": "PUBLISH",
    "authors": ["Chris Richardson"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1406,
    "saleprice": 145.14,
    "id": 53,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/crichardson.jpg",
    "discount": 0,
    "stock": 15
  },
  {
    "name": "Hibernate in Action",
    "isbn": "193239415X",
    "pages": 400,
    "year": 2004,
    "shortDescription": "\"2005 Best Java Book!\" -- Java Developer's Journal",
    "longDescription": "Hibernate practically exploded on the Java scene. Why is this open-source tool so popular Because it automates a tedious task: persisting your Java objects to a relational database. The inevitable mismatch between your object-oriented code and the relational database requires you to write code that maps one to the other. This code is often complex, tedious and costly to develop. Hibernate does the mapping for you. Not only that, Hibernate makes it easy. Positioned as a layer between your application and your database, Hibernate takes care of loading and saving of objects. Hibernate applications are cheaper, more portable, and more resilient to change. And they perform better than anything you are likely to develop yourself. Hibernate in Action carefully explains the concepts you need, then gets you going. It builds on a single example to show you how to use Hibernate in practice, how to deal with concurrency and transactions, how to efficiently retrieve objects and use caching. The authors created Hibernate and they field questions from the Hibernate community every day - they know how to make Hibernate sing. Knowledge and insight seep out of every pore of this book.",
    "status": "PUBLISH",
    "authors": ["Christian Bauer", "Gavin King"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1404,
    "saleprice": 48.48,
    "id": 20,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bauer.jpg",
    "discount": 15,
    "stock": 12
  },
  {
    "name": "SWT/JFace in Action",
    "isbn": "1932394273",
    "pages": 496,
    "year": 2004,
    "shortDescription": "Guides you through the process of developing Eclipse-based GUIs and shows how to build applications with features your users will love. Packed with examples and no fluff.",
    "longDescription": "SWT and JFace are Eclipse's graphical libraries. They enable you to build nimble and powerful Java GUIs--but this is only the beginning. With Draw2D and the Graphical Editing Framework, you can go beyond static applications and create full-featured editors. And with the Rich Client Platform, you can build customized workbenches whose capabilities far exceed those of traditional interfaces. SWT/JFace in Action covers the territory, from simple widgets to complex graphics. It guides you through the process of developing Eclipse-based GUIs and shows how to build applications with features your users will love. The authors share their intimate knowledge of the subject with you in a friendly, readable style. This book encourages you to learn through action. Each topic provides extensive code to show you how SWT/JFace works in practical applications. Not only do these examples help you understand the subject, they are a working set of programs you can reuse in your own interfaces.",
    "status": "PUBLISH",
    "authors": [
      "Matthew Scarpino",
      "Stephen Holder",
      "Stanford Ng",
      "Laurent Mihalkovic"
    ],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1396,
    "saleprice": 5.83,
    "id": 222,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/scarpino.jpg",
    "discount": 6,
    "stock": 45
  },
  {
    "name": "Geoprocessing with Python",
    "isbn": "1617292141",
    "pages": 300,
    "status": "MEAP",
    "authors": ["Chris Garrard"],
    "categories": ["Python", "BackEnd"],
    "timesSold": 1376,
    "saleprice": 180.2,
    "id": 382,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/garrard.jpg",
    "year": 1962,
    "discount": 0,
    "stock": 1,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Hello! HTML5 & CSS3",
    "isbn": "1935182897",
    "pages": 325,
    "year": 2012,
    "shortDescription": "Quick and Easy HTML5 and CSS3 is written for the web designer or developer who wants a fast, example-oriented introduction to the new HTML and CSS features. After a quick review of the basics, you'll turn to what's new. Start by learning to apply important new elements and attributes by building your first real HTML5 pages. You'll then take a quick tour through the new APIs: Form Validation, Canvas, Drag & Drop, Geolocation and Offline Applications. You'll also discover how to include video and audio on your pages without plug-ins, and how to draw interactive vector graphics with SVG.",
    "longDescription": "HTML and CSS are the foundation of the web, and HTML5 and CSS3 are the latest standards. If you build web pages, mobile apps, or do any type of development at all, you'll have to learn HTML5 and CSS3, so why not start now Quick and Easy HTML5 and CSS3 will give you a smart, snappy, and fun introduction to building web sites with these really cool new tools. Quick and Easy HTML5 and CSS3 is written for the web designer or developer who wants a fast, example-oriented introduction to the new HTML and CSS features. After a quick review of the basics, you'll turn to what's new. Start by learning to apply important new elements and attributes by building your first real HTML5 pages. You'll then take a quick tour through the new APIs: Form Validation, Canvas, Drag & Drop, Geolocation and Offline Applications. You'll also discover how to include video and audio on your pages without plug-ins, and how to draw interactive vector graphics with SVG. Once you've explored the fundamentals of HTML5, it's time to add some style to your pages with CSS3. New CSS features include drop shadows, borders, colors, gradients and backgrounds. In addition, you'll learn to layout your pages with the new flexible box and layout modules, and add the finishing touches with custom fonts. You'll also see how to target specific devices with media queries, and do all of it with less code thanks to the new selectors and pseudo classes. Finally you will walk through several large examples where you see all the features of HTML5 and CSS3 working together to produce responsive and lightweight applications which you can interact with just like native desktop apps.",
    "status": "PUBLISH",
    "authors": ["Rob Crowther"],
    "categories": ["Internet", "CSS", "HTML", "FrontEnd"],
    "timesSold": 1351,
    "saleprice": 27.84,
    "id": 55,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/crowther.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "iText in Action, Second Edition",
    "isbn": "1935182617",
    "pages": 600,
    "year": 2010,
    "shortDescription": "iText in Action, Second Edition offers an introduction and a practical guide to iText and the internals of PDF. While at the entry level iText is easy to learn, there's an astonishing range of things you can do once you dive below the surface. This book lowers the learning curve and, though numerous innovative and practical examples, unlocks the secrets hidden in Adobe's PDF Reference. The examples are in Java but they can be easily adapted to .NET using one of iText's .NET ports: iTextSharp or iText.NET.",
    "longDescription": "Far from a static document presentation format, PDF supports many dynamic or interactive features. With iText, the leading tool creating and manipulating PDF programmatically, you can transform PDF documents into live, interactive applications quickly and easily. iText, a free, open source library for Java and .NET, was developed and maintained by Bruno Lowagie, the author of this book, with the help of many contributors. iText in Action, Second Edition offers an introduction and a practical guide to iText and the internals of PDF. While at the entry level iText is easy to learn, there's an astonishing range of things you can do once you dive below the surface. This book lowers the learning curve and, though numerous innovative and practical examples, unlocks the secrets hidden in Adobe's PDF Reference. The examples are in Java but they can be easily adapted to .NET using one of iText's .NET ports: iTextSharp or iText.NET. This totally revised new edition introduces the new functionality added to iText in recent releases, and it updates all examples from JDK 1.4 to Java 5. You'll learn how to use traditional and new form types in PDF, including full coverage of the AcroForm technology. You'll also explore the XML Forms Architecture (XFA) and learn how to fill static and dynamic XFA forms with iText. Along the way, you'll discover new techniques for linking documents, creating a PDF based on records in a database, and much more. WHAT'S INSIDE * Serve PDF to a browser * Automate both static and dynamic XFA forms * Generate dynamic PDF documents from XML files or databases * Use PDF's many interactive features * Add bookmarks, page numbers, watermarks, etc. * Split, concatenate, and manipulate PDF pages * Add digital signatures to a PDF file * New hands-on, ready to use examples",
    "status": "PUBLISH",
    "authors": ["Bruno Lowagie"],
    "categories": ["Java", "Java", "Git", "BackEnd"],
    "timesSold": 1351,
    "saleprice": 174.87,
    "id": 149,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lowagie2.jpg",
    "discount": 0,
    "stock": 46
  },
  {
    "name": "SNA and TCP/IP Enterprise Networking",
    "isbn": "131271687",
    "pages": 540,
    "year": 1997,
    "shortDescription": "SNA and TCP/IP Enterprise Networking shows the reader how enterprise networking evolved, what approaches and techniques can be used today, and where tomorrow's trends lie, illustrating among others Web-to-SNA connectivity and Java based integration approaches.",
    "longDescription": "Most textbooks concentrate on presenting the theory, concepts, and products, with examples of implementations in some cases. The distinctive quality of SNA and TCP/IP Enterprise Networking is in its structure. It answers not only \"What \", \"Why \", and \"How \", but also \"What's next \". It shows the reader how enterprise networking evolved, what approaches and techniques can be used today, and where tomorrow's trends lie, illustrating among others Web-to-SNA connectivity and Java based integration approaches. SNA and TCP/IP Enterprise Networking was written by visionaries, scientists, networking product developers, industry experts, consultants, and end-user representatives, who not only implement the products but also participate in definition of open networking standards. It should be equally appealing to the network practitioners implementing technology as the senior managers making strategic decisions on enterprise networking.",
    "status": "PUBLISH",
    "authors": [
      "Daniel C. Lynch",
      "James P. Gray",
      "and Edward Rabinovitch",
      "editors"
    ],
    "categories": ["Software Engineering", "Theory", "Java", "BackEnd"],
    "timesSold": 1336,
    "saleprice": 193.85,
    "id": 151,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lynch.jpg",
    "discount": 0,
    "stock": 19
  },
  {
    "name": "Server-Based Java Programming",
    "isbn": "1884777716",
    "pages": 592,
    "year": 2000,
    "longDescription": "Java on the server is here to stay. Whether you're using J2EE or writing your own, you will need to understand the fundamental concepts of server-based Java. Server-Based Java Programming teaches those concepts of Java that underlie the J2EE APIs and the best ways to use them. An ongoing focus on the full lifecycle, including administration and deployment, makes this book a rare, practical guide. One of its themes is the theoretical \"three-zeroes\" goal for server development--zero development, zero administration, and zero deployment. Server-Based Java Programming isn't just about implementation--it's also about architecture, and design. You'll learn how to write the code that sustains a cutting-edge enterprise. You will learn nuts-and-bolts topics like ClassLoaders, threads, CORBA, RMI/IIOP, and JNI, as well as how to make each of these contribute to enterprise-wide goals such as fault-tolerance, easier system administration, five-nine availability, deployment without headaches, and lower development costs.",
    "status": "PUBLISH",
    "authors": ["Ted Neward"],
    "categories": ["Java", "Client-Server", "Internet", "Java", "BackEnd"],
    "timesSold": 1332,
    "saleprice": 102.87,
    "id": 173,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/neward3.jpg",
    "discount": 11,
    "stock": 8
  },
  {
    "name": "iBATIS in Action",
    "isbn": "1932394826",
    "pages": 384,
    "year": 2007,
    "shortDescription": " Gets new users going and gives experienced users in-depth coverage of advanced features. Jeff Cunningham, The Weather Channel Interactive",
    "longDescription": "Unlike some complex and invasive persistence solutions, iBATIS keeps O/RM clean and simple. It is an elegant persistence framework that maps classes to SQL statements and keeps the learning curve flat. The iBATIS approach makes apps easy to code, test, and deploy. You write regular SQL and iBATIS gives you standard objects for persistence and retrieval. There s no need to change existing database schemas iBATIS is tolerant of legacy databases (even badly designed ones). iBATIS in Action is a comprehensive tutorial on the framework and an introduction to the iBATIS philosophy. Clinton Begin and coauthors lead you through the core features, including configuration, statements, and transactions. Because you ll need more than the basics, it explores sophisticated topics like Dynamic SQL and data layer abstraction. You ll also learn a useful skill: how to extend iBATIS itself. A complete, detailed example shows you how to put iBATIS to work. Topics are clearly organized and easily accessible for reference.",
    "status": "PUBLISH",
    "authors": ["Clinton Begin", "Brandon Goodin", "Larry Meadors"],
    "categories": ["Web Development", "SQL", "BackEnd", "Database"],
    "timesSold": 1318,
    "saleprice": 14.19,
    "id": 24,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/begin.jpg",
    "discount": 0,
    "stock": 5
  },
  {
    "name": "Building Well-Structured JavaScript Applications",
    "isbn": "1617290599",
    "pages": 300,
    "status": "MEAP",
    "authors": ["Julio C. Ody"],
    "categories": ["Javascript", "Javascript", "Java", "BackEnd", "FrontEnd"],
    "timesSold": 1298,
    "saleprice": 196.15,
    "id": 295,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://firebasestorage.googleapis.com/v0/b/sneakers-f658b.appspot.com/o/librosCoverImages%2FbackupCover.jpg?alt=media&token=fac8620f-a908-4588-a2ed-c1fa07eb12f3",
    "year": 1953,
    "discount": 18,
    "stock": 35,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "SQL Server MVP Deep Dives",
    "isbn": "1935182048",
    "pages": 848,
    "year": 2009,
    "shortDescription": "SQL Server MVP Deep Dives is organized into five parts: Design and Architecture, Development, Administration, Performance Tuning and Optimization, and Business Intelligence. In each, you'll find concise, brilliantly clear chapters that take on key topics like mobile data strategies, Dynamic Management Views, or query performance.",
    "longDescription": "This is no ordinary SQL Server book. In SQL Server MVP Deep Dives, the world's leading experts and practitioners offer a masterful collection of techniques and best practices for SQL Server development and administration. 53 MVPs each pick an area of passionate interest to them and then share their insights and practical know-how with you. SQL Server MVP Deep Dives is organized into five parts: Design and Architecture, Development, Administration, Performance Tuning and Optimization, and Business Intelligence. In each, you'll find concise, brilliantly clear chapters that take on key topics like mobile data strategies, Dynamic Management Views, or query performance. WHAT'S INSIDE * Topics important for SQL Server pros * Accessible to readers of all levels * New features of SQL Server 2008 Whether you're just getting started with SQL Server or you're an old master looking for new tricks, this book belongs on your bookshelf. The authors of this book have generously donated 100% of their royalties to support War Child International.",
    "status": "PUBLISH",
    "authors": [
      "Contributions from 53 SQL Server MVPs",
      "Edited by Paul Nielsen",
      "Kalen Delaney",
      "Greg Low",
      "Adam Machanic",
      "Paul S. Randal",
      "Kimberly L. Tripp"
    ],
    "categories": ["Microsoft .NET", "SQL", "BackEnd", "Database"],
    "timesSold": 1287,
    "saleprice": 84.67,
    "id": 174,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/nielsen.jpg",
    "discount": 0,
    "stock": 18
  },
  {
    "name": "Hibernate Quickly",
    "isbn": "1932394419",
    "pages": 456,
    "year": 2005,
    "shortDescription": "\"If you want to learn Hibernate quickly, this book shows you step by step.\" - Sang Shin, Java Technology Architect, Sun Microsystems",
    "longDescription": "Positioned as a layer between the application and the database, Hibernate is a powerful object/relational persistence and query service for Java. It takes care of automating a tedious task: the manual bridging of the gap between object oriented code and the relational database. Hibernate Quickly gives you all you need to start working with Hibernate now. The book focuses on the 20% you need 80% of the time. The pages saved are used to introduce you to the Hibernate \"ecosystem\": how Hibernate can work with other common development tools and frameworks like XDoclet, Struts, Webwork, Spring, and Tapestry. The book builds its code examples incrementally, introducing new concepts as it goes. It covers Hibernate's many, useful configuration and design options, breaking a complex subject into digestible pieces. With a gradual \"crawl-walk-run\" approach, the book teaches you what Hibernate is, what it can do, and how you can work with it effectively.",
    "status": "PUBLISH",
    "authors": ["Patrick Peak", "Nick Heudecker"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1261,
    "saleprice": 6.11,
    "id": 193,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/peak.jpg",
    "discount": 0,
    "stock": 2
  },
  {
    "name": "Prototype and Scriptaculous in Action",
    "isbn": "1933988037",
    "pages": 544,
    "year": 2007,
    "longDescription": "Common Ajax tasks should be easy, and with Prototype and Scriptaculous they are. Prototype and Scriptaculous are libraries of reusable JavaScript code that simplify Ajax development. Prototype provides helpful methods and objects that extend JavaScript in a safe, consistent way. Its clever Ajax request model simplifies cross-browser development. Scriptaculous, which is based on Prototype, offers handy pre-fabricated widgets for rich UI development. Prototype and Scriptaculous in Action is a comprehensive, practical guide that walks you feature-by-feature through the two libraries. First, you ll use Scriptaculous to make easy but powerful UI improvements. Then you ll dig into Prototype s elegant and sparse syntax. See how a few characters of Prototype code can save a dozen lines of JavaScript. By applying these techniques, you can concentrate on the function and flow of your application instead of the coding details. This book is written for web developers with a working knowledge of JavaScript.",
    "status": "PUBLISH",
    "authors": ["Dave Crane", "Bear Bibeault with Tom Locke"],
    "categories": [
      "Web Development",
      "Javascript",
      "Javascript",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 1244,
    "saleprice": 203.93,
    "id": 52,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/crane3.jpg",
    "discount": 0,
    "stock": 39
  },
  {
    "name": "SQL Server 2005 Reporting Services in Action",
    "isbn": "1932394761",
    "pages": 600,
    "year": 2006,
    "longDescription": "Reports are the lifeline of business, so a good reporting environment is a big deal. With a powerful tool like Microsoft Reporting Services, .NET developers can add reporting to any type of application, regardless of its target platform or development language. Greatly improved for SQL Server 2005, Reporting Services now provides tighter integration with SQL Server, improved developer tools, and an expanded array of options to empower end users. SQL Server 2005 Reporting Services in Action helps you build and manage flexible reporting solutions and develop report-enabled applications. In this clear, well-illustrated book, you ll follow a report from creation to publication. Along the way you ll explore flexible delivery options like web-based, on-demand, and subscribed reports complete with cool new features like direct printing and client-side sorting. For applications that require custom reporting, you'll learn to define reports with RDL and push them to the Report Server using the Report Manager Web Service API. You ll also see how to write server extensions to expand the range of data processing and report delivery options. Written for developers with a solid foundation in .NET and SQL Server.",
    "status": "PUBLISH",
    "authors": ["Bret Updegraff"],
    "categories": ["Microsoft", "SQL", "BackEnd", "Database"],
    "timesSold": 1230,
    "saleprice": 30.23,
    "id": 252,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/updegraff.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "Spring in Action, Second Edition",
    "isbn": "1933988134",
    "pages": 768,
    "year": 2007,
    "longDescription": "Spring is a fresh breeze blowing over the Java landscape. Based on the principles of dependency injection, interface-oriented design, and aspect-oriented programming, Spring combines enterprise application power with the simplicity of plain-old Java objects (POJOs). In this second edition, Spring in Action has been completely updated to cover the exciting new features of Spring 2.0. The book begins by introducing you to the core concepts of Spring and then quickly launches into a hands-on exploration of the framework. Combining short code snippets and an ongoing example developed throughout the book, it shows you how to build simple and efficient J2EE applications. You will see how to solve persistence problems, handle asynchronous messaging, create and consume remote services, build web applications, and integrate with most popular web frameworks. You will learn how to use Spring to write simpler, easier to maintain code so that you can focus on what really matters--your critical business needs.",
    "status": "PUBLISH",
    "authors": ["Craig Walls with Ryan Breidenbach"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1228,
    "saleprice": 118.23,
    "id": 258,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/walls3.jpg",
    "discount": 0,
    "stock": 23
  },
  {
    "name": "Lucene in Action",
    "isbn": "1932394281",
    "pages": 456,
    "year": 2004,
    "longDescription": "Lucene is a gem in the open-source world--a highly scalable, fast search engine. It delivers performance and is disarmingly easy to use. Lucene in Action is the authoritative guide to Lucene. It describes how to index your data, including types you definitely need to know such as MS Word, PDF, HTML, and XML. It introduces you to searching, sorting, filtering, and highlighting search results. Lucene powers search in surprising places--in discussion groups at Fortune 100 companies, in commercial issue trackers, in email search from Microsoft, in the Nutch web search engine (that scales to billions of pages). It is used by diverse companies including Akamai, Overture, Technorati, HotJobs, Epiphany, FedEx, Mayo Clinic, MIT, New Scientist Magazine, and many others. Adding search to your application can be easy. With many reusable examples and good advice on best practices, Lucene in Action shows you how. And if you would like to search through Lucene in Action over the Web, you can do so using Lucene itself as the search engine--take a look at the authors' awesome Search Inside solution. Its results page resembles Google's and provides a novel yet familiar interface to the entire book and book blog.",
    "status": "PUBLISH",
    "authors": ["Erik Hatcher", "Otis Gospodnetic"],
    "categories": ["Java", "HTML", "BackEnd", "FrontEnd"],
    "timesSold": 1227,
    "saleprice": 92.01,
    "id": 90,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hatcher2.jpg",
    "discount": 0,
    "stock": 40
  },
  {
    "name": "Camel in Action",
    "isbn": "1935182366",
    "pages": 375,
    "year": 2011,
    "shortDescription": "Camel in Action is for developers working with integration of any kind. This highly practical book introduces Camel and shows examples of how to use it with the 45+ supported enterprise integration patterns. Written by the people who wrote the Camel code, it's up to date and distills details and insights that only people deeply involved with Camel could provide.",
    "longDescription": "Apache Camel is a Java-based toolkit that makes it easy to implement services based on standard enterprise integration patterns (EIP). Through a concise, but sophisticated domain specific language (DSL), you can build integration logic in lego style. The Camel DSL is implemented in a range of standard programming languages such as Java, XML, Scala, Groovy, Ruby, and Python. Camel provides components for using these patterns via commonly used transports such as JMS, HTTP, REST, File/FTP, JPA, SMTP, and more than 50 others. No transport Camel provides a flexible pluggable architecture to build your own components. Or you can let Camel adapt to your existing libraries without the need to change anything. Camel in Action is for developers working with integration of any kind. This highly practical book introduces Camel and shows examples of how to use it with the 45+ supported enterprise integration patterns. Written by the people who wrote the Camel code, it's up to date and distills details and insights that only people deeply involved with Camel could provide. Camel is designed to run in any existing environment without imposing restrictions. This allows you to get started with Camel very easily and reuse existing infrastructure and platforms. Camel can run in many forms such as standalone, web or Spring application, JBI, OSGi, Java EE, in the cloud, and so on. The book includes a technical reference explaining how to use Camel with many platforms.",
    "status": "PUBLISH",
    "authors": ["Claus Ibsen", "Jonathan Anstey"],
    "categories": ["Java", "Python", "Java", "BackEnd"],
    "timesSold": 1215,
    "saleprice": 95.13,
    "id": 104,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ibsen.jpg",
    "discount": 15,
    "stock": 1
  },
  {
    "name": "Scala in Depth",
    "isbn": "1935182706",
    "pages": 300,
    "year": 2012,
    "shortDescription": "Scala in Depth is a unique new book designed to help you integrate Scala effectively into your development process. By presenting the emerging best practices and designs from the Scala community, it guides you though dozens of powerful techniques example by example. There's no heavy-handed theory here-just lots of crisp, practical guides for coding in Scala. For example: * Discover the \"sweet spots\" where object-oriented and functional programming intersect. * Master advanced OO features of Scala, including type member inheritance, multiple inheritance and composition. * Employ functional programming concepts like tail recursion, immutability, and monadic operations. * Learn good Scala style to keep your code concise, expressive and readable. As you dig into the book, you'll start to appreciate what makes Scala really shine. For instance, the Scala type system is very, very powerful; this book provides use case approaches to manipulating the type system and covers how to use type constraints to enforce design constraints. Java developers love Scala's deep integration with Java and the JVM Ecosystem, and this book shows you how to leverage it effectively and work around the rough spots.",
    "longDescription": "Scala is a unique and powerful new programming language for the JVM. Blending the strengths of the Functional and Imperative programming models, Scala is a great tool for building highly concurrent applications without sacrificing the benefits of an OO approach. While information about the Scala language is abundant, skilled practitioners, great examples, and insight into the best practices of the community are harder to find. Scala in Depth bridges that gap, preparing you to adopt Scala successfully for real world projects. Scala in Depth is a unique new book designed to help you integrate Scala effectively into your development process. By presenting the emerging best practices and designs from the Scala community, it guides you though dozens of powerful techniques example by example. There's no heavy-handed theory here-just lots of crisp, practical guides for coding in Scala. For example: * Discover the \"sweet spots\" where object-oriented and functional programming intersect. * Master advanced OO features of Scala, including type member inheritance, multiple inheritance and composition. * Employ functional programming concepts like tail recursion, immutability, and monadic operations. * Learn good Scala style to keep your code concise, expressive and readable. As you dig into the book, you'll start to appreciate what makes Scala really shine. For instance, the Scala type system is very, very powerful; this book provides use case approaches to manipulating the type system and covers how to use type constraints to enforce design constraints. Java developers love Scala's deep integration with Java and the JVM Ecosystem, and this book shows you how to leverage it effectively and work around the rough spots.",
    "status": "PUBLISH",
    "authors": ["Joshua D. Suereth"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1201,
    "saleprice": 203.81,
    "id": 242,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/suereth.jpg",
    "discount": 0,
    "stock": 29
  },
  {
    "name": "Taming Jaguar",
    "isbn": "1884777686",
    "pages": 362,
    "year": 2000,
    "longDescription": "Taming Jaguar is part of the PowerBuilder Developer's series, which includes Distributed Application Development with PowerBuilder 6 and Jaguar Development with PowerBuilder 7. An application server is the heart of your enterprise computing architecture, centralizing your web content, business logic, and access to your data and legacy applications. Sybase's application server, Jaguar CTS, delivers performance, scalability, and flexibility running CORBA , COM, Java/EJB, C++, and PowerBuilder components. If you are looking to adopt Jaguar in your enterprise, look no further. Taming Jaguar shows you how to solve the real-world problems of installing, trouble-shooting, designing, developing, and maintaining a Jaguar application. Topical chapters are organized in a Q & A format making it easy for you to quickly find the solution to your problem. They also provide foundational and background information as well as detailed technical how-tos. Although designed so you can find your problems easily, this book is meant to be read cover-to-cover with each chapter discussing its topic exhaustively. What's inside: J2EE development Java Servlets Jaguar administration & code balancing EJBs Web development with PowerDynamo Advanced component design ",
    "status": "PUBLISH",
    "authors": ["Michael J. Barlotta", "Jason R. Weiss"],
    "categories": ["PowerBuilder", "Java", "BackEnd"],
    "timesSold": 1189,
    "saleprice": 82.96,
    "id": 18,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/barlotta3.jpg",
    "discount": 0,
    "stock": 12
  },
  {
    "name": "JavaFX in Action",
    "isbn": "1933988991",
    "pages": 373,
    "year": 2009,
    "longDescription": "Whether you're writing a desktop app, spinning up a rich web interface, or pushing code to a mobile phone, graphics programming should be easier, and more fun, than it currently is. New technologies and devices not to mention higher user expectations have greatly multiplied the complexity level of interface programming. Enter JavaFX. JavaFX is a set of Java-based rich user interface technologies that sits atop the existing Java Standard and Micro Editions, making current Java packages readily accessible from the JavaFX environment. At its heart is JavaFX Script, an innovative, compiled, domain specific language. JavaFX Script boasts a declarative syntax where the code structure mirrors the structure of the interface. Related UI pieces are kept in one efficient bundle, not strewn across multiple locations. A simple coding model reduces code complexity while increasing productivity. The JavaFX-specific libraries for presentation and animation take advantage of JavaFX Script's unique language features. JavaFX in Action is a hands-on tutorial that introduces and explores JavaFX through numerous bite-sized projects. The book provides a solid grounding in the JavaFX syntax and related APIs by showing you how to apply the key features of the JavaFX platform. You'll absorb the fundamentals of the technology while exploring the possibilities JavaFX open up for your designs. Author Simon Morris helps you transform variables and operators into bouncing raindrops, brilliant colors, and dancing interface components. Below the chrome, you'll master techniques to make your applications more responsive and user friendly. You'll also learn how to interact with your existing Java code so you can give your old apps some new JavaFX sparkle.",
    "status": "PUBLISH",
    "authors": ["Simon Morris"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1183,
    "saleprice": 128.43,
    "id": 167,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/morris.jpg",
    "discount": 7,
    "stock": 11
  },
  {
    "name": "Dependency Injection",
    "isbn": "193398855X",
    "pages": 352,
    "year": 2009,
    "shortDescription": " If you do large scale java apps, you probably want to have someone on the team have this book. Michael Neale",
    "longDescription": "In object-oriented programming, a central program normally controls other objects in a module, library, or framework. With dependency injection, this pattern is inverted a reference to a service is placed directly into the object which eases testing and modularity. Spring or Google Guice use dependency injection so you can focus on your core application and let the framework handle infrastructural concerns. Dependency Injection explores the DI idiom in fine detail, with numerous practical examples that show you the payoffs. You'll apply key techniques in Spring and Guice and learn important pitfalls, corner-cases, and design patterns. Readers need a working knowledge of Java but no prior experience with DI is assumed.",
    "status": "PUBLISH",
    "authors": ["Dhanji R. Prasanna"],
    "categories": ["Microsoft .NET", "Java", "BackEnd"],
    "timesSold": 1171,
    "saleprice": 81.16,
    "id": 200,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/prasanna.jpg",
    "discount": 0,
    "stock": 37
  },
  {
    "name": "Grails in Action",
    "isbn": "1933988932",
    "pages": 520,
    "year": 2009,
    "shortDescription": "Grails in Action is a comprehensive guide to the Grails framework. First, the basics: the domain model, controllers, views, and services. Then, the fun! Dive into a Twitter-style app with features like AJAX/JSON, animation, search, wizards even messaging and Jabber integration. Along the way, you'll discover loads of great plugins that'll make your app shine. Learn to integrate with existing Java systems using Spring and Hibernate. You'll need basic familiarity with Java and the web.",
    "longDescription": "Web apps shouldn't be hard to build, right The developers of Grails agree. This hyper-productive open-source web framework lets you \"code by convention\", leaving you to focus on what makes your app special. Through its use of Groovy, it gives you a powerful, Java-like language and full access to all Java libraries. And you can adapt your app's behavior at runtime without a server restart. Grails in Action is a comprehensive guide to the Grails framework. First, the basics: the domain model, controllers, views, and services. Then, the fun! Dive into a Twitter-style app with features like AJAX/JSON, animation, search, wizards even messaging and Jabber integration. Along the way, you'll discover loads of great plugins that'll make your app shine. Learn to integrate with existing Java systems using Spring and Hibernate. You'll need basic familiarity with Java and the web. Prior experience with Groovy is not necessary.",
    "status": "PUBLISH",
    "authors": ["Glen Smith", "Peter Ledbrook"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1166,
    "saleprice": 185.65,
    "id": 83,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/gsmith.jpg",
    "discount": 0,
    "stock": 3
  },
  {
    "name": "Java 3D Programming",
    "isbn": "1930110359",
    "pages": 400,
    "year": 2002,
    "longDescription": "Java 3D Programming steps programmers through the important design and implementation phases of developing a successful Java 3D application. The book provides invaluable guidance on whether to use Java 3D, user interface design, geometry creation, scene manipulation and final optimizations. The book does not attempt to exhaustively cover the API or replicate the official documentation but rather serves as a roadmap to alert programmers of design issues and potential pitfalls. The author distills 12 months of using the Java 3D API for commercial projects, as well as innumerable discussions on the Java 3D email list into a book that all Java 3D developers will appreciate. Experienced Java 3D developers will applaud an authoritative resource containing the state-of-the-art in techniques and workarounds, while novice Java 3D programmers will gain a fast-track into Java 3D development, avoiding the confusion, frustration and time wasted learning Java 3D techniques and terminology. Java 3D Programming comes complete with a comprehensive set of programming examples to illustrate the techniques, features, workarounds and bug fixes contained in the main text. Readers of this book would include students and postgraduate researchers developing visualization applications for academia. Moderately experienced in Java, some experience of 3D graphics, little or no experience of Java 3D is needed. R+D s/w engineers at commercial institutions. Experienced Java developers, experienced with OpenGL or VRML, little or no experience with Java 3D.",
    "status": "PUBLISH",
    "authors": ["Daniel Selman"],
    "categories": ["Java", "Internet", "Computer Graph", "Java", "BackEnd"],
    "timesSold": 1160,
    "saleprice": 47.31,
    "id": 226,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/selman.jpg",
    "discount": 0,
    "stock": 26
  },
  {
    "name": "Programming Web Services with Java",
    "isbn": "1930110421",
    "pages": 300,
    "year": 2002,
    "status": "PUBLISH",
    "authors": ["Ajamu A. Wesley"],
    "categories": ["Java", "BackEnd"],
    "timesSold": 1159,
    "saleprice": 67.65,
    "id": 279,
    "type": ["hardcover"],
    "imageurl": "https://firebasestorage.googleapis.com/v0/b/sneakers-f658b.appspot.com/o/librosCoverImages%2FbackupCover.jpg?alt=media&token=fac8620f-a908-4588-a2ed-c1fa07eb12f3",
    "discount": 0,
    "stock": 20,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "XDoclet in Action",
    "isbn": "1932394052",
    "pages": 624,
    "year": 2003,
    "longDescription": "Are you tired of writing the same Java code, over and over again XDoclet will take the burden of repetitive development tasks off your shoulders by automating them. XDoclet is a metadata-driven, code generation engine for Java. Starting from simple JavaDoc-style comments, it generates deployment descriptors, interfaces, framework classes and other utility classes your project requires. XDoclet in Action is an easy to read introduction to XDoclet and its uses. It is a resource on code generation with this popular open source tool. With many short code examples and a full-scale J2EE example, the book shows you how to use XDoclet with EJBs, Servlets, JMX, and other technologies. You'll also learn how to customize XDoclet beyond its out-of-the-box capabilities to generate code specific to your application. With this book you will learn how to write less code, how to keep your application components in sync, and how to keep your deployment, interface, utility and other information all in one place.",
    "status": "PUBLISH",
    "authors": ["Craig Walls", "Norman Richards"],
    "categories": ["XML", "Java", "Java", "BackEnd"],
    "timesSold": 1149,
    "saleprice": 122.93,
    "id": 256,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/walls.jpg",
    "discount": 12,
    "stock": 21
  },
  {
    "name": "jQuery in Action, Second Edition",
    "isbn": "1935182323",
    "pages": 488,
    "year": 2010,
    "shortDescription": "jQuery in Action, Second Edition is a fast-paced introduction to jQuery that will take your JavaScript programming to the next level. An in-depth rewrite of the bestselling first edition, this edition provides deep and practical coverage of the latest jQuery and jQuery UI releases. The book's unique \"lab pages\" anchor the explanation of each new concept in a practical example. You'll learn how to traverse HTML documents, handle events, perform animations, and add Ajax to your web pages. This comprehensive guide also teaches you how jQuery interacts with other tools and frameworks and how to build jQuery plugins. ",
    "longDescription": "A really good web development framework anticipates your needs. jQuery does more it practically reads your mind. Developers fall in love with this JavaScript library the moment they see 20 lines of code reduced to three. jQuery is concise and readable. Its unique \"chaining\" model lets you perform multiple operations on a page element in succession. And with version 1.4, there's even more to love about jQuery, including new effects and events, usability improvements, and more testing options. jQuery in Action, Second Edition is a fast-paced introduction and guide. Building on the bestselling first edition, it adds new examples, more labs, and deeper explanations of important features. You ll learn how to traverse HTML documents, handle events, perform animations, and add Ajax to your web pages. The book's unique \"lab pages\" anchor the explanation of each new concept in a practical example. You'll learn how jQuery interacts with other tools and frameworks and how to build jQuery plugins. This book requires a modest knowledge of JavaScript and Ajax.",
    "status": "PUBLISH",
    "authors": ["Bear Bibeault", "Yehuda Katz"],
    "categories": [
      "Java",
      "Javascript",
      "Javascript",
      "HTML",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 1132,
    "saleprice": 9.57,
    "id": 28,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bibeault2.jpg",
    "discount": 0,
    "stock": 38
  },
  {
    "name": "OSGi in Depth",
    "isbn": "193518217X",
    "pages": 325,
    "year": 2011,
    "shortDescription": "Enterprise OSGi shows a Java developer how to develop to the OSGi Service Platform Enterprise specification, an emerging Java-based technology for developing modular enterprise applications. Enterprise OSGi addresses several shortcomings of existing enterprise platforms, such as allowing the creation of better maintainable and extensible applications, and provide a simpler, easier-to-use, light-weight solution to enterprise software development.",
    "longDescription": "A good application framework greatly simplifies a developer's task by providing reusable code modules that solve common, tedious, or complex tasks. Writing a great framework requires an extraordinary set of skills-ranging from deep knowledge of a programming language and target platform to a crystal-clear view of the problem space where the applications to be developed using the framework will be used. OSGi Application Frameworks shows a Java developer how to build frameworks based on the OSGi service platform. OSGi, an emerging Java-based technology for developing modular applications, is a great tool for framework building. A framework itself, OSGi allows the developer to create a more intuitive, modular framework by isolating many of the key challenges the framework developer faces. This book begins by describing the process, principles, and tools you must master to build a custom application framework. It introduces the fundamental concepts of OSGi, and then shows you how to put OSGi to work building various types of frameworks that solve specific development problems. OSGi is particularly useful for building frameworks that can be easily extended by developers to create domain-specific applications. This book teaches the developer to break down a problem domain into its abstractions and then use OSGi to create a modular framework solution. Along the way, the developer learns software engineering practices intrinsic to framework building that result in systems with better software qualities, such as flexibility, extensibility, and maintainability. Author Alexandre Alves guides you through major concepts, such as the definition of programming models and modularization techniques, and complements them with samples that have real applicability using industry-proved technologies, such as Spring-DM and Equinox.",
    "status": "PUBLISH",
    "authors": ["Alexandre de Castro Alves"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1110,
    "saleprice": 204.34,
    "id": 9,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/alves.jpg",
    "discount": 5,
    "stock": 0
  },
  {
    "name": "Distributed Agile in Action",
    "isbn": "1935182412",
    "pages": 325,
    "shortDescription": "Distributed Agile in Action is the first book to directly address the unique task of going Agile in a distributed team. Rather than rehashing Agile theories, this book supplies the practical examples and step by step advice you need to help your distributed teams adopt and embrace Agile principles. It's a distilled and carefully organized learning aid for working in a distributed Agile environment, with in-depth focus on how to approach three critical components of development-People, Process and Technology.",
    "longDescription": "As organizations try to do more with less, development teams are less likely to be centrally located, tightly-managed, and permanent. Distributed organizations face special challenges when implementing Agile processes, which rely on frequent communication and responsive teams. Distributed Agile in Action is a guide to running successful Agile projects within geographically and culturally diverse organizations. Distributed Agile in Action is the first book to directly address the unique task of going Agile in a distributed team. Rather than rehashing Agile theories, this book supplies the practical examples and step by step advice you need to help your distributed teams adopt and embrace Agile principles. It's a distilled and carefully organized learning aid for working in a distributed Agile environment, with in-depth focus on how to approach three critical components of development-People, Process and Technology. It's jam-packed with suggestions and stories gained from the authors' distributed Agile journey working with teams spread across cultures, continents, and time zones. The book includes a complete case study presenting an increasingly-common project scenario. This book is written for developers and project managers in distributed teams. Although the examples and case study are presented in Java / Java EE, best practices from rest of the book are technology agnostic and would work equally well for any environment.",
    "status": "MEAP",
    "authors": ["Vikas Hazrati", "Balaji D Loganathan"],
    "categories": ["Software Engineering", "Java", "BackEnd"],
    "timesSold": 1104,
    "saleprice": 118.3,
    "id": 96,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hazrati.jpg",
    "year": 2010,
    "discount": 0,
    "stock": 21
  },
  {
    "name": "EJB 3 in Action, Second Edition",
    "isbn": "1935182994",
    "pages": 300,
    "year": 2014,
    "shortDescription": "Building on the bestselling first edition, EJB 3 in Action, Second Edition tackles EJB 3.1 head-on, through numerous code samples, real-life scenarios, and illustrations. This book is a fast-paced tutorial for Java EE 6 business component development using EJB 3.1, JPA 2 and CDI. Besides covering the basics of EJB 3.1, this book includes in-depth EJB 3.1 internal implementation details, best practices, design patterns, and performance tuning tips. The book also discusses using open source frameworks like Seam and Spring with EJB 3.1.",
    "longDescription": "The EJB 3 framework was a major advancement for Java EE developers, providing a consistent, easy to use model to create and extend applications. EJB 3 incorporates a POJO programming model and Java 5 annotations, along with the Java Persistence API (JPA), a standard for object-relational mapping. EJB 3.1, the latest version, adds full support for Context and Dependency Injection (CDI), the new standard for type-safe dependency injection for Java EE. With EJB 3.1 you create true object-oriented applications that are easy to write, maintain, and extend. Building on the bestselling first edition, EJB 3 in Action, Second Edition tackles EJB 3.1 head-on, through numerous code samples, real-life scenarios, and illustrations. This book is a fast-paced tutorial for Java EE 6 business component development using EJB 3.1, JPA 2 and CDI. Besides covering the basics of EJB 3.1, this book includes in-depth EJB 3.1 internal implementation details, best practices, design patterns, and performance tuning tips. The book also discusses using open source frameworks like Seam and Spring with EJB 3.1.",
    "status": "PUBLISH",
    "authors": ["Debu Panda", "Reza Rahman", "Ryan Cuprak", "Michael Remijan"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1099,
    "saleprice": 19.61,
    "id": 185,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/panda2.jpg",
    "discount": 0,
    "stock": 30
  },
  {
    "name": "Silverlight 4 in Action, Revised Edition",
    "isbn": "1935182374",
    "pages": 425,
    "year": 2010,
    "shortDescription": "Silverlight in Action, Revised Edition is a comprehensive guide to Silverlight, taking you from Hello World through the techniques you'll need to build sophisticated rich web apps. This new edition covers all the new features added in the latest versions of Silverlight, Visual Studio, and Expression Blend, along with the best practices emerging in the Silverlight community. With more than 50% new content, you'll take a mind-expanding trip through the technology, features, and techniques required to build applications ranging from media, to custom experiences, to business applications to games.",
    "longDescription": "Anyone who has gotten a taste of what it can do knows that Silverlight represents an entirely new level of rich web interface technology for Microsoft developers. With Silverlight, developers can use JavaScript, C#, and other languages to build user-friendly, interactive, and visually-dazzling web applications that work in most major browsers. Silverlight in Action, Revised Edition is a comprehensive guide to Silverlight, taking you from Hello World through the techniques you'll need to build sophisticated rich web apps. This new edition covers all the new features added in the latest versions of Silverlight, Visual Studio, and Expression Blend, along with the best practices emerging in the Silverlight community. With more than 50% new content, you'll take a mind-expanding trip through the technology, features, and techniques required to build applications ranging from media, to custom experiences, to business applications to games. Beyond the fundamentals, you'll find numerous practical examples of important patterns like the ViewModel (or MVVM) pattern, and effective practices for developing real-world applications. You'll delve into the underlying object model and what makes Silverlight tick. Business application developers will appreciate the coverage of the exciting new.NET RIA Services. Combined with advanced binding and validation techniques, they help you visualize how to make your application development super productive and your architecture flexible enough to implement solutions in any problem domain. Silverlight in Action, Revised Edition devotes extensive coverage to flexible layout components, the extensible control model, the communication framework, and the data-binding features-all cornerstones of software development. You'll master Silverlight's rich media and vivid graphical and animation features. The closing chapters include a variety of Silverlight deployment and customization scenarios. Finally, Silverlight in Action, Revised Edition doesn't leave you in the dark when it comes to testing and debugging your applications. Techniques, tools, and patterns to support testable Silverlight applications are woven throughout the chapters, with additional dedicated content on the specifics of testing and debugging in Silverlight.",
    "status": "PUBLISH",
    "authors": ["Pete Brown"],
    "categories": [
      "Microsoft .NET",
      "Javascript",
      "Javascript",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 1083,
    "saleprice": 68.03,
    "id": 191,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/pbrown.jpg",
    "discount": 0,
    "stock": 41
  },
  {
    "name": "Griffon in Action",
    "isbn": "1935182234",
    "pages": 375,
    "year": 2012,
    "shortDescription": "Griffon in Action is a comprehensive tutorial written for Java developers who want a more productive approach to UI development. In this book, you'll immediately dive into Griffon. After a Griffon orientation and a quick Groovy tutorial, you'll start building examples that explore Griffon's high productivity approach to Swing development. One of the troublesome parts of Swing development is the amount of Java code that is required to get a simple application off the ground.",
    "longDescription": "Although several options exist for interface development in Java, even popular UI toolkits like Swing have been notoriously complex and difficult to use. Griffon, an agile framework that uses Groovy to simplify Swing, makes UI development dramatically faster and easier. In many respects, Griffon is for desktop development what Grails is for web development. While it's based on Swing, its declarative style and approachable level of abstraction is instantly familiar to developers familiar with other technologies such as Flex or JavaFX. Griffon in Action is a comprehensive tutorial written for Java developers who want a more productive approach to UI development. In this book, you'll immediately dive into Griffon. After a Griffon orientation and a quick Groovy tutorial, you'll start building examples that explore Griffon's high productivity approach to Swing development. One of the troublesome parts of Swing development is the amount of Java code that is required to get a simple application off the ground. You'll learn how SwingBuilder (and its cousin builders) present a very palatable alternative in the form of a DSL geared towards building graphical user interfaces. Pair it up with the convention over configuration paradigm, a well tested and tried application source structure (based on Grails) and you have a recipe for quick and effective Swing application development. Griffon in Action covers declarative view development, like the one provided by JavaFX Script, as well as the structure, architecture and life cycle of Java application development",
    "status": "PUBLISH",
    "authors": ["Andres Almiray", "Danno Ferrin", "James Shingler"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1066,
    "saleprice": 188.07,
    "id": 8,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/almiray.jpg",
    "discount": 0,
    "stock": 14
  },
  {
    "name": "NHibernate in Action",
    "isbn": "1932394923",
    "pages": 400,
    "year": 2009,
    "longDescription": "In the classic style of Manning's \"In Action\" series, NHibernate in Action introduces .NET developers to the NHibernate Object/Relational Mapping tool. As NHibernate is a port of Hibernate from Java to .NET, the book is based on Manning's bestselling Hibernate in Action. NHibernate in Action begins by describing how to implement persistence in a layered .NET application. The book then quickly springs into action by introducing NHibernate through a classic \"Hello World\" example. It explains how to configure NHibernate to specify the mapping information between business objects and database tables, and then explores the internal architecture of NHibernate. A complete example application is progressively built with Agile methodologies in mind, which shows readers all kinds of entity and relationship mappings and how to perform CRUD operations. The book also covers advanced techniques like caching, concurrency access, and isolation levels. The Hibernate Query Language (HQL) and criteria query APIs are thoroughly detailed with optimization tips. The last chapters of this book discuss various development scenarios, how to implement the layers of an NHibernate application (covering Windows and Web development), and which tools are available for these tasks. They also provide some solutions for data-binding objects to .NET GUI controls, integrating services, and interacting with components using DataSets. Finally, they explain how to build a complex application involving advanced session management and distributed transactions.",
    "status": "PUBLISH",
    "authors": [
      "Pierre Henri Kuate",
      "Tobin Harris",
      "Christian Bauer",
      "Gavin King"
    ],
    "categories": ["Microsoft .NET", "Java", "BackEnd"],
    "timesSold": 1045,
    "saleprice": 121.85,
    "id": 128,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kuate.jpg",
    "discount": 10,
    "stock": 35
  },
  {
    "name": "SQL Server DMVs in Action",
    "isbn": "1935182730",
    "pages": 352,
    "year": 2011,
    "shortDescription": "SQL Server DMVs in Action shows you how to obtain, interpret, and act on the information captured by DMVs to keep your system in top shape. The over 100 code examples help you master DMVs and give you an instantly reusable SQL library. You'll also learn to use Dynamic Management Functions (DMFs), which provide further details that enable you to improve your system's performance and health.",
    "longDescription": "SQL Server DMVs in Action is a practical guide that shows you how to obtain, interpret, and act on the information captured by DMVs to keep your system in top shape. The samples provided in this book will help you master DMVs and also give you a tested, working, and instantly reusable SQL code library. Every action in SQL Server leaves a set of tiny footprints. SQL Server records that valuable data and makes it visible through Dynamic Management Views, or DMVs. You can use this incredibly detailed information to significantly improve the performance of your queries and better understand what's going on inside your SQL Server system. SQL Server DMVs in Action shows you how to obtain, interpret, and act on the information captured by DMVs to keep your system in top shape. The over 100 code examples help you master DMVs and give you an instantly reusable SQL library. You'll also learn to use Dynamic Management Functions (DMFs), which provide further details that enable you to improve your system's performance and health.",
    "status": "PUBLISH",
    "authors": ["Ian W. Stirk"],
    "categories": ["Microsoft .NET", "SQL", "BackEnd", "Database"],
    "timesSold": 1044,
    "saleprice": 89.73,
    "id": 241,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/stirk.jpg",
    "discount": 0,
    "stock": 25
  },
  {
    "name": "JUnit Recipes",
    "isbn": "1932394230",
    "pages": 752,
    "year": 2004,
    "longDescription": "When testing becomes a developer's habit good things tend to happen--good productivity, good code, and good job satisfaction. If you want some of that, there's no better way to start your testing habit, nor to continue feeding it, than with JUnit Recipes. In this book you will find one hundred and thirty seven solutions to a range of problems, from simple to complex, selected for you by an experienced developer and master tester. Each recipe follows the same organization giving you the problem and its background before discussing your options in solving it. JUnit - the unit testing framework for Java - is simple to use, but some code can be tricky to test. When you're facing such code you will be glad to have this book. It is a how-to reference full of practical advice on all issues of testing, from how to name your test case classes to how to test complicated J2EE applications. Its valuable advice includes side matters that can have a big payoff, like how to organize your test data or how to manage expensive test resources.",
    "status": "PUBLISH",
    "authors": ["J. B. Rainsberger with contributions by Scott Stirling"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1031,
    "saleprice": 73.09,
    "id": 205,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/rainsberger.jpg",
    "discount": 7,
    "stock": 39
  },
  {
    "name": "Struts 2 in Action",
    "isbn": "193398807X",
    "pages": 432,
    "year": 2008,
    "longDescription": "The original Struts project revolutionized Java web development and its rapid adoption resulted in the thousands of Struts-based applications deployed worldwide. Keeping pace with new ideas and trends, Apache Struts 2 has emerged as the product of a merger between the Apache Struts and OpenSymphony WebWork projects, united in their goal to develop an easy-to-use yet feature-rich framework. Struts 2 represents a revolution in design and ease of use when compared to classic Struts. It adds exciting and powerful features such as a plugin framework, JavaServer Faces integration, and XML-free configuration. Struts 2 In Action introduces the Apache Struts 2 web application framework and shows you how to quickly develop professional, production-ready modern web applications. Written by Don Brown, one of the leading developers of Struts 2, Chad Davis, a passionate Struts 2 developer, along with Scott Stanlick, this book gently walks you through the key features of Struts 2 in example-driven, easy-to-digest sections. Struts 2 in Action delivers accurate, seasoned information that can immediately be put to work. This book is designed for working Java web developers especially those with some background in Struts 1 or WebWork. The core content, covering key framework components such as Actions, Results, and Interceptors, includes new features like the annotation-based configuration options. You'll find chapters on Struts 2 plugins, FreeMarker, and migration from Struts 1 and WebWork 2. Finally, new topics such as the Ajax tags, Spring Framework integration, and configuration by convention give familiar subjects new depth.",
    "status": "PUBLISH",
    "authors": ["Donald Brown", "Chad Michael Davis", "Scott Stanlick"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 1027,
    "saleprice": 89.29,
    "id": 59,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/dbrown.jpg",
    "discount": 0,
    "stock": 16
  },
  {
    "name": "Dependency Injection in .NET",
    "isbn": "1935182501",
    "pages": 375,
    "year": 2011,
    "shortDescription": "Dependency Injection in .NET is a comprehensive guide than introduces DI and provides an in-depth look at applying DI practices to .NET apps. In it, you will also learn to integrate DI together with such technologies as Windows Communication Foundation, ASP.NET MVC, Windows Presentation Foundation and other core .NET components.",
    "longDescription": "Dependency Injection (DI) is a software design technique emphasizing Separation of Concerns, Modularity, Extensibility and Testability. Applied well, it enables programmers to successfully deal with complexity in software and add new features to existing apps with greater ease. DI is the key to writing modular software and producing flexible and maintainable code bases. While well-known among Java developers and other practitioners of object-oriented design, DI is only now gaining momentum in the .NET community. The Unity container released by Microsoft patterns & practices and the new Microsoft Extensibility Framework (MEF) make DI more relevant than ever for .NET developers. Dependency Injection in .NET is a comprehensive guide than introduces DI and provides an in-depth look at applying DI practices to .NET apps. In it, you will also learn to integrate DI together with such technologies as Windows Communication Foundation, ASP.NET MVC, Windows Presentation Foundation and other core .NET components. Building on your existing knowledge of C# and the .NET platform, this book will be most beneficial for readers who have already built at least a few software solutions of intermediate complexity. Most examples are in plain C# without use of any particular DI framework. Later, the book introduces several well-known DI frameworks, such as StructureMap, Windsor and Spring.NET. For each framework, it presents examples of its particular usage, as well as examines how the framework relates to the common patterns presented earlier in the book. WHAT'S INSIDE * A thorough introduction to DI principles applied to .NET development * Numerous C#-based examples * A comprehensive catalog of Patterns and Anti-Patterns * Understand the importance of loose coupling * Learn DI Containers including StructureMap, Windsor, Spring.NET and the Microsoft Extensibility Framework * Identify and avoid common traps",
    "status": "PUBLISH",
    "authors": ["Mark Seemann"],
    "categories": ["Microsoft .NET", "Java", "BackEnd"],
    "timesSold": 1021,
    "saleprice": 88.35,
    "id": 225,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/seemann.jpg",
    "discount": 7,
    "stock": 46
  },
  {
    "name": "Web Development with JavaServer Pages",
    "isbn": "1884777996",
    "pages": 300,
    "year": 2000,
    "status": "PUBLISH",
    "authors": ["Duane K. Fields", "Mark A. Kolb"],
    "categories": ["Java", "BackEnd"],
    "timesSold": 1002,
    "saleprice": 119.58,
    "id": 276,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://firebasestorage.googleapis.com/v0/b/sneakers-f658b.appspot.com/o/librosCoverImages%2FbackupCover.jpg?alt=media&token=fac8620f-a908-4588-a2ed-c1fa07eb12f3",
    "discount": 0,
    "stock": 0,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Tapestry in Action",
    "isbn": "1932394117",
    "pages": 580,
    "year": 2004,
    "longDescription": "Many web development frustrations can be traced back to the underlying stateless HTTP protocol. Tapestry represents state and behavior as standard Java objects, methods and properties. That means state management and multithreading are handled by the framework, leaving you with just your application's business logic. Tapestry does more, you do less. Tapestry in Action is the definitive guide to the Tapestry approach: creating full-featured web apps by connecting framework components to economical amounts of application code. Many simple examples show you how to tackle common tasks such as form validation, application localization, client-side scripting, and synchronization between browser and app server. Later chapters discuss more advanced topics including creation of new components and integration with J2EE. If you want to create great web applications using Tapestry and know Java (plus plain-vanilla HTML and a little XML), this book is for you.",
    "status": "PUBLISH",
    "authors": ["Howard M. Lewis Ship"],
    "categories": ["Java", "Internet", "HTML", "Java", "BackEnd", "FrontEnd"],
    "timesSold": 991,
    "saleprice": 122.06,
    "id": 139,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lewisship.jpg",
    "discount": 0,
    "stock": 41
  },
  {
    "name": "Java Persistence with Hibernate, Second Edition",
    "isbn": "1617290459",
    "pages": 300,
    "status": "MEAP",
    "authors": ["Christian Bauer", "Gavin King", "Gary Gregory"],
    "categories": ["Java", "BackEnd"],
    "timesSold": 971,
    "saleprice": 111.16,
    "id": 287,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bauer3.jpg",
    "year": 1955,
    "discount": 0,
    "stock": 46,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "EJB 3 in Action",
    "isbn": "1933988347",
    "pages": 712,
    "year": 2007,
    "longDescription": "EJB 2 is widely used but it comes at a cost procedural, redundant code. EJB 3 is a different animal. By adopting a POJO programming model and Java 5 annotations, it dramatically simplifies enterprise development. A cool new feature, its Java Persistence API, creates a standard for object-relational mapping. You can use it for any Java application, whether inside or outside the EJB container. With EJB 3 you will create true object-oriented applications that are easy to write, maintain and extend. EJB 3 in Action is a fast-paced tutorial for both novice and experienced Java developers. It will help you learn EJB 3 and the JPA quickly and easily. This comprehensive, entirely new EJB 3 book starts with a tour of the EJB 3 landscape. It then moves quickly into core topics like building business logic with session and message-driven beans. You ll find four full chapters on the JPA along with practical code samples, design patterns, performance tuning tips, and best practices for building and deploying scalable applications.",
    "status": "PUBLISH",
    "authors": ["Debu Panda", "Reza Rahman", "Derek Lane"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 966,
    "saleprice": 16.8,
    "id": 184,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/panda.jpg",
    "discount": 0,
    "stock": 39
  },
  {
    "name": "Restlet in Action",
    "isbn": "193518234X",
    "pages": 450,
    "year": 2012,
    "shortDescription": "Restlet in Action gets you started with the Restlet Framework and the REST architecture style. You'll create and deploy applications in record time while learning to use popular RESTful Web APIs effectively. This book looks at the many faces of web development, including server- and client-side, along with cloud computing, mobile Android devices, and semantic web applications. It offers a particular focus on Google's innovative Google Web Toolkit, Google App Engine, and Android technologies.",
    "longDescription": "REpresentational State Transfer, better known as REST, is the architectural style that governs the web's request-and-response resource model. The open source Restlet Framework provides a simple, powerful Java-based API to implement RESTful web applications that supports and integrates with technologies such as Atom, Jetty, JSON, Spring, GWT, Google App Engine, and Android. Restlet in Action gets you started with the Restlet Framework and the REST architecture style. You'll create and deploy applications in record time while learning to use popular RESTful Web APIs effectively. This book looks at the many faces of web development, including server- and client-side, along with cloud computing, mobile Android devices, and semantic web applications. It offers a particular focus on Google's innovative Google Web Toolkit, Google App Engine, and Android technologies. The book takes you though a comprehensive presentation of Restlet's main features, including subjects like security, testing and automatic documentation. You'll learn while following the typical Restlet development process, with consistent illustrations based on a sample RESTful email app. WHAT'S INSIDE * Learn REST and Restlet from the ground up * Deploy locally, to the cloud, or on mobile devices * Numerous illustrations * Reusable code samples * Written by the creators of Restlet! The book requires a basic knowledge of Java and the web, but no prior exposure to REST or Restlet is needed. You'll quickly get the big picture behind REST, the overall design of Restlet and RESTful web development.",
    "status": "PUBLISH",
    "authors": ["Jerome Louvel", "Thierry Boileau", "Philippe Mougin"],
    "categories": ["Internet", "Java", "BackEnd"],
    "timesSold": 959,
    "saleprice": 137.72,
    "id": 147,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/louvel.jpg",
    "discount": 0,
    "stock": 11
  },
  {
    "name": "wxPython in Action",
    "isbn": "1932394621",
    "pages": 620,
    "year": 2006,
    "shortDescription": "\"The book is easy to read and provides an approach to a very practical contemporary topic. The authors have organized their material well.\" -- Melissa Strange, Walden University, www.reviews.com",
    "longDescription": "wxPython is an open source GUI toolkit for the Python programming language. It offers productivity gains and useful features for any programmer, and is quickly gaining in popularity as a result. The only published source for the wxPython toolkit, co-authored by the toolkit s developer Robin Dunn, wxPython in Action shows readers why wxPython is a better interface tool than Tkinter, the tool that is distributed with Python. Because they are often large and complex, GUI programming toolkits can be hard to use. wxPython is a combination of the Python programming language and the wxWidgets toolkit, which allows programmers to create programs with a robust, highly functional graphical user interface, simply and easily. wxPython combines the power of an exceptionally complete user interface toolkit with an exceptionally flexible programming language. The result is a toolkit that is unique in the ease with which complex applications can be built and maintained. wxPython in Action is a complete guide to the wxPython toolkit, containing a tutorial for getting started, a guide to best practices, and a reference to wxPython s extensive widget set. After an easy introduction to wxPython concepts and programming practices, the book takes an in-depth tour of when and how to use the bountiful collection of widgets offered by wxPython. All features are illustrated with useful code examples and reference tables are included for handy lookup of an object s properties, methods, and events. The book enables developers to learn wxPython quickly and remains a valuable resource for future work.",
    "status": "PUBLISH",
    "authors": ["Noel Rappin", "Robin Dunn"],
    "categories": ["Python", "Python", "BackEnd"],
    "timesSold": 955,
    "saleprice": 44.66,
    "id": 206,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/rappin.jpg",
    "discount": 0,
    "stock": 45
  },
  {
    "name": "GWT in Action",
    "isbn": "1933988231",
    "pages": 632,
    "year": 2007,
    "longDescription": "The Google Web Toolkit (GWT) is a new technology from Google that automatically translates Java into JavaScript, making Ajax applications easier to code and deploy. GWT in Action is a comprehensive tutorial for Java developers interested in building the next generation of rich, web-based applications. This book was written by Robert Hanson, creator of the popular GWT Widget Library, and Adam Tacy, a major contributor to the GWT Widget Library. The Web is experiencing a new growth with an emphasis on rich, web-based applications. These applications can be difficult to build because they rely on JavaScript, which lacks the sophisticated object-oriented structures and static typing of Java, they are tricky to debug, and they require you to manage numerous browser inconsistencies. In May of 2006 Google released the Google Web Toolkit. GWT enables developers to create Ajax applications in Java. With GWT, you can build your applications using a real object-oriented language and take advantage of Java tools like Eclipse that are already available. Instead of trying to bring tool support to Ajax, Google brought Ajax to a place where the tools already existed. GWT in Action shows you how to take advantage of these exciting new tools. This clearly-written book is packed with hands-on GWT examples. You ll absorb the GWT philosophy as you build your first working GWT application. The book begins by exploring the main features of GWT, including Compiling Java to JavaScript, the magic that really defines GWT Building client-side components Convenient JUnit integration and testing Interacting with JavaScript and existing JavaScript libraries Internationalization You ll also see how GWT compares to other toolkits. GWT in Action shows you how to set up your development environment, use and create widgets, communicate with the server, and much more. Readers will follow an example running throughout the book and quickly master the basics of GWT: widgets, panels, and event handling. The book covers the full development cycle, from setting up your development environment, to building the application, then deploying it to the web server. The entire core GWT library is discussed, with details and examples on how it can be extended. You ll cover: Testing, debugging, and deploying GWT Applications Communicating with GWT-RPC Examining client-side RPC architecture Alternative RPC tools: HTTPRequest, RequestBuilder, and FormPanel Achieving interoperability in GWT with JavaScript Object Notation (JSON) Making your GWT application flexible and supportable GWT helps you make the most of Ajax in your web applications and GWT in Action helps you get more out of GWT.",
    "status": "PUBLISH",
    "authors": ["Robert Hanson", "Adam Tacy"],
    "categories": [
      "Internet",
      "Java",
      "Javascript",
      "Javascript",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 929,
    "saleprice": 80.74,
    "id": 86,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hanson.jpg",
    "discount": 6,
    "stock": 16
  },
  {
    "name": "RSS and Atom in Action",
    "isbn": "1932394494",
    "pages": 400,
    "year": 2006,
    "longDescription": "RSS and Atom in Action is organized into two parts. The first part introduces the blog technologies of newsfeed formats and publishing protocols the building blocks. The second part shows how to put to those blocks together to assemble interesting and useful blog applications. In keeping with the principle behind Manning s In Action series, this book shows the reader, through numerous examples in Java and C#, how to parse Atom and RSS format newsfeeds, how to generate valid newsfeeds and serve them efficiently, and howto automate blogging via web services based on the new Atom protocol and the older MetaWeblog API. The book also shows how to develop a complete blog client library that readers can use in their own applications. The second half of the book is devoted to a dozen blog apps small but immediately useful example applications such as a community aggregator, a file distribution newsfeed, a blog cross-poster, an email-to-blog gateway, Ant tasks for blogging software builds, and more.",
    "status": "PUBLISH",
    "authors": ["Dave Johnson"],
    "categories": ["Internet", "Java", "BackEnd"],
    "timesSold": 928,
    "saleprice": 50.54,
    "id": 65,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/dmjohnson.jpg",
    "discount": 17,
    "stock": 0
  },
  {
    "name": "Laszlo in Action",
    "isbn": "1932394834",
    "pages": 552,
    "year": 2008,
    "longDescription": "Laszlo in Action is the first comprehensive guide to the Laszlo system and its language LZX. OpenLaszlo is an increasingly popular open-source platform for the development and delivery of rich internet applications across multiple platforms: Flash, DHTML, and J2ME. The dramatic emergence of Ajax over the past year was a first step in the transition from page-oriented HTML web applications towards more full-featured rich internet applications. OpenLaszlo provides another important step in this continuing evolutionary process through the increased productivity resulting from LZX's declarative approach. It provides developers with the tools to create web-based applications offering the usability and interactivity associated with desktop applications, and the low costs associated with web-based deployment. The cross-platform nature of Laszlo LZX applications allows source code with only minimum modifications to run natively on all popular web browsers, on all desktop operating systems, on the Flash platform, and other platforms in the future. Written to address the needs of a wide spectrum of developers, ranging from client-side HTML and JavaScript developers all the way to enterprise-class Java or Rails engineers, this book provides a very hands-on approach towards building applications that solve real-world problems across both the Flash and DHTML platforms. Starting with the fundamentals of Laszlo LZX, the authors quickly move towards applying this knowledge to the design and development of a full-scale application called the Laszlo Market. This provides a working context to assist understanding the underlying concepts of Laszlo LZX and, more importantly, how to apply this knowledge in innovative ways. The construction of the Laszlo Market proceeds over the course of the book illustrating topics starting with an initial wireframe and storyboard design to optimization issues dealing with the application's deployment across the Flash and DHTML platforms.",
    "status": "PUBLISH",
    "authors": ["Norman Klein", "Max Carlson with Glenn MacEwen"],
    "categories": [
      "Web Development",
      "Javascript",
      "Javascript",
      "HTML",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 924,
    "saleprice": 34.39,
    "id": 119,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/klein.jpg",
    "discount": 0,
    "stock": 49
  },
  {
    "name": "Spring in Action, Third Edition",
    "isbn": "1935182358",
    "pages": 424,
    "year": 2011,
    "shortDescription": "Spring in Action, Third Edition has been completely revised to reflect the latest features, tools, practices Spring offers to java developers. It begins by introducing the core concepts of Spring and then quickly launches into a hands-on exploration of the framework. Combining short code snippets and an ongoing example developed throughout the book, it shows you how to build simple and efficient J2EE applications.",
    "longDescription": "A few years back, Spring arrived as is a fresh breeze blowing over the Java landscape. Based on the principles of dependency injection, interface-oriented design, and aspect-oriented programming, Spring combines enterprise application power with the simplicity of plain-old Java objects (POJOs). Now, Spring has grown into a full suite of technologies, including dedicated projects for integration, OSGI-based development, and more. Spring in Action, Third Edition has been completely revised to reflect the latest features, tools, practices Spring offers to java developers. It begins by introducing the core concepts of Spring and then quickly launches into a hands-on exploration of the framework. Combining short code snippets and an ongoing example developed throughout the book, it shows you how to build simple and efficient J2EE applications. Inside, you'll see how to: Solve persistence problems Handle asynchronous messaging Create and consume remote services Build web applications Integrate with most popular web frameworks In short, you'll learn how to use Spring to write simpler, easier to maintain code so that you can focus on what really matters your critical business needs. The revised Third Edition explores the core Spring Framework issues, as well as the latest updates to other Spring portfolio projects such as Spring WebFlow and Spring Security. The result is a book that's both broader and deeper than previous editions. You'll learn the full range of new features available with Spring 3, including: More annotation-oriented options to reduce the amount of XML configuration Full-featured support for REST A new Spring Expression Language (SpEL) that makes short work of wiring complex values. Examples that illustrate the current best practices developed in the Spring community. This book assumes that you know your way around Java, but no previous experience with Spring is required.",
    "status": "PUBLISH",
    "authors": ["Craig Walls"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 914,
    "saleprice": 102.68,
    "id": 259,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/walls4.jpg",
    "discount": 0,
    "stock": 37
  },
  {
    "name": "PostGIS in Action",
    "isbn": "1935182269",
    "pages": 325,
    "year": 2011,
    "shortDescription": "PostGIS in Action is the first book devoted entirely to PostGIS. It will help both new and experienced users write spatial queries to solve real-world problems. For those with experience in more traditional relational databases, this book provides a background in vector-based GIS so you can quickly move to analyzing, viewing, and mapping data.",
    "longDescription": "Whether you're canvassing a congressional district, managing a sales region, mapping city bus schedules, or analyzing local cancer rates, thinking spatially opens up limitless possibilities for database users. PostGIS, a freely available open-source spatial database extender, can help you answer questions that you could not answer using a mere relational database. Its feature set equals or surpasses proprietary alternatives, allowing you to create location-aware queries and features with just a few lines of SQL code. PostGIS in Action is the first book devoted entirely to PostGIS. It will help both new and experienced users write spatial queries to solve real-world problems. For those with experience in more traditional relational databases, this book provides a background in vector-based GIS so you can quickly move to analyzing, viewing, and mapping data. Advanced users will learn how to optimize queries for maximum speed, simplify geometries for greater efficiency, and create custom functions suited specifically to their applications. It also discusses the new features available in PostgreSQL 8.4 and provides tutorials on using additional open source GIS tools in conjunction with PostGIS.",
    "status": "PUBLISH",
    "authors": ["Regina O. Obe", "Leo S. Hsu"],
    "categories": ["Internet", "SQL", "BackEnd", "Database"],
    "timesSold": 912,
    "saleprice": 157.47,
    "id": 177,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/obe.jpg",
    "discount": 0,
    "stock": 31
  },
  {
    "name": "Android in Action, Second Edition",
    "isbn": "1935182722",
    "pages": 592,
    "year": 2011,
    "shortDescription": "Android in Action, Second Edition is a comprehensive tutorial for Android developers. Taking you far beyond \"Hello Android,\" this fast-paced book puts you in the driver's seat as you learn important architectural concepts and implementation strategies. You'll master the SDK, build WebKit apps using HTML 5, and even learn to extend or replace Android's built-in features by building useful and intriguing examples. ",
    "longDescription": "When it comes to mobile apps, Android can do almost anything and with this book, so can you! Android runs on mobile devices ranging from smart phones to tablets to countless special-purpose gadgets. It's the broadest mobile platform available. Android in Action, Second Edition is a comprehensive tutorial for Android developers. Taking you far beyond \"Hello Android,\" this fast-paced book puts you in the driver's seat as you learn important architectural concepts and implementation strategies. You'll master the SDK, build WebKit apps using HTML 5, and even learn to extend or replace Android's built-in features by building useful and intriguing examples. ",
    "status": "PUBLISH",
    "authors": ["W. Frank Ableson", "Robi Sen"],
    "categories": ["Java", "HTML", "BackEnd", "FrontEnd"],
    "timesSold": 908,
    "saleprice": 149.92,
    "id": 1,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ableson2.jpg",
    "discount": 0,
    "stock": 10
  },
  {
    "name": "Python and Tkinter Programming",
    "isbn": "1884777813",
    "pages": 688,
    "year": 2000,
    "longDescription": "If you are interested in Python and Tkinter, you have probably noticed that although there is some good contributed documentation on the Web, there is not enough to get Tkinter applications up and running. Python and Tkinter Programming is the answer. It is designed for readers who are familiar with Python and who need to develop applications with Graphical User Interfaces (GUIs). Python and Tkinter Programming presents the elements of typical Python and Tkinter applications in a straight-forward fashion. Sample code illustrates each element. Complete applications that go far beyond the fill-the-form class of graphical user interfaces are presented; here you will find examples of complex controls, drawn interfaces and photorealistic panels. The code can readily be used as templates for new applications. Extensions to Python (such as ODBC) are examined as well. Complete source code for all examples, along with the latest releases of required software, will be available from Manning's web site. Tkinter is fully documented. To date, this level of documentation has not been available to Tkinter programmers, who have been required to read the code or interpret Tcl/Tk man pages to fully understand component usage. Python and Tkinter Programming will be useful in both Windows and Unix environments, and the example code is portable between the two environments.",
    "status": "PUBLISH",
    "authors": ["John E. Grayson"],
    "categories": ["Python", "Python", "BackEnd"],
    "timesSold": 901,
    "saleprice": 121.59,
    "id": 81,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/grayson.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "Flex on Java",
    "isbn": "1933988797",
    "pages": 265,
    "year": 2010,
    "shortDescription": " A beautifully written book that is a must have for every Java Developer. Ashish Kulkarni, Technical Director, E-Business Software Solutions Ltd.",
    "longDescription": "In the demo, a hip designer, a sharply-dressed marketer, and a smiling, relaxed developer sip lattes and calmly discuss how Flex is going to make customers happy and shorten the workday all while boosting the bottom line. The software systems they're using have been carefully selected and built from the ground up to work together seamlessly. There are no legacy systems, data, or competing business concerns to manage. Cut to reality. You're a Java developer. The marketing guy tells you that \"corporate\" wants a Flex-based site and you have to deliver it on top of what you already have. Your budget Don't even ask. \"Make it look like the Discovery channel or something.\" Flex on Java assumes you live in the real world not the demo. This unique book shows you how to refactor an existing web application using the server-side you already know. You'll learn to use Flex 3 in concert with Spring, EJB 3, POJOs, JMS, and other standard technologies. Wherever possible, the examples use free or open source software. The authors start with a typical Java web app and show you how to add a rich Flex interface. You also learn how to integrate Flex into your server-side Java via the BlazeDS framework, Adobe's open-source remoting and web messaging technology for Flex. The book shows you how to deploy to not only the web but also to the desktop using the Adobe Integrated Runtime (AIR). You will learn how to integrate Flex into your existing applications in order to build a next generation application that will delight users. Flex on Java is approachable for anyone beginning Java and Flex development. ",
    "status": "PUBLISH",
    "authors": ["Bernerd Allmon", "Jeremy Anderson"],
    "categories": ["Internet", "Java", "BackEnd"],
    "timesSold": 893,
    "saleprice": 37.56,
    "id": 7,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/allmon.jpg",
    "discount": 11,
    "stock": 31
  },
  {
    "name": "Making Java Groovy",
    "isbn": "1935182943",
    "pages": 300,
    "year": 2013,
    "shortDescription": "Making Java Groovy is a practical handbook for developers who want to blend Groovy into their day-to-day work with Java. It starts by introducing the key differences between Java and Groovy and how you can use them to your advantage. Then, it guides you step-by-step through realistic development challenges, from web applications to web services to desktop applications, and shows how Groovy makes them easier to put into production.",
    "longDescription": "Java is large and powerful, but that size and power carries with it complexity and accumulated inconsistencies. Groovy is an elegant JVM-based dynamic language that gracefully co-exists with Java. It both extends and simplifies Java and for most Java developers, Groovy is super easy to learn. If you know where to apply it, adding in a little Groovy will make you a better Java developer. Making Java Groovy is a practical handbook for developers who want to blend Groovy into their day-to-day work with Java. It starts by introducing the key differences between Java and Groovy and how you can use them to your advantage. Then, it guides you step-by-step through realistic development challenges, from web applications to web services to desktop applications, and shows how Groovy makes them easier to put into production. This book stays away from theory and drills down on the typical situations you face every day, like consuming and creating SOAP and RESTful web services, working with databases, and using the Spring framework. You'll also explore the great Groovy tools for build processes, testing, and deployment. Finally, you'll learn how Groovy-based domain specific languages simplify Java development.",
    "status": "PUBLISH",
    "authors": ["Kenneth A. Kousen"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 874,
    "saleprice": 68.64,
    "id": 125,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kousen.jpg",
    "discount": 11,
    "stock": 9
  },
  {
    "name": "OSGi in Action",
    "isbn": "1933988916",
    "pages": 576,
    "year": 2011,
    "shortDescription": "OSGi in Action is a comprehensive guide to OSGi with two primary goals. First, it provides a clear introduction to OSGi concepts with examples that are relevant both for architects and developers. The central idea of OSGi is modularity, so you start by learning about OSGi bundles. You'll then see how OSGi handles module lifecycles and follow up with how it promotes service-oriented interaction among application components.",
    "longDescription": "If you're a Java developer, you've almost certainly heard of OSGi and also heard that it's becoming quite a big deal. But you may still be wondering exactly \"What is OSGi \" Simply put, OSGi is a technology that allows you to create highly modular Java applications. It introduces a logical and physical module format, called a bundle, for explicitly structuring your application as a set of interconnected modules. OSGi lets you install, start, stop, update, or uninstall modules at execution time without taking down your entire system. In addition, OSGi defines a local service-oriented approach for creating applications out of loosely coupled components. With the prevalence of modern component and service-based architectures, OSGi is becoming increasingly important. It meshes well with such approaches and greatly simplifies their creation and management. It's the backbone of Eclipse's plugin system as well as many recent JavaEE containers, such as GlassFish v3, WebSphere v6.1, and WebLogic Event Server. Even the SpringSource Application Platform is built on top of it. OSGi in Action is a comprehensive guide to OSGi with two primary goals. First, it provides a clear introduction to OSGi concepts with examples that are relevant both for architects and developers. The central idea of OSGi is modularity, so you start by learning about OSGi bundles. You'll then see how OSGi handles module lifecycles and follow up with how it promotes service-oriented interaction among application components. With the core concepts well in hand, you'll explore numerous application scenarios and techniques. How much of OSGi do you actually need How do you embed OSGi inside other containers What are the best practices for migrating legacy systems to OSGi How can you embrace and make the most of system dynamism Expert authors Richard S. Hall, Karl Pauls, and Stuart McCulloch have years of experience both in building OSGi-based systems and in contributing to OSGi implementations such as Apache Felix.",
    "status": "PUBLISH",
    "authors": [
      "Richard S. Hall",
      "Karl Pauls",
      "Stuart McCulloch",
      "David Savage"
    ],
    "categories": ["Internet", "Java", "BackEnd"],
    "timesSold": 862,
    "saleprice": 24.9,
    "id": 85,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hall.jpg",
    "discount": 0,
    "stock": 47
  },
  {
    "name": "SQL Server MVP Deep Dives, Volume 2",
    "isbn": "1617290475",
    "pages": 750,
    "year": 2011,
    "status": "PUBLISH",
    "authors": [
      "Kalen Delaney",
      "Louis Davidson",
      "Greg Low",
      "Brad McGehee",
      "Paul Nielsen",
      "Paul Randal",
      "Kimberly Tripp"
    ],
    "categories": ["SQL", "BackEnd", "Database"],
    "timesSold": 838,
    "saleprice": 153.33,
    "id": 285,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/delaney.jpg",
    "discount": 0,
    "stock": 38,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Learn Git in a Month of Lunches",
    "isbn": "1617292419",
    "pages": 300,
    "status": "MEAP",
    "authors": ["Rick Umali"],
    "categories": ["Git"],
    "timesSold": 831,
    "saleprice": 204.5,
    "id": 392,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/umali.jpg",
    "year": 1980,
    "discount": 0,
    "stock": 0,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Java Servlets by Example",
    "isbn": "188477766X",
    "pages": 550,
    "year": 2002,
    "longDescription": "Although CGI scripts provide 80% of today's server side processing, they are slow, inefficient, and memory-hungry. A new species is evolving to take their place, one which is lean, fast, portable, and easy to maintain: Java servlets. Servlets are not merely an alternative to CGI, for they can do much more. Servlets have opened the door to a world of client/server applications that would have been too difficult or too time-consuming to consider before. Java Servlets: By Example takes the reader into the world of servlets, moving example by example from the simple to the complex. An early chapter explains the simple HTML form processing through servlets. A later chapter shows how to connect a Java applet to a servlet, which is itself connected to a database. Java Servlets: By Example is full of real-world, ready-to-run example code. Each chapter deals with a new problem and takes the reader through a series of servlet-based solutions. However, the book is detailed enough that it may also serve as a reference for the developer.",
    "status": "PUBLISH",
    "authors": ["Alan R. Williamson"],
    "categories": ["Java", "Internet", "HTML", "Java", "BackEnd", "FrontEnd"],
    "timesSold": 824,
    "saleprice": 203.03,
    "id": 265,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/williamson.jpg",
    "discount": 0,
    "stock": 6
  },
  {
    "name": "Reactive Design Patterns",
    "isbn": "1617291803",
    "pages": 300,
    "status": "MEAP",
    "authors": ["Roland Kuhn", "Jamie Allen"],
    "categories": ["REACT", "FrontEnd"],
    "timesSold": 820,
    "saleprice": 27.46,
    "id": 367,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kuhn.jpg",
    "year": 1954,
    "discount": 0,
    "stock": 27,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Unlocking Android",
    "isbn": "1933988673",
    "pages": 416,
    "year": 2009,
    "shortDescription": "Unlocking Android: A Developer's Guide provides concise, hands-on instruction for the Android operating system and development tools. This book teaches important architectural concepts in a straightforward writing style and builds on this with practical and useful examples throughout.",
    "longDescription": "Android is an open source mobile phone platform based on the Linux operating system and developed by the Open Handset Alliance, a consortium of over 30 hardware, software and telecom companies that focus on open standards for mobile devices. Led by search giant, Google, Android is designed to deliver a better and more open and cost effective mobile experience. Unlocking Android: A Developer's Guide provides concise, hands-on instruction for the Android operating system and development tools. This book teaches important architectural concepts in a straightforward writing style and builds on this with practical and useful examples throughout. Based on his mobile development experience and his deep knowledge of the arcane Android technical documentation, the author conveys the know-how you need to develop practical applications that build upon or replace any of Androids features, however small. Unlocking Android: A Developer's Guide prepares the reader to embrace the platform in easy-to-understand language and builds on this foundation with re-usable Java code examples. It is ideal for corporate and hobbyists alike who have an interest, or a mandate, to deliver software functionality for cell phones. WHAT'S INSIDE: * Android's place in the market * Using the Eclipse environment for Android development * The Intents - how and why they are used * Application classes: o Activity o Service o IntentReceiver * User interface design * Using the ContentProvider to manage data * Persisting data with the SQLite database * Networking examples * Telephony applications * Notification methods * OpenGL, animation & multimedia * Sample Applications ",
    "status": "PUBLISH",
    "authors": ["W. Frank Ableson", "Charlie Collins", "Robi Sen"],
    "categories": [
      "Open Source",
      "Mobile",
      "SQL",
      "Java",
      "BackEnd",
      "Database"
    ],
    "timesSold": 818,
    "saleprice": 104.15,
    "id": 0,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ableson.jpg",
    "discount": 0,
    "stock": 48
  },
  {
    "name": "Making Sense of Java",
    "isbn": "132632942",
    "pages": 180,
    "year": 1996,
    "shortDescription": "Making Sense of Java clearly and concisely explains the concepts, features, benefits, potential, and limitations of Java.",
    "longDescription": "The meteoric rise of interest in Java, and the simultaneous rise in Java-related hype, make this book's no-nonsense evaluation essential reading for all levels of professionals, from managers to programmers. Making Sense of Java clearly and concisely explains the concepts, features, benefits, potential, and limitations of Java. It is not a programmer's how-to guide and assumes little technical knowledge, though software developers will find this lucid overview to be a valuable introduction to the possible uses and capabilities of Java.",
    "status": "PUBLISH",
    "authors": [
      "Bruce Simpson",
      "John Mitchell",
      "Brian Christeson",
      "Rehan Zaidi",
      "Jonathan Levine"
    ],
    "categories": ["Java", "Business", "Java", "BackEnd"],
    "timesSold": 807,
    "saleprice": 133.52,
    "id": 233,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/simpson.jpg",
    "discount": 0,
    "stock": 18
  },
  {
    "name": "JavaScript Application Design",
    "isbn": "1617291951",
    "pages": 300,
    "status": "MEAP",
    "authors": ["Nicolas G. Bevacqua"],
    "categories": ["Javascript", "Javascript", "Java", "BackEnd", "FrontEnd"],
    "timesSold": 800,
    "saleprice": 28.54,
    "id": 372,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bevacqua.jpg",
    "year": 2021,
    "discount": 0,
    "stock": 0,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Git in Practice",
    "isbn": "1617291978",
    "pages": 300,
    "status": "MEAP",
    "authors": ["Mike McQuaid"],
    "categories": ["Git"],
    "timesSold": 798,
    "saleprice": 117.67,
    "id": 373,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mcquaid.jpg",
    "year": 1970,
    "discount": 13,
    "stock": 3,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Ajax in Action",
    "isbn": "1932394613",
    "pages": 680,
    "year": 2005,
    "longDescription": "Web users are getting tired of the traditional web experience. They get frustrated losing their scroll position; they get annoyed waiting for refresh; they struggle to reorient themselves on every new page. And the list goes on. With asynchronous JavaScript and XML, known as \"Ajax,\" you can give them a better experience. Once users have experienced an Ajax interface, they hate to go back. Ajax is new way of thinking that can result in a flowing and intuitive interaction with the user.\n<br>\n<i>Ajax in Action</i> helps you implement that thinking--it explains how to distribute the application between the client and the server (hint: use a \"nested MVC\" design) while retaining the integrity of the system. You will learn how to ensure your app is flexible and maintainable, and how good, structured design can help avoid problems like browser incompatibilities. Along the way it helps you unlearn many old coding habits. Above all, it opens your mind to the many advantages gained by placing much of the processing in the browser. If you are a web developer who has prior experience with web technologies, this book is for you.",
    "status": "PUBLISH",
    "authors": ["Dave Crane", "Eric Pascarello with Darren James"],
    "categories": [
      "XML",
      "Internet",
      "Javascript",
      "Javascript",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 782,
    "saleprice": 44.9,
    "id": 50,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/crane.jpg",
    "discount": 7,
    "stock": 31
  },
  {
    "name": "Microsoft Reporting Services in Action",
    "isbn": "1932394222",
    "pages": 656,
    "year": 2004,
    "longDescription": "Business reporting is a lifeline of business, so a better reporting environment is a big deal. With a sophisticated, modern tool like Microsoft SQL Server 2000 Reporting Services, you can report-enable any type of application, regardless of its targeted platform or development language. Written for information workers, system administrators, and developers, this book is a detailed and practical guide to the functionality provided by Reporting Services. It systematically shows off many powerful RS features by leading you through a dizzying variety of possible uses. Following a typical report lifecycle, the book shows you how to create, manage, and deliver RS reports. In the first half, you will master the skills you need to create reports. System administrators will learn the ropes of managing and securing the report environment. The second half of the book teaches developers the techniques they need to integrate RS with their WinForm or web-based applications. It does this with the help of a wide variety of real-world scenarios which will give you ideas on how to use RS in addition to teaching you the ropes. An experienced software designer and developer, Teo Lachev works as a technology consultant with the Enterprise Application Services practice of Hewlett-Packard. He is a Microsoft Certified Solution Developer and a Microsoft Certified Trainer. Teo lives in Atlanta, GA.",
    "status": "PUBLISH",
    "authors": ["Teo Lachev"],
    "categories": ["Microsoft .NET", "SQL", "BackEnd", "Database"],
    "timesSold": 782,
    "saleprice": 80.64,
    "id": 129,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lachev.jpg",
    "discount": 9,
    "stock": 29
  },
  {
    "name": "GWT in Practice",
    "isbn": "1933988290",
    "pages": 376,
    "year": 2008,
    "longDescription": "If you re a web developer, you already know that you can use Ajax to add rich, user-friendly, dynamic features to your applications. With the Google Web Toolkit (GWT), a new Ajax tool from Google that automatically converts Java to JavaScript, you can build Ajax applications using the Java language. GWT lets you focus on application design and functionality, rather than on browser differences, and allows you to re-use code throughout the layers of your applications. GWT in Practice is an example-driven, code-rich book designed for web developers who have already learned the basics of GWT. After a quick review of GWT fundamentals, GWT in Practice presents scores of handy, reusable solutions to the problems you face when you need to move beyond Hello World and proof of concept applications. This book skips the theory and looks at the way things really work when you re building projects in GWT. You ll learn How to create and customize widgets The ins and outs of RPC Packaging and building with Maven and Ant Using the Java Persistence API with GWT Effective internationalization GWT in Practice shows you where GWT fits into the Enterprise Java developer's toolset. Written by expert authors Robert Cooper and Charlie Collins, this book combines sharp insight with hard-won experience. Readers will find thorough coverage of all aspects of GWT development from the basic GWT concepts and essentials to in-depth and complete real world example applications. If you know the basics and are ready to get your hands dirty, then you need this book.",
    "status": "PUBLISH",
    "authors": ["Robert Cooper", "Charles Collins"],
    "categories": [
      "Web Development",
      "Javascript",
      "Javascript",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 778,
    "saleprice": 200.98,
    "id": 49,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/cooper.jpg",
    "discount": 0,
    "stock": 2
  },
  {
    "name": "Hello! Python",
    "isbn": "1935182080",
    "pages": 350,
    "year": 2012,
    "shortDescription": "Hello! Python fully covers the building blocks of Python programming and gives you a gentle introduction to more advanced topics such as object oriented programming, functional programming, network programming, and program design. New (or nearly new) programmers will learn most of what they need to know to start using Python immediately.",
    "longDescription": "Learn Python the fast and fun way! Hello! Python is a fully-illustrated, project-driven tutorial designed to get you up and running with Python, no experience required. It's full of projects that help you learn the way most programmers do one step at a time, starting with the basics, and then applying your new skills in useful programs. Hello! Python fully covers the building blocks of Python programming and gives you a gentle introduction to more advanced topics such as object oriented programming, functional programming, network programming, and program design. New (or nearly new) programmers will learn most of what they need to know to start using Python immediately. The book presents several practical projects, including games, business, and graphical applications. Each example provides a solid base for you to develop your own programs. As you dig into Python, you'll see how programs are created, and the reasons behind the technical decisions. The book covers Python's large standard library gradually and in the context of sample apps, so the reader isn't overwhelmed with a large number of library functions to absorb all at once. Upon completing the book, the reader will have a good grasp of Python, know several technologies and libraries related to Python and be able to identify many resources for future growth as a programmer.",
    "status": "PUBLISH",
    "authors": ["Anthony Briggs"],
    "categories": ["Python", "Python", "BackEnd"],
    "timesSold": 762,
    "saleprice": 129.42,
    "id": 34,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/briggs.jpg",
    "discount": 14,
    "stock": 23
  },
  {
    "name": "ActiveMQ in Action",
    "isbn": "1933988940",
    "pages": 408,
    "year": 2011,
    "shortDescription": "ActiveMQ is implemented in Java, but it supports client applications written in many other programming languages including C/C++, .NET, Ruby, Perl, PHP, Python, and more. It can be integrated with other open source frameworks including Tomcat, ServiceMix, JBoss, and can easily bridge to other JMS providers. ",
    "longDescription": "Modern distributed architectures require a secure, reliable way to exchange messages in asynchronous, loosely-coupled systems. For Java developers, the Java Message Service (JMS) provides that core functionality. The Apache ActiveMQ message broker is a complete open source implementation of the JMS specification. The ActiveMQ Message-Oriented Middleware, coupled with its Enterprise Integration Provider are the building blocks of an Enterprise Service Bus the backbone of a contemporary Service Oriented Architecture. ActiveMQ is implemented in Java, but it supports client applications written in many other programming languages including C/C++, .NET, Ruby, Perl, PHP, Python, and more. It can be integrated with other open source frameworks including Tomcat, ServiceMix, JBoss, and can easily bridge to other JMS providers. Apache ActiveMQ in Action is a thorough, practical guide to implementing message-oriented systems in Java using ActiveMQ. The book lays out the core of ActiveMQ in clear language, starting with the anatomy of a JMS message and moving quickly through connectors, message persistence, authentication and authorization. With the basics well in hand, you move into interesting examples of ActiveMQ at work, following a running Stock Portfolio application. You'll integrate ActiveMQ with containers like Geronimo and JBoss and learn to tie into popular Java-based technologies like Spring Framework. Along the way, you'll pick up best practices forged out of the deep experience the authors bring to the book. You'll learn to integrate with non-Java technologies and explore advanced topics like broker topologies and configuration and performance tuning. Additionally, the book will introduce readers to using Apache Camel with Apache ActiveMQ as a way to easily utilize the Enterprise Integration Patterns.",
    "status": "PUBLISH",
    "authors": ["Bruce Snyder", "Dejan Bosanac", "Rob Davies"],
    "categories": ["Java", "Python", "Java", "BackEnd"],
    "timesSold": 759,
    "saleprice": 112.83,
    "id": 239,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/snyder.jpg",
    "discount": 0,
    "stock": 5
  },
  {
    "name": "Sass and Compass in Action",
    "isbn": "1617290149",
    "pages": 300,
    "year": 2013,
    "shortDescription": "Sass and Compass in Action is the definitive guide to stylesheet authoring using these two revolutionary tools. Written for both designers and developers, this book demonstrates the power of both Sass and Compass through a series of examples that address common pain points associated with traditional stylesheet authoring. The book begins with simple topics such as CSS resets and moves on to more involved topics such as grid frameworks and CSS3 vendor implementation differences.",
    "longDescription": "Cascading Style Sheets paint the web as the user sees it, and for fifteen years, we've been painting the web by hand. Sass and Compass extend standard CSS to give you more flexibility and the option to simplify or automate many tedious tasks. Think of Sass and Compass as power tools that allow stylesheet authors to \"paint\" with remarkable speed and precision. Sass is an extension of CSS3, adding language features for creating well-formatted, standard CSS using the command line tool or a web-framework plugin. Compass is a framework that sits atop Sass and tackles common stylesheet problems such as grid layouts, handling CSS3 vendor differences, and production environment stylesheet optimization. Together, they do for CSS what jQuery has done for JavaScript: solve real world problems, letting designers and developers create stylesheets more efficiently. Sass and Compass in Action is the definitive guide to stylesheet authoring using these two revolutionary tools. Written for both designers and developers, this book demonstrates the power of both Sass and Compass through a series of examples that address common pain points associated with traditional stylesheet authoring. The book begins with simple topics such as CSS resets and moves on to more involved topics such as grid frameworks and CSS3 vendor implementation differences. Authors Wynn Netherland, Nathan Weizenbaum, and Chris Eppstein cover prominent community plugins that allows stylesheet authors to share styles as developers of other programming languages such as Ruby, Python, Java, and, .NET do. The book also presents Sass and Compass case studies using hot technologies like Sencha Touch. The book culminates in a step-by-step look at building a personal stylesheet framework in which readers can bundle their own approaches and opinions and reuse them across projects.",
    "status": "PUBLISH",
    "authors": [
      "Wynn Netherland",
      "Nathan Weizenbaum",
      "Chris Eppstein",
      "Brandon Mathis"
    ],
    "categories": [
      "Web Development",
      "Javascript",
      "Javascript",
      "Python",
      "CSS",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 749,
    "saleprice": 45.61,
    "id": 170,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/netherland.jpg",
    "discount": 18,
    "stock": 0
  },
  {
    "name": "Hadoop in Action",
    "isbn": "1935182196",
    "pages": 325,
    "year": 2010,
    "shortDescription": "Hadoop in Action teaches readers how to use Hadoop and write MapReduce programs. The intended readers are programmers, architects, and project managers who have to process large amounts of data offline. Hadoop in Action will lead the reader from obtaining a copy of Hadoop to setting it up in a cluster and writing data analytic programs.",
    "longDescription": "Hadoop is an open source framework implementing the MapReduce algorithm behind Google's approach to querying the distributed data sets that constitute the internet. This definition naturally leads to an obvious question, \"What are \"maps\" and why do they need to be \"reduced \" Massive data sets can be extremely difficult to analyze and query using traditional mechanisms, especially when the queries themselves are quite complicated. In effect, the MapReduce algorithm breaks up both the query and the data set into constituent parts that's the \"mapping.\" The mapped components of the query can be processed simultaneously or \"reduced\" to rapidly return results. Hadoop in Action teaches readers how to use Hadoop and write MapReduce programs. The intended readers are programmers, architects, and project managers who have to process large amounts of data offline. Hadoop in Action will lead the reader from obtaining a copy of Hadoop to setting it up in a cluster and writing data analytic programs. The book begins by making the basic idea of Hadoop and MapReduce easier to grasp by applying the default Hadoop installation to a few easy-to-follow tasks, such as analyzing changes in word frequency across a body of documents. The book continues through the basic concepts of MapReduce applications developed using Hadoop, including a close look at framework components, use of Hadoop for a variety of data analysis tasks, and numerous examples of Hadoop in action. Hadoop in Action will explain how to use Hadoop and present design patterns and practices of programming MapReduce. MapReduce is a complex idea both conceptually and in its implementation, and Hadoop users are challenged to learn all the knobs and levers for running Hadoop. This book takes you beyond the mechanics of running Hadoop, teaching you to write meaningful programs in a MapReduce framework. This book assumes the reader will have a basic familiarity with Java, as most code examples will be written in Java. Familiarity with basic statistical concepts (e.g. histogram, correlation) will help the reader appreciate the more advanced data processing examples.",
    "status": "PUBLISH",
    "authors": ["Chuck Lam"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 744,
    "saleprice": 36.91,
    "id": 132,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lam.jpg",
    "discount": 0,
    "stock": 6
  },
  {
    "name": "Wicket in Action",
    "isbn": "1932394982",
    "pages": 392,
    "year": 2008,
    "longDescription": "Wicket bridges the mismatch between the web's stateless protocol and Java's OO model. The component-based Wicket framework shields you from the HTTP under a web app so you can concentrate on business problems instead of the plumbing code. In Wicket, you use logic-free HTML templates for layout and standard Java for an application's behavior. The result Coding a web app with Wicket feels more like regular Java programming. Wicket in Action is a comprehensive guide for Java developers building Wicket-based web applications. It introduces Wicket's structure and components, and moves quickly into examples of Wicket at work. Written by core committers, this book shows you the \"how-to\" and the \"why\" of Wicket. You'll learn to use and customize Wicket components, to interact with Spring and Hibernate, and to implement rich Ajax-driven features.",
    "status": "PUBLISH",
    "authors": ["Martijn Dashorst", "Eelco Hillenius"],
    "categories": ["Web Development", "HTML", "Java", "BackEnd", "FrontEnd"],
    "timesSold": 742,
    "saleprice": 43.36,
    "id": 57,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/dashorst.jpg",
    "discount": 0,
    "stock": 12
  },
  {
    "name": "AngularJS in Action",
    "isbn": "1617291331",
    "pages": 300,
    "status": "MEAP",
    "authors": ["Brian Ford", "Lukas Ruebbelke"],
    "categories": ["ANGULAR", "FrontEnd"],
    "timesSold": 741,
    "saleprice": 98.31,
    "id": 338,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bford.jpg",
    "year": 1975,
    "discount": 0,
    "stock": 30,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "The Well-Grounded Rubyist",
    "isbn": "1933988657",
    "pages": 520,
    "year": 2009,
    "shortDescription": "What would appear to be the most complex topic of the book is in fact surprisingly easy to assimilate, and one realizes that the efforts of the author to gradually lead us to a sufficient knowledge of Ruby in order to tackle without pain the most difficult subjects, bears its fruit. Eric Grimois, Developpez.com",
    "longDescription": "Interest in Ruby has exploded. Developers discovering this elegant, dynamic language quickly learn that Ruby is a powerful alternative to traditional static languages like Java or C++. It runs in most operating environments and can handle virtually any programming task you throw at it. Ruby code is clean and elegant. Best of all, Ruby is dynamic, which means that it's designed to react at runtime to changes in an application's environment or requirements. The Well-Grounded Rubyist takes you from interested novice to proficient practitioner. It's a beautifully written tutorial that begins with the basic steps to get your first Ruby program up and running and goes on to explore sophisticated topics like callable objects, reflection, and threading The book concentrates on the language, preparing you for any way you may choose to use Ruby. Whether the topic is simple or tough, the book's easy-to-follow examples and explanations give you immediate confidence as you build your Ruby programming skills. The Well-Grounded Rubyist is a thoroughly revised and updated edition of the best-selling Ruby for Rails. In this new book, expert author David A. Black moves beyond Rails and presents a broader view of Ruby. It covers Ruby 1.9, and keeps the same sharp focus and clear writing that made Ruby for Rails stand out. It's no wonder one reader commented: \"The technical depth is just right to not distract beginners, yet detailed enough for more advanced readers.\"",
    "status": "PUBLISH",
    "authors": ["David A. Black"],
    "categories": ["Programming", "REACT", "Java", "BackEnd", "FrontEnd"],
    "timesSold": 736,
    "saleprice": 75.46,
    "id": 31,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/black2.jpg",
    "discount": 0,
    "stock": 23
  },
  {
    "name": "Seam in Action",
    "isbn": "1933988401",
    "pages": 624,
    "year": 2008,
    "shortDescription": "Seam in Action goes into great detail on the ways in which Seam helps reduce the burden of integration with different technologies such as Hibernate and JSF, allowing the developer to focus on the core business objective at hand. Shobana Jayaraman, Digital Infrastructure Analyst, University of Texas Southwestern Medical Center Library, The Tech Static",
    "longDescription": "Seam is an exciting new application framework based on the Java EE platform that you can use to build rich, web-based business applications. Seam is rapidly capturing the interest of Java enterprise developers because of its focus on simplicity, ease of use, transparent integration, scalability, and developer choice. Seam in Action offers a practical and in-depth look at Seam from outside the walls of RedHat/JBoss. The book puts Seam head-to-head with the complexities in the Java EE architecture. It discusses the shortcomings of JSF, the challenges of using Java persistence in the web environment, and other common development roadblocks, then shows how Seam makes these problems just melt away. In covering Seam, the author doesn't just ask you to sprinkle annotations on your code and expect that you understand how it works. Instead, the author lays down the facts, shows you the steps, reveals the logic, and diagrams the flow, so that by the end of the book, you will not only have gained a deep understanding of Seam, but will also come away ready to teach the material to others. All too often, developers spend a majority of their time integrating disparate technologies, manually tracking state, struggling to understand JSF, wrestling with Hibernate exceptions, and constantly redeploying applications, rather than on the logic pertaining to the business at hand. Seam in Action dives deep into thorough explanations of how Seam eliminates these non-core tasks by leveraging configuration by exception, Java 5 annotations, and aspect-oriented programming. To start off, you will see a working Java EE-compliant application come together by the end of the second chapter. As you progress through the book, you will discover how Seam eliminates unnecessary layers and configurations and uses an inversion of control technical known as bijection supplemented by a liberal use of the Unified Expression Language (EL) to establish the missing link between JSF, EJB 3 and JavaBean components. You also witness how Seam opens doors for you to incorporate technologies you previously have not had time to learn, such as business processes and stateful page flows (jBPM), rule-based security, Ajax remoting, PDF generation, Spring integration, and more.",
    "status": "PUBLISH",
    "authors": ["Dan Allen"],
    "categories": ["Java", "Java", "Git", "BackEnd"],
    "timesSold": 736,
    "saleprice": 162.89,
    "id": 56,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/dallen.jpg",
    "discount": 0,
    "stock": 17
  },
  {
    "name": "Mule in Action",
    "isbn": "1933988967",
    "pages": 432,
    "year": 2009,
    "longDescription": "Mule is a widely used open source enterprise service bus. It is standards based, provides easy integration with Spring and JBoss, and fully supports the enterprise messaging patterns collected by Hohpe and Woolf. You can readily customize Mule without writing a lot of new code. Mule in Action covers Mule fundamentals and best practices. It is a comprehensive tutorial that starts with a quick ESB overview and then gets Mule to work. It dives into core concepts like sending, receiving, routing, and transforming data. Next, it gives you a close look at Mule's standard components and how to roll out custom ones. You'll pick up techniques for testing, performance tuning, BPM orchestration, and even a touch of Groovy scripting. Written for developers, architects, and IT managers, the book requires familiarity with Java but no previous exposure to Mule or other ESBs.",
    "status": "PUBLISH",
    "authors": ["David Dossot", "John D'Emic"],
    "categories": ["Java", "Software Engineering", "Java", "BackEnd"],
    "timesSold": 733,
    "saleprice": 134.26,
    "id": 67,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/dossot.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "Machine Learning in Action",
    "isbn": "1617290181",
    "pages": 300,
    "year": 2012,
    "shortDescription": "Machine Learning in Action is a unique book that blends the foundational theories of machine learning with the practical realities of building tools for everyday data analysis. In it, you'll use the flexible Python programming language to build programs that implement algorithms for data classification, forecasting, recommendations, and higher-level features like summarization and simplification.",
    "longDescription": "It's been said that data is the new \"dirt\" the raw material from which and on which you build the structures of the modern world. And like dirt, data can seem like a limitless, undifferentiated mass. The ability to take raw data, access it, filter it, process it, visualize it, understand it, and communicate it to others is possibly the most essential business problem for the coming decades. \"Machine learning,\" the process of automating tasks once considered the domain of highly-trained analysts and mathematicians, is the key to efficiently extracting useful information from this sea of raw data. By implementing the core algorithms of statistical data processing, data analysis, and data visualization as reusable computer code, you can scale your capacity for data analysis well beyond the capabilities of individual knowledge workers. Machine Learning in Action is a unique book that blends the foundational theories of machine learning with the practical realities of building tools for everyday data analysis. In it, you'll use the flexible Python programming language to build programs that implement algorithms for data classification, forecasting, recommendations, and higher-level features like summarization and simplification. As you work through the numerous examples, you'll explore key topics like classification, numeric prediction, and clustering. Along the way, you'll be introduced to important established algorithms, such as Apriori, through which you identify association patterns in large datasets and Adaboost, a meta-algorithm that can increase the efficiency of many machine learning tasks.",
    "status": "PUBLISH",
    "authors": ["Peter Harrington"],
    "categories": ["Software Engineering", "Python", "BackEnd"],
    "timesSold": 726,
    "saleprice": 104.08,
    "id": 199,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/pharrington.jpg",
    "discount": 10,
    "stock": 0
  },
  {
    "name": "Zend Framework in Action",
    "isbn": "1933988320",
    "pages": 432,
    "year": 2008,
    "shortDescription": "Zend Framework in Action is a comprehensive tutorial that shows how to use the Zend Framework to create web-based applications and web services. This book takes you on an over-the-shoulder tour of the components of the Zend Framework as you build a high quality, real-world web application.",
    "longDescription": "From rather humble beginnings as the Personal Home Page scripting language, PHP has found its way into almost every server, corporation, and dev shop in the world. On an average day, somewhere between 500,000 and 2 million coders do something in PHP. Even when you use a well-understood language like PHP, building a modern web application requires tools that decrease development time and cost while improving code quality. Frameworks such as Ruby-on-Rails and Django have been getting a lot of attention as a result. For PHP coders, the Zend Framework offers that same promise without the need to move away from PHP. This powerful collection of components can be used in part or as a whole to speed up the development process. Zend Framework has the backing of Zend Technologies; the driving force behind the PHP programming language in which it is written. The first production release of the Zend Framework became available in July of 2007. Zend Framework in Action is a comprehensive tutorial that shows how to use the Zend Framework to create web-based applications and web services. This book takes you on an over-the-shoulder tour of the components of the Zend Framework as you build a high quality, real-world web application. This book is organized around the techniques you'll use every day as a web developer \"data handling, forms, authentication, and so forth. As you follow the running example, you'll learn to build interactive Ajax-driven features into your application without sacrificing nuts-and-bolts considerations like security and performance. This book is aimed at the competent PHP developer who wants to master framework-driven web development. Zend Framework in Action goes beyond the docs but still provides quick access to the most common topics encountered in the development of web applications. ",
    "status": "PUBLISH",
    "authors": ["Rob Allen", "Nick Lo", "Steven Brown"],
    "categories": ["Web Development", "Django", "BackEnd"],
    "timesSold": 720,
    "saleprice": 7.52,
    "id": 6,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/allen.jpg",
    "discount": 14,
    "stock": 44
  },
  {
    "name": "AspectJ in Action, Second Edition",
    "isbn": "1933988053",
    "pages": 568,
    "year": 2009,
    "shortDescription": "AspectJ in Action, Second Edition is a fully updated, major revision of Ramnivas Laddad's best-selling first edition. It's a hands-on guide for Java developers. After introducing the core principles of AOP, it shows you how to create reusable solutions using AspectJ 6 and Spring 3. You'll master key features including annotation-based syntax, load-time weaver, annotation-based crosscutting, and Spring-AspectJ integration. Building on familiar technologies such as JDBC, Hibernate, JPA, Spring Security, Spring MVC, and Swing, you'll apply AOP to common problems encountered in enterprise applications.",
    "longDescription": "To allow the creation of truly modular software, OOP has evolved into aspect-oriented programming. AspectJ is a mature AOP implementation for Java, now integrated with Spring. AspectJ in Action, Second Edition is a fully updated, major revision of Ramnivas Laddad's best-selling first edition. It's a hands-on guide for Java developers. After introducing the core principles of AOP, it shows you how to create reusable solutions using AspectJ 6 and Spring 3. You'll master key features including annotation-based syntax, load-time weaver, annotation-based crosscutting, and Spring-AspectJ integration. Building on familiar technologies such as JDBC, Hibernate, JPA, Spring Security, Spring MVC, and Swing, you'll apply AOP to common problems encountered in enterprise applications. This book requires no previous experience in AOP and AspectJ, but it assumes you're familiar with OOP, Java, and the basics of Spring. WHAT'S INSIDE: * Totally revised Second Edition * When and how to apply AOP * Master patterns and best practices * Code you can reuse in real-world applications ",
    "status": "PUBLISH",
    "authors": ["Ramnivas Laddad"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 715,
    "saleprice": 126.47,
    "id": 131,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/laddad2.jpg",
    "discount": 0,
    "stock": 2
  },
  {
    "name": "Silverlight 2 in Action",
    "isbn": "1933988428",
    "pages": 400,
    "year": 2008,
    "shortDescription": " Silverlight 2 in Action gives you a solid, well-thought out and coherent foundation for building RIA web applications, and provides you with lots of technical details without ever becoming cloudy. Golo Roden, author, trainer and speaker for .NET technologies",
    "longDescription": "Microsoft describes Silverlight as a \"cross-browser, cross-platform plug-in for delivering the next generation of .NET based media experiences and rich interactive applications for the Web.\" That's a really boring description for a really exciting new technology. Anyone who has looked at the demos and gotten a taste of what Silverlight can do knows that Silverlight represents an entirely new level of rich web interface technology for Microsoft developers. With Silverlight 2, developers can use JavaScript, VB, C#, Python, and Ruby to build user-friendly, interactive, and visually-dazzling web applications that work in most major browsers. Silverlight 2 in Action is the first book to cover Silverlight 2, a far more robust implementation of Silverlight than the current 1 release that supports only JavaScript. The much-anticipated 2 release adds powerful new features along with the ability to code in multiple languages and integrate your work with Visual Studio and the new Expression suite of tools. This book delivers real-world examples and in-depth walkthroughs to help you confidently enhance your web applications using Silverlight 2. Silverlight 2 in Action devotes extensive coverage to flexible layout components, the extensible control model, the communication framework, and the data-binding features all cornerstones of software development. Author and Microsoft MVP Chad Campbell also describes rich media and vivid graphical and animation features. The final chapters include a variety of Silverlight deployment scenarios. In addition to the fundamentals of Silverlight, you'll be introduced to architectural components such as the Silverlight object model. The book addresses the developer/designer collaboration model Silverlight enables, showing the developer how to include the designer effectively in the project workflow. This model is illustrated throughout the examples. For ongoing reader support, the author will maintain a dedicated book-support website providing up-to-the-minute working examples, complete with source code, all in Silverlight.",
    "status": "PUBLISH",
    "authors": ["Chad A. Campbell", "John Stockton"],
    "categories": [
      "Microsoft .NET",
      "Javascript",
      "Javascript",
      "Python",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 711,
    "saleprice": 103.04,
    "id": 40,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/campbell.jpg",
    "discount": 0,
    "stock": 45
  },
  {
    "name": "Tuscany SCA in Action",
    "isbn": "1933988894",
    "pages": 472,
    "year": 2011,
    "shortDescription": "Tuscany in Action is a comprehensive, hands-on guide for developing technology agnostic, extensible applications using Apache Tuscany's lightweight SCA infrastructure. The book uses practical examples based on a travel booking scenario to demonstrate how to develop applications with Tuscany SCA. Apache Tuscany supports a variety of programming environments, data bindings and communication protocols \"out of the box\" and can be easily extended to support other technologies.",
    "longDescription": "If you are developing IT applications or providing a development platform for others to use, you are aware of the various technology choices available to you. With variety comes the complexity of technology integration as well as the cost associated with developing and sustaining the solution over time. What if the development cost and complexity were reduced without restricting your freedom to exploit a variety of technologies What if you could use your existing investments and move to an extensible architecture that can be more easily tailored to changing business requirements You can do all this and more with Apache Tuscany and Service Component Architecture (SCA). Tuscany in Action is a comprehensive, hands-on guide for developing technology agnostic, extensible applications using Apache Tuscany's lightweight SCA infrastructure. The book uses practical examples based on a travel booking scenario to demonstrate how to develop applications with Tuscany SCA. Apache Tuscany supports a variety of programming environments, data bindings and communication protocols \"out of the box\" and can be easily extended to support other technologies. By reading Tuscany in Action you'll learn how to model, compose, deploy and manage applications using SCA. This includes using many of the technologies included with Tuscany such as Web services, JMS and JSON-RPC for protocol handling and Java, BPEL, Spring and scripting for developing components. You'll also learn how to extend Apache Tuscany to support new programming environments and communication protocols and how you can embed the runtime into your application environment.",
    "status": "PUBLISH",
    "authors": [
      "Simon Laws",
      "Mark Combellack",
      "Raymond Feng",
      "Haleh Mahbod",
      "Simon Nash"
    ],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 691,
    "saleprice": 151.44,
    "id": 136,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/laws.jpg",
    "discount": 0,
    "stock": 8
  },
  {
    "name": "AspectJ in Action",
    "isbn": "1930110936",
    "pages": 512,
    "year": 2003,
    "longDescription": "A software system is the realization of a set of concerns. One of the central premises of object-oriented programming is that each concern should be implemented as a separate module. However, there are certain system-wide concerns, such as logging, security, performance, and so forth, that often need to be addressed in many, if not all of the modules. Consequently, the code to handle these system-wide concerns may be mixed in with the core logic of a huge number of modules, resulting in lower productivity, poor quality, and systems that are hard to evolve. Aspect-oriented programming overcomes these problems by modularizing the system-wide concerns. AspectJ enables AOP programming in Java by adding a few new language constructs. By using Java as the base language and creating a final system that is compatible with Java byte code specification, AspectJ passes on all the benefits of Java. The use of Java as the base language also makes AspectJ a relatively easy language to learn. AspectJ in Action is a practical guide to AOP and AspectJ. The reusable code examples that are provided will enable quick implementation of functionality in your system. The book is divided into three parts. The first part introduces AOP and AspectJ and will be helpful to developers wanting to learn or advance their knowledge of AspectJ. The second and third parts present examples of everyday situations in which you can use simple and easy AspectJ solutions to implement common system requirements such as logging, policy enforcement, resource pooling, business rules, thread-safety, authentication and authorization, as well as transaction management.",
    "status": "PUBLISH",
    "authors": ["Ramnivas Laddad"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 683,
    "saleprice": 108.57,
    "id": 130,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/laddad.jpg",
    "discount": 0,
    "stock": 10
  },
  {
    "name": "Entity Framework 4 in Action",
    "isbn": "1935182188",
    "pages": 576,
    "year": 2011,
    "shortDescription": "Microsoft Entity Framework in Action introduces the Entity Framework to developers working in .NET who already have some knowledge of ADO.NET. The book begins with a review of the core ideas behind the ORM model and shows how Entity Framework offers a smooth transition from a traditional ADO.NET approach. By presenting numerous small examples and a couple larger case studies, the book unfolds the Entity Framework story in clear, easy-to-follow detail. The infrastructure and inner workings will be highlighted only when there s the need to understand a particular feature.",
    "longDescription": "To be successful, any significant application has to manage the flow of data effectively. Microsoft s approach to data has taken another major step forward with the new Entity Framework for .NET. The Entity Framework starts with ideas from Object Relational Management (ORM) tools like NHibernate that help bridge the mismatch between relational databases (like SQL Server) and object oriented languages (like C# and VB.NET). But it also blends in the established ADO.NET model and recent language-based innovations of LINQ to create a powerful new data management paradigm. Microsoft Entity Framework in Action introduces the Entity Framework to developers working in .NET who already have some knowledge of ADO.NET. The book begins with a review of the core ideas behind the ORM model and shows how Entity Framework offers a smooth transition from a traditional ADO.NET approach. By presenting numerous small examples and a couple larger case studies, the book unfolds the Entity Framework story in clear, easy-to-follow detail. The infrastructure and inner workings will be highlighted only when there s the need to understand a particular feature.",
    "status": "PUBLISH",
    "authors": ["Stefano Mostarda", "Marco De Sanctis", "Daniele Bochicchio"],
    "categories": ["Microsoft .NET", "SQL", "BackEnd", "Database"],
    "timesSold": 682,
    "saleprice": 125.27,
    "id": 168,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mostarda.jpg",
    "discount": 17,
    "stock": 27
  },
  {
    "name": "JBoss in Action",
    "isbn": "1933988029",
    "pages": 496,
    "year": 2009,
    "longDescription": "The JBoss 5 Application Server is a Java Enterprise Edition 5 application server that provides services that most enterprise applications need, such as security, transactionality, persistence, monitoring, resource management, and remote access. JBoss 5 Application Server is compliant with the specification defined by the Java Community Process. JBoss in Action teaches readers how to use the JBoss application server, digging into the things that separate JBoss from other Java EE servers. This book goes deeply into the advanced features and configuration of the server. In particular, it focuses on enterprise-class topics, such as high availability, security, and performance. The book walks you through the JBoss 5 Application Server, from installation and configuration to production deployment. It guides you through configuring the server s component containers, such as the JBoss Web Server, the EJB3 server, and JBoss Messaging. It also gives you detailed insight into configuring the services, such as security, performance, and clustering. Beyond coverage of the core application server, the book also teaches you how to use some of the hot technologies that run on top of the application server, such as JBoss Seam and JBoss Portal. The authors, both seasoned professional experts at developing and administering JBoss, provide meaningful explanations and background on many topics, all tied together with practical, real-world advice from their collective experience. The uniquely comprehensive explanations and the overall wide coverage provided in this book surpass any other content currently available. This book is perfect for developers writing Java EE applications, as well as administrators responsible for maintaining the JBoss Application Server.",
    "status": "PUBLISH",
    "authors": ["Javid Jamae", "Peter Johnson"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 679,
    "saleprice": 87.11,
    "id": 106,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/jamae.jpg",
    "discount": 0,
    "stock": 28
  },
  {
    "name": "Up to Speed with Swing, Second Edition",
    "isbn": "1884777759",
    "pages": 560,
    "year": 1999,
    "shortDescription": "Now in its Second Edition, Up to Speed with Swing is for you if you want to get on the fast track to Java Swing. The second edition has been extensively updated to cover Java 1.2 with additional code examples and illustrations.",
    "longDescription": "Now in its Second Edition, Up to Speed with Swing is for you if you want to get on the fast track to Java Swing. The second edition has been extensively updated to cover Java 1.2 with additional code examples and illustrations. Guided by a master programmer who writes Java for a living, you'll learn Swing from the insider's point of view. Up to Speeed with Swing has one purpose: to save you time mastering Swing. From the basics of Swing to creating a custom look and feel, or from the Model View Controller (MVC) architecture to optimizing your Swing code, this tutorial gives you an understanding of the big picture as well as the experience of working through detailed examples.",
    "status": "PUBLISH",
    "authors": ["Steven Gutz"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 641,
    "saleprice": 60.19,
    "id": 84,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/gutz2.jpg",
    "discount": 0,
    "stock": 19
  },
  {
    "name": "Flexible Rails",
    "isbn": "1933988509",
    "pages": 592,
    "year": 2008,
    "shortDescription": "\"Flexible Rails created a standard to which I hold other technical books. You definitely get your money's worth.\"",
    "longDescription": "Rails is a fantastic tool for web application development, but its Ajax-driven interfaces stop short of the richness you gain with a tool like Adobe Flex. Simply put, Flex is the most productive way to build the UI of rich Internet applications, and Rails is the most productive way to rapidly build a database-backed CRUD application. Together, they're an amazing combination. Flexible Rails is a book about how to use Ruby on Rails and Adobe Flex to build next-generation rich Internet applications (RIAs). The book takes you to the leading edge of RIA development, presenting examples in Flex 3 and Rails 2. This book is not an exhaustive Ruby on Rails tutorial, nor a Flex reference manual. (Adobe ships over 3000 pages of PDF reference documentation with Flex.) Instead, it's an extensive tutorial, developed iteratively, how to build an RIA using Flex and Rails together. You learn both the specific techniques you need to use Flex and Rails together as well as the development practices that make the combination especially powerful. The example application built in the book is MIT-licensed, so readers can use it as the basis for their own applications. In fact, one reader has already built an agile project management tool based on the book example! With this book, you learn Flex by osmosis. You can read the book and follow along even if you have never used Flex before. Consider it \"Flex Immersion.\" You absorb the key concepts of Flex as you go through the process of building the application. You will also learn how Flex and Rails integrate with HTTPService and XML, and see how RESTful Rails controller design gracefully supports using the same controller actions for Flex and HTML clients. The author will show you how Cairngorm can be used to architect larger Flex applications, including tips to use Cairngorm in a less verbose way with HTTPService to talk to Rails. Flexible Rails is for both Rails developers who are interested in Flex, and Flex developers who are interested in Rails. For a Rails developer, Flex allows for more dynamic and engaging user interfaces than are possible with Ajax. For a Flex developer, Rails provides a way to rapidly build the ORM and services layer of the application.",
    "status": "PUBLISH",
    "authors": ["Peter Armstrong"],
    "categories": [
      "Web Development",
      "HTML",
      "Ruby on Rails",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 636,
    "saleprice": 110.43,
    "id": 10,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/armstrong.jpg",
    "discount": 0,
    "stock": 17
  },
  {
    "name": "PowerShell in Practice",
    "isbn": "1935182005",
    "pages": 500,
    "year": 2010,
    "shortDescription": "PowerShell in Practice is a hands-on, cookbook-style reference intended for administrators wanting to learn and use PowerShell. Written from an administrator's perspective, it concentrates on using PowerShell for practical tasks and automation. The book starts with an introduction that includes a rapid tutorial and a review of the key areas in which you'll use PowerShell.",
    "longDescription": "Whether you're optimizing performance, automating tasks, or exploiting software features, efficiency is the key to a system administrator's success. Anything that saves a few cycles is a welcome addition to your toolbox; Windows PowerShell has the potential to change the game entirely. Windows PowerShell is a new scripting language written from the ground up with the goal of simplifying Windows system administration. It's fully aware of the Windows platform and is tightly integrated with key server technologies like Exchange, IIS, SQL Server. PowerShell borrows many ideas from the Unix scripting world, so it's instantly familiar to anyone who has scripted in Bash or another Unix shell. It's also a first-class programming language that supports everything from single-line commands to full-featured Windows programs. PowerShell in Practice is a hands-on, cookbook-style reference intended for administrators wanting to learn and use PowerShell. Written from an administrator's perspective, it concentrates on using PowerShell for practical tasks and automation. The book starts with an introduction that includes a rapid tutorial and a review of the key areas in which you'll use PowerShell. This book is written to answer the question \"How can PowerShell make my job as an administrator easier \" After you have your feet under you, you'll find an assortment of practical techniques presented in a Problem/Solution format. The first major part, called Working with People, addresses user accounts, mailboxes, and desktop configuration and maintenance. The second major part, Working with Servers, offers techniques for DNS, Active Directory, Exchange, IIS, and more.",
    "status": "PUBLISH",
    "authors": ["Richard Siddaway"],
    "categories": ["Microsoft .NET", "SQL", "BackEnd", "Database"],
    "timesSold": 605,
    "saleprice": 104.68,
    "id": 231,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/siddaway.jpg",
    "discount": 0,
    "stock": 38
  },
  {
    "name": "Essential Guide to Peoplesoft Development and Customization",
    "isbn": "1884777929",
    "pages": 1101,
    "year": 2000,
    "longDescription": "The Essential Guide to PeopleSoft Development and Customization is an exhaustive, as well as practical, guide that covers PeopleSoft 7.5 and many new features in release 8.0. Both novice and experienced programmers will benefit from the detailed coverage of topics ranging from the basics of Application Designer to the proper use of PeopleCode within the Application Processor. The book serves as both a reference and a tutorial and covers advanced topics that other books avoid. The reader can gain valuable expertise by following the exercises and building sample applications and utilities. Extensive coverage of PeopleCode including scroll and function library examples can be found as well as methodology behind customization and upgrades. Discover how to effectively utilize SQR and Process Scheduler. Master various levels of PeopleSoft security. Most developers won t touch PeopleSoft COBOL programs with a ten foot pole. Expand your horizons by uncovering the secrets of PeopleSoft COBOL and the PTPSQLRT module and even walk through a sample customization. Application Engine is a powerful PeopleTool - but one of the least understood. Through a series of simple but effective exercises the reader will learn Application Engine concepts such as dynamic SQL, decision logic and dynamic sections. A useful Application Engine utility is produced that will enhance the delivered Process Scheduler panels. This book takes a soup-to-nuts approach leading the reader through the full cycle of application development. The four authors are truly experts in the field and provide the reader with the skills necessary to compete in the PeopleSoft marketplace for years to come. Special sections are included which provide detailed information on new features in PeopleSoft release 8. The reader will gain valuable insight into the next generation of PeopleTools. Exciting new features such as the new PeopleCode Debugger and PeopleCode dot notation using a new series of object classes are revealed. Also covered are Application Designer enhancements and improved Process Scheduler design and SQR support. See firsthand how Application Engine has been turbo-charged with a new line of meta-constructs, PeopleCode actions, file handling capability and a new integrated design. The authors primary goal was not to be the first book on the market... it was to be the best.",
    "status": "PUBLISH",
    "authors": [
      "Tony DeLia",
      "Galina Landres",
      "Isidor Rivera",
      "Prakash Sankaran"
    ],
    "categories": ["Client-Server", "SQL", "BackEnd", "Database"],
    "timesSold": 597,
    "saleprice": 188.72,
    "id": 60,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/delia.jpg",
    "discount": 0,
    "stock": 30
  },
  {
    "name": "The Awesome Power of PowerJ",
    "isbn": "1884777538",
    "pages": 378,
    "year": 1998,
    "shortDescription": "The Awesome Power of PowerJ shows you how you can write Java programs the very first day with PowerJ, even if you don't know Java. Through a hands-on approach that makes liberal use of figures and code snippets, you will learn how to use PowerJ to build effective Java applets and applications.",
    "longDescription": "PowerJ is the bridge between the rapid application development world of PowerBuilder and the multiplatform world of Java. The Awesome Power of PowerJ shows you how you can write Java programs the very first day with PowerJ, even if you don't know Java. Through a hands-on approach that makes liberal use of figures and code snippets, you will learn how to use PowerJ to build effective Java applets and applications.",
    "status": "PUBLISH",
    "authors": ["Tim Hatton"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 565,
    "saleprice": 66.15,
    "id": 93,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hatton2.jpg",
    "discount": 15,
    "stock": 2
  },
  {
    "name": "Distributed Programming with Java",
    "isbn": "1884777651",
    "pages": 320,
    "year": 1999,
    "longDescription": "Maybe you've seen some books on Java RMI, others on Java and CORBA and still others on mobile agents. Finally, here's one book that covers ALL the popular approaches for developing distributed applications. What's more, the author makes it easy to compare them by using the same set of examples throughout the book. If you're a developer or systems architect who wants to start building industrial-strength distributed applications in Java, then Distributed Programming with Java is for you!",
    "status": "PUBLISH",
    "authors": ["Qusay H. Mahmoud"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 548,
    "saleprice": 39.71,
    "id": 154,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mahmoud.jpg",
    "discount": 0,
    "stock": 2
  },
  {
    "name": "LDAP Programming, Management and Integration",
    "isbn": "1930110405",
    "pages": 352,
    "year": 2002,
    "longDescription": "LDAP is the leading Internet protocol for directory-like information: user identities, preferences, security privileges. etc. Because it is popular, most programming languages have handy extensions for searching and updating LDAP directories. But most information today is still locked away in application-specific repositories that lack LDAP access. LDAP Programming, Management and Integration explains how to link non-LDAP data with LDAP directories. It starts with a concise introduction to the LDAP standard and discusses how to work with it in Java and Perl. It gives you practical code and advice for migrating and integrating data into an LDAP environment. And it explains how to increase your application's security using identity and profile information from LDAP repositories. Written for programmers and system administrators, this book teaches clearly and honestly the LDAP practiced in the trenches. It is concise yet rich in practical examples that make a sometimes complex subject easy to understand.",
    "status": "PUBLISH",
    "authors": ["Clayton Donley"],
    "categories": ["Internet", "Java", "BackEnd"],
    "timesSold": 539,
    "saleprice": 106.65,
    "id": 66,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/donley.jpg",
    "discount": 0,
    "stock": 40
  },
  {
    "name": "Spring in Action",
    "isbn": "1932394354",
    "pages": 472,
    "year": 2005,
    "shortDescription": "Spring in Action introduces you to the ideas behind Spring and then quickly launches into a hands-on exploration of the framework. Combining short code snippets and an ongoing example developed throughout the book, it shows you how to build simple and efficient J2EE applications. You will see how to solve persistence problems using the leading open-source tools, and also how to integrate your application with the most popular web frameworks. You will learn how to use Spring to manage the bulk of your infrastructure code so you can focus on what really matters your critical business needs.",
    "longDescription": "Spring is a fresh breeze blowing over the Java landscape. Based on a design principle called Inversion of Control, Spring is a powerful but lightweight J2EE framework that does not require the use of EJBs. Spring greatly reduces the complexity of using interfaces, and speeds and simplifies your application development. You get the power and robust features of EJB and get to keep the simplicity of the non-enterprise JavaBean. Spring in Action introduces you to the ideas behind Spring and then quickly launches into a hands-on exploration of the framework. Combining short code snippets and an ongoing example developed throughout the book, it shows you how to build simple and efficient J2EE applications. You will see how to solve persistence problems using the leading open-source tools, and also how to integrate your application with the most popular web frameworks. You will learn how to use Spring to manage the bulk of your infrastructure code so you can focus on what really matters your critical business needs.",
    "status": "PUBLISH",
    "authors": ["Craig Walls", "Ryan Breidenbach"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 527,
    "saleprice": 52.93,
    "id": 257,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/walls2.jpg",
    "discount": 0,
    "stock": 16
  },
  {
    "name": "Java Applets and Channels Without Programming",
    "isbn": "1884777392",
    "pages": 372,
    "year": 1999,
    "shortDescription": "Java Applets and Channels Without Programming collects almost 100 applets on a CD with detailed instructions on how to use each applet. In addition, style issues are discussed in detail; not only will you learn how to use each applet, you will learn when and where it is appropriate to use each applet. The book also introduces the new concept of channels and shows how these can be used on your web site as well. ",
    "longDescription": "If you want to use Java to enhance your Web site, you have two choices: you can write the Java applet yourself or you can find an already written Java applet that meets your needs. If you prefer not to do the writing yourself, then Java Applets and Channels Without Programming is for you. It collects almost 100 applets on a CD with detailed instructions on how to use each applet. In addition, style issues are discussed in detail; not only will you learn how to use each applet, you will learn when and where it is appropriate to use each applet. The book also introduces the new concept of channels and shows how these can be used on your web site as well. The CD-ROM also contains an exclusive applet configuration utility, a program that allows you to configure the Java applets on the CD-ROM in a WYSIWYG (What You See Is What You Get) environment. When using the utility to configure Java applets, you do not need to know any Java programming or even any HTML programming. All you do is change the value of a parameter and click on a button to see the resulting change to the applet. The applet configuration utility is written in Java and runs in your browser, so it runs on any computer platform for which there is a Java-enabled browser. The CD-ROM also provides example web pages for more than 60 of the included applets, so you can learn how to use the applets in real-world situations.",
    "status": "PUBLISH",
    "authors": [
      "Ronny Richardson",
      "Michael Shoffner",
      "Marq Singer",
      "Bruce Murray",
      "Jack Gambol"
    ],
    "categories": ["Java", "HTML", "Java", "BackEnd", "FrontEnd"],
    "timesSold": 522,
    "saleprice": 118.21,
    "id": 230,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/shoffner.jpg",
    "discount": 0,
    "stock": 6
  },
  {
    "name": "SQL Server MVP Deep Dives",
    "isbn": "9781935182047",
    "pages": 848,
    "year": 2009,
    "shortDescription": "SQL Server MVP Deep Dives is organized into five parts: Design and Architecture, Development, Administration, Performance Tuning and Optimization, and Business Intelligence. In each, you'll find concise, brilliantly clear chapters that take on key topics like mobile data strategies, Dynamic Management Views, or query performance.",
    "longDescription": "This is no ordinary SQL Server book. In SQL Server MVP Deep Dives, the world's leading experts and practitioners offer a masterful collection of techniques and best practices for SQL Server development and administration. 53 MVPs each pick an area of passionate interest to them and then share their insights and practical know-how with you. SQL Server MVP Deep Dives is organized into five parts: Design and Architecture, Development, Administration, Performance Tuning and Optimization, and Business Intelligence. In each, you'll find concise, brilliantly clear chapters that take on key topics like mobile data strategies, Dynamic Management Views, or query performance.",
    "status": "PUBLISH",
    "authors": [
      "Kalen Delaney",
      "Greg Low",
      "Adam Machanic",
      "Paul S. Randal",
      "Kimberly L. Tripp"
    ],
    "categories": ["Microsoft .NET", "SQL", "BackEnd", "Database"],
    "timesSold": 504,
    "saleprice": 104.81,
    "id": 175,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/nielsenaw.jpg",
    "discount": 0,
    "stock": 45
  },
  {
    "name": "Node.js in Action",
    "isbn": "1617290572",
    "pages": 300,
    "year": 2013,
    "shortDescription": "Node.js in Action is an example-driven tutorial that starts at square one and guides you through all the features, techniques, and concepts you'll need to build production-quality Node applications. You'll start by learning how to set up your Node development environment, including loading the community-created extensions. Next, you'll run several simple demonstration programs where you'll learn the basics of a few common types of Node applications. Then you'll dive into asynchronous programming, a model Node leverages to lessen application bottlenecks.",
    "longDescription": "JavaScript on the server? Yep. Node.js is an elegant server-side JavaScript development environment perfect for scalable, high-performance web applications. With Node you access HTTP and TCP/IP functionality through a minimalist server-side Javascript interface. It supports an asynchronous programming model that enables the web server to more easily do more than one thing at a time, a key requirement for real-time applications such as chat, online games, and live statistics. And since it's JavaScript, you'll use the same language throughout your entire application.\n\nNode.js in Action is an example-driven tutorial that starts at square one and guides you through all the features, techniques, and concepts you'll need to build production-quality Node applications. You'll start by learning how to set up your Node development environment, including loading the community-created extensions. Next, you'll run several simple demonstration programs where you'll learn the basics of a few common types of Node applications. Then you'll dive into asynchronous programming, a model Node leverages to lessen application bottlenecks.\n\nWith the basics under your belt, you're ready to start building serious web applications using Node's HTTP API. You'll explore data storage, application deployment, and output templating, and you'll discover community frameworks that make web development easier and faster. Along the way, you'll learn to interact with the filesystem and to create non-HTTP applications, such as TCP/IP servers and command-line tools.\n\nMuch of the Node ecosystem is open source, so this book will show you how the community works and how you can contribute. You'll learn about the NPM Repository, where most community extensions reside, and you'll learn how to publish your own extensions. In addition, the book outlines online resources for getting help with any stumbling blocks you run into during your journey as a Node developer.\nWHAT'S INSIDE",
    "status": "PUBLISH",
    "authors": [
      "Mike Cantelon",
      "Marc Harter",
      "T.J. Holowaychuk",
      "Nathan Rajlich"
    ],
    "categories": [
      "Web Development",
      "Javascript",
      "Javascript",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 495,
    "saleprice": 12.78,
    "id": 273,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/cantelon.jpg",
    "discount": 0,
    "stock": 4
  },
  {
    "name": "Spring in Practice",
    "isbn": "1935182056",
    "pages": 600,
    "year": 2013,
    "shortDescription": "Spring in Practice diverges from other cookbooks because it presents the background you need to understand the domain in which a solution applies before it offers the specific steps to solve the problem. You're never left with the feeling that you understand the answer, but find the question irrelevant. You can put the book to immediate use even if you don't have deep knowledge of every part of Spring Framework.",
    "longDescription": "For enterprise Java developers, Spring Framework provides remarkable improvements in developer productivity, runtime performance, and overall application quality. Its unique blend of a complete, lightweight container that allows you to build a complex application from loosely-coupled POJOs and a set of easily understood abstractions that simplify construction, testing, and deployment make Spring both powerful and easy-to-use a hard-to-beat combination. With this power comes the potential for a wide range of uses in both common and not-so-common scenarios. That's where Spring in Practice comes in. Unlike the many books that teach you what Spring is, Spring in Practice shows you how to tackle the challenges you face when you build Spring-based applications. The book empowers software developers to solve concrete business problems \"the Spring way\" by mapping application-level issues to Spring-centric solutions. Spring in Practice diverges from other cookbooks because it presents the background you need to understand the domain in which a solution applies before it offers the specific steps to solve the problem. You're never left with the feeling that you understand the answer, but find the question irrelevant. You can put the book to immediate use even if you don't have deep knowledge of every part of Spring Framework. The book divides into three main parts. In Part 1, you'll get a rapid overview of Spring Framework enough to get you started if you're new and a great refresher for readers who already have a few Spring cycles. Part 2 provides techniques that are likely to be useful no matter what type of application you're building. You'll find discussions of topics like user accounts, security, site navigation, and application diagnosis. Part 3 provides domain-specific recipes. Here, you'll find practical solutions to realistic and interesting business problems. For example, this part discusses Spring-based approaches for ecommerce, lead generation, and CRM. There are several recurring themes throughout Spring in Practice, including Spring MVC, Hibernate, and transactions. Each recipe is an opportunity to highlight something new or interesting about Spring, and to focus on that concept in detail. This book assumes you have a good foundation in Java and Java EE. Prior exposure to Spring Framework is helpful, but not required.",
    "status": "PUBLISH",
    "authors": ["Willie Wheeler with Joshua White"],
    "categories": ["Java", "Software Development", "Java", "BackEnd"],
    "timesSold": 494,
    "saleprice": 35.35,
    "id": 260,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/wheeler.jpg",
    "discount": 0,
    "stock": 13
  },
  {
    "name": "OCP Java SE 7 Programmer II Certification Guide",
    "isbn": "161729148X",
    "pages": 300,
    "status": "MEAP",
    "authors": ["Mala Gupta"],
    "categories": ["Java", "BackEnd"],
    "timesSold": 485,
    "saleprice": 144.11,
    "id": 350,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/gupta2.jpg",
    "year": 2014,
    "discount": 0,
    "stock": 8,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Portlets and Apache Portals",
    "pages": 500,
    "year": 2005,
    "shortDescription": "Portlets and Apache Portals was not published by Manning, but the manuscript is available for download from our website \"as is.\"",
    "longDescription": "Due to the growing complexity of web sites, portals and portlets are experiencing serious growth. Portals help reduce complexity by allowing the dynamic aggregation and display of diverse content in a single web page. Portal components are pluggable parts called portlets. To be \"pluggable\" portlets and portals must satisfy standards. The authors of this book, all but one employees of IBM, created these standards: Java Portlet Specification JSR 168 and Web Services for Remote Portlets (WSRP). The book starts gently with the basics of portlet technology and a functionrich portlet example. It then dives more deeply into portlets and J2EE, portlet architecture, best practices, and explores how the popular JSF web framework can ease portlet development. It shows how to set up an open source portal and create portlets that dynamically access backend data of various types. It is rich in something readers want: code examples that show them how to do it.",
    "status": "PUBLISH",
    "authors": [
      "Stefan Hepper",
      "Peter Fischer",
      "Stephan Hesmer",
      "Richard Jacob",
      "David Sean Taylor"
    ],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 475,
    "saleprice": 91.61,
    "id": 98,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hepper.jpg",
    "discount": 8,
    "stock": 0
  },
  {
    "name": "HTML5 for .NET Developers",
    "isbn": "1617290432",
    "pages": 300,
    "year": 2012,
    "status": "PUBLISH",
    "authors": ["Jim Jackson", "II", "Ian Gilman"],
    "categories": ["HTML", "FrontEnd"],
    "timesSold": 468,
    "saleprice": 96.95,
    "id": 291,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/jackson.jpg",
    "discount": 0,
    "stock": 42,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Java 8 in Action",
    "isbn": "1617291994",
    "pages": 300,
    "status": "MEAP",
    "authors": ["Raoul-Gabriel Urma", "Mario Fusco", "Alan Mycroft"],
    "categories": ["Java", "BackEnd"],
    "timesSold": 458,
    "saleprice": 75.4,
    "id": 375,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/urma.jpg",
    "year": 1992,
    "discount": 0,
    "stock": 42,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "R in Action",
    "isbn": "1935182390",
    "pages": 375,
    "year": 2011,
    "shortDescription": "R in Action is the first book to present both the R system and the use cases that make it such a compelling package for business developers. The book begins by introducing the R language, including the development environment. As you work through various examples illustrating R's features, you'll also get a crash course in practical statistics, including basic and advanced models for normal and non-normal data, longitudinal and survival data, and a wide variety of multivariate methods. Both data mining methodologies and approaches to messy and incomplete data are included.",
    "longDescription": "The ability to interpret and act on the massive amounts of information locked in web and enterprise systems is critical to success in the modern business economy. R, a free software environment for statistical computing and graphics, is a comprehensive, fully-programmable package that empowers developers and analysts to capture, process, and respond intelligently to statistical information. It consists of the interpreted R language plus a run-time environment with graphics, a debugger, and the ability to run programs stored in script files. It compiles and runs on UNIX, Windows and Mac OS X, and has been extended with hundreds of add-on packages. R in Action is the first book to present both the R system and the use cases that make it such a compelling package for business developers. The book begins by introducing the R language, including the development environment. As you work through various examples illustrating R's features, you'll also get a crash course in practical statistics, including basic and advanced models for normal and non-normal data, longitudinal and survival data, and a wide variety of multivariate methods. Both data mining methodologies and approaches to messy and incomplete data are included. And data analysis is only half the story. You'll also master R's extensive graphical environment for presenting data. Along the way, the book presents many of R's most useful add-on modules. You'll also learn how to interface R with other software platforms and data management systems for maximum utility.",
    "status": "PUBLISH",
    "authors": ["Robert I. Kabacoff"],
    "categories": ["Software Engineering", "Git"],
    "timesSold": 449,
    "saleprice": 184.65,
    "id": 112,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kabacoff.jpg",
    "discount": 0,
    "stock": 29
  },
  {
    "name": "Ant in Action",
    "isbn": "193239480X",
    "pages": 600,
    "year": 2007,
    "shortDescription": "The most widely used build tool for Java projects, Ant is cross-platform, extensible, simple, and fast. It scales from small personal projects to large, multi-team enterprise projects. And, most important, it s easy to learn.",
    "longDescription": "Ant in Action is a complete guide to using Ant to build, test, redistribute and deploy Java applications. A retitled second edition of the bestselling and award-winning Java Development with Ant, this book contains over 50% new content including: New Ant 1.7 features Scalable builds for big projects Continuous integration techniques Deployment Library management Extending Ant Whether you are dealing with a small library or a complex server-side system, this book will help you master your build process. By presenting a running example that grows in complexity, the book covers nearly the entire gamut of modern Java application development, including test-driven development and even how to set up your database as part of the deployment.",
    "status": "PUBLISH",
    "authors": ["Steve Loughran", "Erik Hatcher"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 420,
    "saleprice": 105.93,
    "id": 146,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/loughran.jpg",
    "discount": 0,
    "stock": 34
  },
  {
    "name": "jQuery in Action",
    "isbn": "1933988355",
    "pages": 376,
    "year": 2008,
    "shortDescription": "\"The best-thought-out and researched piece of literature on the jQuery library.\" --From the forward by John Resig, Creator of jQuery",
    "longDescription": "A really good web development framework anticipates your needs. jQuery does more it practically reads your mind. Developers fall in love with this JavaScript library the moment they see 20 lines of code reduced to three. jQuery is concise and readable. Its unique chaining model lets you perform multiple operations on a page element in succession, as in ( div.elements ).addClass( myClass ).load( ajax_url ).fadeIn() jQuery in Action is a fast-paced introduction and guide. It shows you how to traverse HTML documents, handle events, perform animations, and add Ajax to your web pages. The book's unique lab pages anchor the explanation of each new concept in a practical example. You'll learn how jQuery interacts with other tools and frameworks and how to build jQuery plugins. This book requires a modest knowledge of JavaScript and Ajax.",
    "status": "PUBLISH",
    "authors": ["Bear Bibeault", "Yehuda Katz"],
    "categories": [
      "Web Development",
      "Javascript",
      "Javascript",
      "HTML",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 417,
    "saleprice": 85.59,
    "id": 27,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bibeault.jpg",
    "discount": 0,
    "stock": 47
  },
  {
    "name": "Groovy in Action",
    "isbn": "1932394842",
    "pages": 696,
    "year": 2007,
    "longDescription": "Groovy, the brand-new language for the Java platform, brings to Java many of the features that have made Ruby popular. Groovy in Action is a comprehensive guide to Groovy programming, introducing Java developers to the new dynamic features that Groovy provides. To bring you Groovy in Action, Manning again went to the source by working with a team of expert authors including both members and the manager of the Groovy Project team. The result is the true definitive guide to the new Groovy language. Groovy in Action introduces Groovy by example, presenting lots of reusable code while explaining the underlying concepts. Java developers new to Groovy find a smooth transition into the dynamic programming world. Groovy experts gain a solid reference that challenges them to explore Groovy deeply and creatively. Because Groovy is so new, most readers will be learning it from scratch. Groovy in Action quickly moves through the Groovy basics, including: Simple and collective Groovy data types Working with closures and Groovy control structures Dynamic Object Orientation, Groovy style Readers are presented with rich and detailed examples illustrating Groovy's enhancements to Java, including How to work with builders and the GDK Database programming with Groovy Groovy in Action then demonstrates how to Integrate Groovy with XML, and provides, Tips and Tricks Unit testing and build support Groovy on Windows An additional bonus is a chapter dedicated to Grails, the Groovy web application framework.",
    "status": "PUBLISH",
    "authors": [
      "Dierk Koenig with Andrew Glover",
      "Paul King",
      "Guillaume Laforge",
      "Jon Skeet"
    ],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 414,
    "saleprice": 80.9,
    "id": 120,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/koenig.jpg",
    "discount": 0,
    "stock": 13
  },
  {
    "name": "Collective Intelligence in Action",
    "isbn": "1933988312",
    "pages": 425,
    "year": 2008,
    "longDescription": "There's a great deal of wisdom in a crowd, but how do you listen to a thousand people talking at once Identifying the wants, needs, and knowledge of internet users can be like listening to a mob. In the Web 2.0 era, leveraging the collective power of user contributions, interactions, and feedback is the key to market dominance. A new category of powerful programming techniques lets you discover the patterns, inter-relationships, and individual profiles the collective intelligence locked in the data people leave behind as they surf websites, post blogs, and interact with other users. Collective Intelligence in Action is a hands-on guidebook for implementing collective-intelligence concepts using Java. It is the first Java-based book to emphasize the underlying algorithms and technical implementation of vital data gathering and mining techniques like analyzing trends, discovering relationships, and making predictions. It provides a pragmatic approach to personalization by combining content-based analysis with collaborative approaches. This book is for Java developers implementing collective intelligence in real, high-use applications. Following a running example in which you harvest and use information from blogs, you learn to develop software that you can embed in your own applications. The code examples are immediately reusable and give the Java developer a working collective intelligence toolkit. Along the way, you work with, a number of APIs and open-source toolkits including text analysis and search using Lucene, web-crawling using Nutch, and applying machine learning algorithms using WEKA and the Java Data Mining (JDM) standard.",
    "status": "PUBLISH",
    "authors": ["Satnam Alag"],
    "categories": ["Internet", "Java", "BackEnd"],
    "timesSold": 392,
    "saleprice": 179.32,
    "id": 5,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/alag.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "SQL Server 2008 Administration in Action",
    "isbn": "193398872X",
    "pages": 468,
    "year": 2009,
    "longDescription": "The integrity and security of your database is crucial to your business. SQL Server 2008 is a massive and mature product with a very large feature set. As a SQL Server administrator, you must be equipped to handle myriad day-to-day tasks to keep your database healthy, and you must also be prepared to act quickly when something unexpected happens. SQL Server 2008 Administration in Action offers over 100 DBA-tested, high-value, best practices that will help you tame the beast and keep it under control. Unlike the many comprehensive SQL Server reference tomes out there that attempt to cover the whole SQL Server feature set, this book drills down on the techniques, procedures, and practices that help you keep your database running like clockwork. SQL Server 2008 Administration in Action focuses the production DBA, digging deep into the various tasks specific to that role. Expert author Rod Colledge--check him out at sqlCrunch.com--teaches you best practices that cover the lifecycle of a SQL Server system, including infrastructure design, installation, and operational maintenance. And while many of these techniques will work in any recent version of SQL Server, you'll find full coverage of emerging SQL Server 2008 best practices. Each technique is presented in a task-driven style, and in the order of the typical life cycle of a SQL Server system. This allows you to easily open the book at the appropriate page and focus on what you need to know for each specific situation.",
    "status": "PUBLISH",
    "authors": ["Rod Colledge"],
    "categories": ["Microsoft", "SQL", "BackEnd", "Database"],
    "timesSold": 392,
    "saleprice": 15.62,
    "id": 46,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/colledge.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "3D User Interfaces with Java 3D",
    "isbn": "1884777902",
    "pages": 520,
    "year": 2000,
    "longDescription": "3D User Interfaces with Java 3D is a practical guide for providing next-generation applications with 3D user interfaces for manipulation of in-scene objects. Emphasis is on standalone and web-based business applications, such as for online sales and mass customization, but much of what this book offers has broad applicability to 3D user interfaces in other pursuits such as scientific visualization and gaming. This book provides an extensive conceptual framework for 3D user interface techniques, and an in-depth introduction to user interface support in the Java 3D API, including such topics as picking, collision, and drag-and-drop. Many of the techniques are demonstrated in a Java 3D software framework included with the book, which also provides developers with many general-purpose building blocks for constructing their own user interfaces. Applications and their use of 3D are approached realistically. The book is geared towards sophisticated user interfaces for the \"everyday user\" who doesn't have a lot of time to learn another application--much less a complicated one--and an everyday computer system without exotic devices like head mounted displays and data gloves. Perhaps the best description of this book is: \"A roadmap from Java 3D to 'Swing 3D'.\"",
    "status": "PUBLISH",
    "authors": ["Jon Barrilleaux"],
    "categories": ["Java", "Computer Graphics", "Java", "BackEnd"],
    "timesSold": 381,
    "saleprice": 146.58,
    "id": 19,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/barrilleaux.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "Bitter Java",
    "isbn": "193011043X",
    "pages": 368,
    "year": 2002,
    "longDescription": "It is a well-known fact that most software projects fail. Drawing important lessons from common failures is the goal of Bitter Java. Reusing design patterns is not enough for success: patterns are like partial maps of dangerous terrain. They help, but don't prevent you from getting lost. Bitter Java teaches you how to recognize when you are lost, and how to get back on the right path. It illustrates common pitfalls of Java programming through code examples; it then refactors the code and explains why the new solutions are safe. This book is a systematic account of common server-side Java programming mistakes, their causes and solutions. It covers antipatterns for base Java and J2EE concepts such as Servlets, JSPs, EJBs, enterprise connection models, and scalability. If you are an intermediate Java programmer, analyst or architect eager to avoid the bitter experiences of others, this book is for you.",
    "status": "PUBLISH",
    "authors": ["Bruce A. Tate"],
    "categories": ["Java", "Business", "Client Server", "Java", "BackEnd"],
    "timesSold": 355,
    "saleprice": 173.42,
    "id": 247,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/tate.jpg",
    "discount": 6,
    "stock": 26
  },
  {
    "name": "SCWCD Exam Study Kit Second Edition",
    "isbn": "1932394389",
    "pages": 560,
    "year": 2005,
    "longDescription": "With the tremendous penetration of J2EE in the enterprise, passing the Sun Certified Web Component Developer exam has become an important qualification for Java and J2EE developers. To pass the SCWCD exam (Number: 310-081) you need to answer 69 questions in 135 minutes and get 62% of them right. You also need 150 and this (completely updated and newly revised) book. In its first edition, the SCWCD Exam Study Kit was the most popular book used to pass this most desirable web development certification exam. The new edition will help you learn the concepts large and small that you need to know. It covers the newest version of the exam and not a single topic is missed. The SCWCD exam is for Sun Certified Java Programmers who have a certain amount of experience with Servlets and JSPs, but for those who do not, the book starts with three introductory chapters on these topics. Although the SCWCD Exam Study Kit has one purpose, to help you get certified, you will find yourself returning to it as a reference after passing the exam.",
    "status": "PUBLISH",
    "authors": ["Hanumant Deshmukh", "Jignesh Malavia", "Matthew Scarpino"],
    "categories": ["Internet", "Java", "BackEnd"],
    "timesSold": 350,
    "saleprice": 181.65,
    "id": 62,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/deshmukh2.jpg",
    "discount": 0,
    "stock": 36
  },
  {
    "name": "Portlets in Action",
    "isbn": "1935182544",
    "pages": 475,
    "year": 2011,
    "shortDescription": "Portlets in Action is a comprehensive guide for Java developers with minimal or no experience working with portlets. Fully exploring the Portlet 2.0 API and using widely adopted frameworks like Spring 3.0 Portlet MVC, Hibernate, and DWR, it teaches you portal and portlet development by walking you through a Book Catalog portlet and Book Portal examples.",
    "longDescription": "A \"portal\" is a browser-based container populated by small applications called \"portlets\". Good portlets need to work independently, but also communicate with the portal, other portlets, and outside servers and information sources. Whether they're part of internal or web-facing portals, high-quality portlets are the foundation of a fast, flexible, and successful development strategy. Portlets in Action is a comprehensive guide for Java developers with minimal or no experience working with portlets. Fully exploring the Portlet 2.0 API and using widely adopted frameworks like Spring 3.0 Portlet MVC, Hibernate, and DWR, it teaches you portal and portlet development by walking you through a Book Catalog portlet and Book Portal examples. The example Book Catalog Portlet, developed incrementally in each chapter of the book, incorporates most key portlet features, and the accompanying source code can be easily adapted and reused by readers. The example Book Portal application introduces you to the challenges faced in developing web portals. WHAT'S INSIDE * Complete coverage of Portlet 2.0 API * New features added in Portlet 2.0 * Code examples use * Develop rich portlets using AJAX with DWR, DOJO, and jQuery * Complete coverage of Spring 3.0 Portlet MVC and the Liferay portal server ",
    "status": "PUBLISH",
    "authors": ["Ashish Sarin"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 348,
    "saleprice": 176.57,
    "id": 221,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sarin.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "Java Persistence with Hibernate",
    "isbn": "1932394885",
    "pages": 880,
    "year": 2006,
    "shortDescription": "\"...this book is the ultimate solution. If you are going to use Hibernate in your application, you have no other choice, go rush to the store and get this book.\" --JavaLobby",
    "longDescription": "Persistence -- the ability of data to outlive an instance of a program -- is central to modern applications. Hibernate, the most popular Java persistence tool, provides automatic and transparent object/relational mapping so it's a snap to work with SQL databases in Java applications. Hibernate conforms to the new EJB 3.0 and Java Persistence 1.0 standards. Java Persistence with Hibernate explores Hibernate by developing an application that ties together hundreds of individual examples. You'll immediately dig into the rich programming model of Hibernate 3.2 and Java Persistence, working through queries, fetching strategies, caching, transactions, conversations, and more. You'll also appreciate the well-illustrated discussion of best practices in database design, object/relational mapping, and optimization techniques. In this revised edition of Manning's bestselling Hibernate in Action, authors Christian Bauer and Gavin King -- the founder of the Hibernate project -- cover Hibernate 3.2 in detail along with the EJB 3.0 and Java Persistence 1.0 standards.",
    "status": "PUBLISH",
    "authors": ["Christian Bauer", "Gavin King"],
    "categories": ["Java", "SQL", "Java", "BackEnd", "Database"],
    "timesSold": 331,
    "saleprice": 152.31,
    "id": 22,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bauer2.jpg",
    "discount": 0,
    "stock": 49
  },
  {
    "name": "The Awesome Power of Java Beans",
    "isbn": "1884777562",
    "pages": 500,
    "year": 1998,
    "longDescription": "Build your own bean Or use one that's ready-made The Awesome Power of Java Beans provides the details on both. Either way, the power of Java Beans is awesome: once created, your beans run anywhere-- ceven masquerading as an ActiveX control. The Awesome Power of Java Beans shows you how to use not only BeanBox, but also such tools as VisualAge WebRunner, JBuilder and PowerJ. And there's a wide-ranging selection of completed and tested beans for you to use in your applications If you're a Java programmer, teacher or student, or if you design software systems using Java Beans, this book will be a valuable resource.",
    "status": "PUBLISH",
    "authors": ["Lawrence H. Rodrigues"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 331,
    "saleprice": 156.96,
    "id": 214,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/rodrigues.jpg",
    "discount": 0,
    "stock": 18
  },
  {
    "name": "The Quick Python Book",
    "isbn": "1884777740",
    "pages": 444,
    "year": 1999,
    "longDescription": "The Quick Python Book is a clear, concise introduction to Python, one of the most elegant programming languages in existence. The book is aimed at readers who know programming but for whom the Python language is new. This book is designed so that you can use it to quickly become proficient in Python. However, it provides more than just a beginners tutorial. Even once you've become more experienced, it should continue to be quite valuable to you as an indexed cache of information on the bulk of the Python concepts and constructs of which you will find yourself wanting to refresh or augment your knowledge. It first covers the core features of Python (syntax, control flow, basic data structures, etc.) and provides the knowledge to write basic but useful scripts. Features in Python common to other languages are covered very concisely, while features unique to Python are explained in detail. It next discusses Python features which would be useful to anyone using Python in larger applications, including facilities for managing large collections of code, object-oriented programming, advanced string handling, etc. The last section of the book discusses advanced topics: Windows/COM programming with Python, integrating Python and Java (Python is one of the few languages other than Java which can be compiled into Java bytecode), extending the Python language with C, and an introduction to some of the advanced web site building tools that are available for Python.",
    "status": "PUBLISH",
    "authors": ["Daryl Harms", "Kenneth McDonald"],
    "categories": ["Python", "Python", "Java", "BackEnd"],
    "timesSold": 297,
    "saleprice": 19.63,
    "id": 87,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/harms.jpg",
    "discount": 15,
    "stock": 13
  },
  {
    "name": "Learn SQL Server Administration in a Month of Lunches",
    "isbn": "1617292133",
    "pages": 300,
    "year": 2014,
    "status": "PUBLISH",
    "authors": ["Don Jones"],
    "categories": ["SQL", "BackEnd", "Database"],
    "timesSold": 286,
    "saleprice": 123.91,
    "id": 381,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/jones5.jpg",
    "discount": 0,
    "stock": 27,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Java 2 Micro Edition",
    "isbn": "1930110332",
    "pages": 504,
    "year": 2002,
    "longDescription": "Java2, Micro Edition (J2ME) is a technology defined by many specifications. These specifications help J2ME address the diverse needs of this wide spectrum of consumer products. This guide describes the architecture of J2ME and demonstrates the various specifications for programming Java applications. Through the use of a tutorial application and various programming examples, the common elements of most applications, namely user interface, event handling, data storage, networking, and input/output are examined. Also covered are design considerations when building software for resource-constrained devices as well as J2ME competition and associated technologies in these devices. Tutorial and API example application source code downloads will be available from this site.",
    "status": "PUBLISH",
    "authors": ["James P. White", "David A. Hemphill"],
    "categories": ["Java", "Internet", "Java", "BackEnd"],
    "timesSold": 284,
    "saleprice": 14.91,
    "id": 261,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/white.jpg",
    "discount": 0,
    "stock": 8
  },
  {
    "name": "LINQ in Action",
    "isbn": "1933988169",
    "pages": 576,
    "year": 2008,
    "longDescription": "LINQ, Language INtegrated Query, is a new extension to the Visual Basic and C# programming languages designed to simplify data queries and database interaction. It addreses O/R mapping issues by making query operations like SQL statements part of the programming language. Adding to its power, LINQ is extensible and can be used to query various data sources. It offers built-in support for querying in-memory collections like arrays or lists, XML, DataSets, and relational databases. LINQ in Action is a fast-paced, comprehensive tutorial for professional developers who want to use LINQ. This book explores what can be done with LINQ, shows you how it works in an application, and addresses the emerging best practices. It presents the general purpose query facilities offered by LINQ in the upcoming C# 3.0 and VB.NET 9.0 languages. A running example introduces basic LINQ concepts. You ll then learn to query unstructured data using LINQ to XML and relational data with LINQ to SQL. Finally, you ll see how to extend LINQ for custom applications. LINQ in Action will guide you along as you navigate this new world of lambda expressions, query operators, and expression trees. You ll also explore the new features of C# 3.0, VB.NET 9.0. The book is very practical, anchoring each new idea with running code. You will discover all the basics needed to get a clear understanding of LINQ. Whether you want to use LINQ to query objects, XML documents, or relational databases, you will find all the information you need to get started. But LINQ in Action does not stop at the basic code. This book also shows you how LINQ can be used for advanced processing of data. This includes coverage of LINQ s extensibility, which allows querying more data sources than those supported by default. All code samples are built on a concrete business case. The running example, LinqBooks, is a personal book cataloging system that shows you how to create LINQ applications with Visual Studio 2008.",
    "status": "PUBLISH",
    "authors": ["Fabrice Marguerie", "Steve Eichert", "Jim Wooley"],
    "categories": ["Microsoft .NET", "SQL", "BackEnd", "Database"],
    "timesSold": 278,
    "saleprice": 22.72,
    "id": 157,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/marguerie.jpg",
    "discount": 0,
    "stock": 29
  },
  {
    "name": "The Quick Python Book, Second Edition",
    "isbn": "193518220X",
    "pages": 360,
    "year": 2010,
    "shortDescription": "This revision of Manning's popular The Quick Python Book offers a clear, crisp introduction to the elegant Python programming language and its famously easy-to-read syntax. Written for programmers new to Python, this updated edition covers features common to other languages concisely, while introducing Python's comprehensive standard functions library and unique features in detail.",
    "longDescription": "This revision of Manning's popular The Quick Python Book offers a clear, crisp introduction to the elegant Python programming language and its famously easy-to-read syntax. Written for programmers new to Python, this updated edition covers features common to other languages concisely, while introducing Python's comprehensive standard functions library and unique features in detail. After exploring Python's syntax, control flow, and basic data structures, the book shows how to create, test, and deploy full applications and larger code libraries. It addresses established Python features as well as the advanced object-oriented options available in Python 3. Along the way, you'll survey the current Python development landscape, including GUI programming, testing, database access, and web frameworks. WHAT'S INSIDE: * Concepts and Python 3 features * Regular expressions and testing * Python tools * All the Python you need nothing you don't",
    "status": "PUBLISH",
    "authors": ["Naomi R. Ceder"],
    "categories": ["Python", "Python", "BackEnd"],
    "timesSold": 260,
    "saleprice": 186.5,
    "id": 41,
    "type": ["paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ceder.jpg",
    "discount": 5,
    "stock": 1
  },
  {
    "name": "Making Sense of NoSQL",
    "isbn": "1617291072",
    "pages": 300,
    "year": 2013,
    "status": "PUBLISH",
    "authors": ["Daniel G. McCreary", "Ann M. Kelly"],
    "categories": ["SQL", "BackEnd", "Database"],
    "timesSold": 260,
    "saleprice": 118.98,
    "id": 320,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mccreary.jpg",
    "discount": 0,
    "stock": 32,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Bitter EJB",
    "isbn": "1930110952",
    "pages": 440,
    "year": 2003,
    "shortDescription": "\"The book's informal tone offers a refreshing change from the ubiquitous preachiness of other EJB tomes. It's pragmatic and doesn't tap dance around the fact that EJBs are often used incorrectly in enterprise development... it's an effective way to avoid the potholes that have forced developers off track in the past.\" -- Software Development Magazine",
    "longDescription": "In Bitter EJB, Bruce Tate and his co-authors continue the entertaining and engaging writing style of relating true-life adventure sport experiences to antipattern themes established in Bruce's first book, the best selling Bitter Java. This more advanced book explores antipatterns, or common traps, within the context of EJB technology. EJB is experiencing the mixture of practical success and controversy that accompanies a new and quickly-changing framework. Bitter EJB takes the swirling EJB controversies head-on. It offers a practical approach to design: how to become a better programmer by studying problems and solutions to the most important problems surrounding the technology. The flip side of design patterns, antipatterns, are a fun and interesting way to take EJB expertise to the next level. The book covers many different aspects of EJB, from transactions to persistence to messaging, as well as performance and testing. Bitter EJB will teach programmers to do the following: Identify EJB persistence strategies Choose Entity bean alternatives Use EJB message driven beans Know when to apply or avoid stateful session beans Create efficient build strategies with XDoclet, Ant and JUnit Automate performance tuning",
    "status": "PUBLISH",
    "authors": ["Bruce Tate", "Mike Clark", "Bob Lee", "Patrick Linskey"],
    "categories": ["Java", "Internet", "Java", "BackEnd"],
    "timesSold": 254,
    "saleprice": 169.52,
    "id": 248,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/tate2.jpg",
    "discount": 0,
    "stock": 36
  },
  {
    "name": "Ruby for Rails",
    "isbn": "1932394699",
    "pages": 532,
    "year": 2006,
    "shortDescription": "The word is out: with Ruby on Rails you can build powerful Web applications easily and quickly! And just like the Rails framework itself, Rails applications are Ruby programs. That means you can t tap into the full power of Rails unless you master the Ruby language.",
    "longDescription": "Ruby for Rails helps Rails developers achieve Ruby mastery. Each chapter deepens your Ruby knowledge and shows you how it connects to Rails. You ll gain confidence working with objects and classes and learn how to leverage Ruby s elegant, expressive syntax for Rails application power. And you'll become a better Rails developer through a deep understanding of the design of Rails itself and how to take advantage of it. Newcomers to Ruby will find a Rails-oriented Ruby introduction that s easy to read and that includes dynamic programming techniques, an exploration of Ruby objects, classes, and data structures, and many neat examples of Ruby and Rails code in action. Ruby for Rails: the Ruby guide for Rails developers!",
    "status": "PUBLISH",
    "authors": ["David A. Black"],
    "categories": ["Web Development", "Ruby on Rails", "BackEnd"],
    "timesSold": 237,
    "saleprice": 63.25,
    "id": 30,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/black.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "Agile ALM",
    "isbn": "1935182633",
    "pages": 300,
    "year": 2011,
    "shortDescription": "Many software projects fail unnecessarily because of unclear objectives, redundant and unproductive work, cost overruns, and a host of other avoidable process problems. In response, agile processes and lightweight tooling have begun to replace traditional engineering processes throughout the development lifecycle. An agile approach to application lifecycle management improves product quality, reduces time to market, and makes for happier developers. Agile ALM is a guide for Java developers who want to integrate flexible agile practices and lightweight tooling along all phases of the software development process. The book introduces a new vision for managing change in requirements and process more efficiently and flexibly. You'll learn powerful practices like task-based Development, where you align activities into tasks resulting in traceable artifacts, Continuous Integration, in which you frequently and systematically integrate, build, and test an application in development and using Scrum as an agile approach to release management. The effect is a more comprehensive and practical approach to build, configuration, deployment, release, test, quality, integration, and requirements management. This book synthesizes technical and functional elements to provide a comprehensive approach to software development. You'll learn to see the whole scope of the development process as a set of defined tasks, many of which are repeated daily, and then master the tools and practices you need to accomplish each of those tasks efficiently. Because efficient tool chains can radically improve the speed and fluidity of the development process, this book demonstrates how to integrate state-of-the-art lightweight tools. Many of the tools and examples are Java-based, but the Agile ALM principles apply to all development platforms. As well, the many examples show how you can bridge different languages and systems.",
    "longDescription": "Many software projects fail unnecessarily because of unclear objectives, redundant and unproductive work, cost overruns, and a host of other avoidable process problems. In response, agile processes and lightweight tooling have begun to replace traditional engineering processes throughout the development lifecycle. An agile approach to application lifecycle management improves product quality, reduces time to market, and makes for happier developers. Agile ALM is a guide for Java developers who want to integrate flexible agile practices and lightweight tooling along all phases of the software development process. The book introduces a new vision for managing change in requirements and process more efficiently and flexibly. You'll learn powerful practices like task-based Development, where you align activities into tasks resulting in traceable artifacts, Continuous Integration, in which you frequently and systematically integrate, build, and test an application in development and using Scrum as an agile approach to release management. The effect is a more comprehensive and practical approach to build, configuration, deployment, release, test, quality, integration, and requirements management. This book synthesizes technical and functional elements to provide a comprehensive approach to software development. You'll learn to see the whole scope of the development process as a set of defined tasks, many of which are repeated daily, and then master the tools and practices you need to accomplish each of those tasks efficiently. Because efficient tool chains can radically improve the speed and fluidity of the development process, this book demonstrates how to integrate state-of-the-art lightweight tools. Many of the tools and examples are Java-based, but the Agile ALM principles apply to all development platforms. As well, the many examples show how you can bridge different languages and systems.",
    "status": "PUBLISH",
    "authors": ["Michael Httermann"],
    "categories": ["Software Engineering", "Java", "BackEnd"],
    "timesSold": 217,
    "saleprice": 202.94,
    "id": 101,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/huettermann.jpg",
    "discount": 14,
    "stock": 22
  },
  {
    "name": "Secrets of the JavaScript Ninja",
    "isbn": "193398869X",
    "pages": 300,
    "year": 2012,
    "shortDescription": " Secrets of the Javascript Ninja is definitely a book for anyone looking to significantly improve their Javascript knowledge and skills. Ryan Doherty, Web Development Engineer, Mozilla",
    "longDescription": "JavaScript developers commonly rely on collections of reusable JavaScript code--written by themselves or by someone else at their company. Alternatively, they rely on code from a third party. But in all these cases they need to know how to either construct a cross-browser library from scratch or be adept at using and maintaining their library of choice. In Secrets of the JavaScript Ninja, JavaScript expert John Resig reveals the inside know-how of the elite JavaScript programmers. Written to be accessible to JavaScript developers with intermediate-level skills, this book will give you the knowledge you need to create a cross-browser JavaScript library from the ground up. This book takes you on a journey towards mastering modern JavaScript development in three phases: design, construction, and maintenance. You first are given a base of strong, advanced JavaScript knowledge, enabling you to make decisions about the overall design of a library and how to tackle its eventual construction. The book then teaches you how to construct your library. It examines all the numerous tasks JavaScript libraries have to tackle and provides practical solutions and development strategies for their creation. It then guides you through the various maintenance techniques you will need to keep your code running well into the future. With Secrets of the JavaScript Ninja you will have all the knowledge and skills available to build your own JavaScript library, or to understand how to use any modern JavaScript library available.",
    "status": "PUBLISH",
    "authors": ["John Resig"],
    "categories": [
      "Java",
      "Javascript",
      "Javascript",
      "Java",
      "BackEnd",
      "FrontEnd"
    ],
    "timesSold": 212,
    "saleprice": 47.62,
    "id": 211,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/resig.jpg",
    "discount": 0,
    "stock": 33
  },
  {
    "name": "iPhone in Action",
    "isbn": "193398886X",
    "pages": 472,
    "year": 2008,
    "shortDescription": " There is not another iPhone title that does such a great coverage of both Web and SDK topics under one roof, thus providing a well-rounded developer education. Vladimir Pasman, Cocoacast.com",
    "longDescription": "The iPhone explodes old ideas of a cell phone. Its native SDK offers a remarkable range of features including easy-to-build graphical objects, a unique navigation system, and a built-in database, all on a location-knowledgeable device. Websites and web apps can now behave like native iPhone apps, with great network integration. iPhone in Action is an in-depth introduction to both native and web programming for the iPhone. You'll learn how to turn your web pages into compelling iPhone web apps using WebKit, iUI, and Canvas. The authors also take you step by step into more complex Objective-C programming. They help you master the iPhone SDK including its UI and features like accelerometers, GPS, the Address Book, SQLite, and many more. Using Apple's standard tools like Dashcode, Xcode, and Interface Builder, you'll learn how to best use both approaches: iPhone web and SDK programming. This book is intended as an introduction to its topics. Proficiency with C, Cocoa, or Objective-C is helpful but not required.",
    "status": "PUBLISH",
    "authors": ["Christopher Allen", "Shannon Appelcline"],
    "categories": ["Web Development", "SQL", "BackEnd", "Database"],
    "timesSold": 187,
    "saleprice": 100.17,
    "id": 39,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/callen.jpg",
    "discount": 0,
    "stock": 5
  },
  {
    "name": "Test Driven",
    "isbn": "1932394850",
    "pages": 544,
    "year": 2007,
    "longDescription": "In test-driven development, you first write an executable test of what your application code must do. Only then do you write the code itself and, with the test spurring you on, improve your design. In acceptance test-driven development (ATDD), you use the same technique to implement product features, benefiting from iterative development, rapid feedback cycles, and better-defined requirements. TDD and its supporting tools and techniques lead to better software faster. Test Driven brings under one cover practical TDD techniques distilled from several years of community experience. With examples in Java and the Java EE environment, it explores both the techniques and the mindset of TDD and ATDD. It uses carefully chosen examples to illustrate TDD tools and design patterns, not in the abstract but concretely in the context of the technologies you face at work. It is accessible to TDD beginners, and it offers effective and less-well-known techniques to older TDD hands.",
    "status": "PUBLISH",
    "authors": ["Lasse Koskela"],
    "categories": ["Software Engineering", "Java", "BackEnd"],
    "timesSold": 175,
    "saleprice": 9.27,
    "id": 123,
    "type": ["hardcover", "paperback", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/koskela.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "SQL Server MVP Deep Dives",
    "isbn": "9781935182047",
    "pages": 848,
    "year": 2009,
    "status": "PUBLISH",
    "authors": [
      "Paul Nielsen",
      "Kalen Delaney",
      "Greg Low",
      "Adam Machanic",
      "Paul S. Randal",
      "Kimberly L. Tripp"
    ],
    "categories": ["Microsoft .NET", "SQL", "BackEnd", "Database"],
    "timesSold": 160,
    "saleprice": 178.57,
    "id": 176,
    "type": ["hardcover"],
    "imageurl": "https://m.media-amazon.com/images/I/514jtdksrFL._AC_SY780_.jpg",
    "discount": 0,
    "stock": 19,
    "shortDescription": "Lorem ipsum dolor, sit amet consectetur adipisicing elit. Dolorum, fugit distinctio exercitationem eligendi nobis, ullam illum voluptate sunt at voluptas mollitia. Optio debitis in dolor eveniet nobis placeat nisi unde?"
  },
  {
    "name": "Hibernate Search in Action",
    "isbn": "1933988649",
    "pages": 488,
    "year": 2008,
    "shortDescription": "\"A great resource for true database independent full text search.\" --Aaron Walker, base2Services",
    "longDescription": "Good search capability is one of the primary demands of a business application. Engines like Lucene provide a great starting point, but with complex applications it can be tricky to implement. It's tough to keep the index up to date, deal with the mismatch between the index structure and the domain model, handle querying conflicts, and so on. Hibernate Search is an enterprise search tool based on Hibernate Core and Apache Lucene. It provides full text search capabilities for Hibernate-based applications without the infrastructural code required by other search engines. With this free, open-source technology, you can quickly add high-powered search features in an intelligent, maintainable way. Hibernate Search in Action is a practical, example-oriented guide for Java developers with some background in Hibernate Core. As the first book to cover Hibernate Search, it guides you through every step to set up full text search functionality in your Java applications. The book also introduces core search techniques and reviews the relevant parts of Lucene, in particular the query capabilities. Hibernate Search in Action also provides a pragmatic, how-to exploration of more advanced topics such as Search clustering. For anyone using Hibernate or JBoss Seam, this book is the definitive guide on how to add or enhance search features in their applications.",
    "status": "PUBLISH",
    "authors": ["Emmanuel Bernard", "John Griffin"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 155,
    "saleprice": 17.65,
    "id": 26,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bernard.jpg",
    "discount": 0,
    "stock": 32
  },
  {
    "name": "Domino Development with Java",
    "isbn": "1930110049",
    "pages": 467,
    "year": 2000,
    "longDescription": "Domino Development with Java takes the mysteries out of using the Java programming language within the Domino development environment. It provides a solid foundation for working utilization of the Java programming language in the Domino Application Server environment. The reader will learn how to build servlets, applets, JDBC, and standalone applications. The book culminates with the implementation of an on-line shopping store using Domino and Java. Both WebSphere and VisualAge for Java integration are also covered.",
    "status": "PUBLISH",
    "authors": ["Anthony Patton"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 153,
    "saleprice": 199.92,
    "id": 188,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/patton2.jpg",
    "discount": 0,
    "stock": 28
  },
  {
    "name": "Java Network Programming, Second Edition",
    "isbn": "188477749X",
    "pages": 860,
    "year": 1999,
    "longDescription": "The first edition of Java Network Programming was acclaimed by readers as an outstanding networking reference. It provided complete details of the Java platform's support for networking and I/O with extensive API coverage and sophisticated examples. This second edition is strengthened with complete coverage of JDK 1.2 and many more practical examples. Unlike other books in the field, Java Network Programming, 2nd Edition goes well beyond simple examples to show how to develop robust, efficient real-world applications. What's inside: * Introduction to networking and Internet protocols * Complete coverage of the Java networking and I/O APIs * Details of multithreading and exception handling * Byte, Character, Object and Message streams * IP, TCP, UDP, Multicast, HTTP, DNS, RMI, CORBA and Servlets * Finger, DNS, HTTP, and ping clients and servers * Multiprotocol chat systems & whiteboards ",
    "status": "PUBLISH",
    "authors": ["Merlin Hughes", "Michael Shoffner", "Derek Hamner"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 120,
    "saleprice": 137.5,
    "id": 102,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hughes.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "JSP Tag Libraries",
    "isbn": "193011009X",
    "pages": 656,
    "year": 2001,
    "longDescription": "JSP Tag Libraries is a bible for serious JSP developers. The reader will become acquainted with the world of custom JSP tags--new JSP technology that is beginning to have an enormous impact on the way people are developing JSP. JSP tags are Java components that can be used from within a JSP file. By representing these components as tags, code authors can open up their JSP development to the everyday content developer as well as improve their code reuse and separation between presentation and business logic. The book is fully loaded with many real-world tags including tags to perform iterations, access databases, EJBs, email systems and JavaBeans. To make the tag usage even more real, the book also offers two full-scale case studies in which the reader will see how tags can be used in the context of: e-Commerce applications WAP applications that work with current cellular phones This book covers all aspects of JSP Tag development for Scriptlet-free generation of online content. It focuses on reusable component-centric design via JavaBeans and custom tags to separate presentation from implementation.",
    "status": "PUBLISH",
    "authors": ["Gal Shachor", "Adam Chace", "Magnus Rydin"],
    "categories": ["Java", "Internet", "Java", "BackEnd"],
    "timesSold": 119,
    "saleprice": 97.9,
    "id": 228,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/shachor.jpg",
    "discount": 0,
    "stock": 44
  },
  {
    "name": "Erlang and OTP in Action",
    "isbn": "1933988789",
    "pages": 500,
    "year": 2010,
    "shortDescription": "Erlang and OTP in Action teaches you to apply Erlang's shared-state model for concurrent programming--a completely different way of tackling the problem of parallel programming from the more common multi-threaded approach. This book walks you through the practical considerations and steps of building systems in Erlang and integrating them with real-world C/C++, Java, and .NET applications. Unlike other books on the market, Erlang and OTP in Action offers a comprehensive view of how concurrency relates to SOA and web technologies.",
    "longDescription": "Concurrent programming has become a required discipline for all programmers. Multi-core processors and the increasing demand for maximum performance and scalability in mission-critical applications have renewed interest in functional languages like Erlang that are designed to handle concurrent programming. Erlang, and the OTP platform, make it possible to deliver more robust applications that satisfy rigorous uptime and performance requirements. Erlang and OTP in Action teaches you to apply Erlang's shared-state model for concurrent programming--a completely different way of tackling the problem of parallel programming from the more common multi-threaded approach. This book walks you through the practical considerations and steps of building systems in Erlang and integrating them with real-world C/C++, Java, and .NET applications. Unlike other books on the market, Erlang and OTP in Action offers a comprehensive view of how concurrency relates to SOA and web technologies. This hands-on guide is perfect for readers just learning Erlang or for those who want to apply their theoretical knowledge of this powerful language. You'll delve into the Erlang language and OTP runtime by building several progressively more interesting real-world distributed applications. Once you are competent in the fundamentals of Erlang, the book takes you on a deep dive into the process of designing complex software systems in Erlang.",
    "status": "PUBLISH",
    "authors": ["Martin Logan", "Eric Merritt", "Richard Carlsson"],
    "categories": ["Programming", "Java", "BackEnd"],
    "timesSold": 110,
    "saleprice": 159.21,
    "id": 142,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/logan.jpg",
    "discount": 14,
    "stock": 2
  },
  {
    "name": "JMX in Action",
    "isbn": "1930110561",
    "pages": 424,
    "year": 2002,
    "longDescription": "With Java Management Extensions (JMX), you can configure, manage and monitor your Java applications at run-time, as well as break your applications into components that can be swapped out. JMX provides a window into an application's state and its behavior, and a protocol-independent way of altering both state and behavior. It lets you expose portions of your application in just a few lines of code. Written for both new and experienced developers, this book explains the JMX specification and discusses its use through clean, well-discussed examples. It covers the JMX architecture and how to create all types of MBeans. It includes important advanced topics such as extending the JMX classes, combining with other Java technologies, the MBean relation service, dynamic MBean loading, and creating your own protocol adapters.",
    "status": "PUBLISH",
    "authors": ["Benjamin G. Sullins", "Mark B. Whipple"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 107,
    "saleprice": 169.27,
    "id": 243,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sullins.jpg",
    "discount": 5,
    "stock": 29
  },
  {
    "name": "Azure in Action",
    "isbn": "193518248X",
    "pages": 425,
    "year": 2010,
    "shortDescription": "Azure in Action is a fast-paced tutorial intended for architects and developers looking to develop on Windows Azure and the Windows Azure Platform. It's designed both for readers new to cloud concepts and for those familiar with cloud development but new to Azure. After a quick walk through the basics, it guides you all the way from your first app through more advanced concepts of the Windows Azure Platform.",
    "longDescription": "Cloud-based applications pose an intriguing value proposition for businesses. With an easily scalable, pay-as-you-go model and very small startup costs, the cloud can be a great alternative to systems hosted in-house. Developers are scrambling to understand the impact a cloud-based approach will have on current and future projects. Azure is Microsoft's full-fledged entry into the \"Cloud Services Platform\" arena. Unlike other cloud offerings that address only one piece of the puzzle, Azure includes an operating system, a set of developer services, and a data model that can be used individually or together. It's designed to interact seamlessly with other .NET-based components, and leverages your knowledge of Visual Studio, the .NET platform, and SQL Server. It's also fully compatible with multiple internet protocols, including HTTP, REST, SOAP, and XML. Azure in Action is a fast-paced tutorial intended for architects and developers looking to develop on Windows Azure and the Windows Azure Platform. It's designed both for readers new to cloud concepts and for those familiar with cloud development but new to Azure. After a quick walk through the basics, it guides you all the way from your first app through more advanced concepts of the Windows Azure Platform. The book starts by looking at the logical and physical architecture of an Azure app, and then moves to the core storage services binary store, tables and queues. Then, it explores designing and scaling frontend and backend services that run in the cloud. Next, it covers more advanced scenarios in Windows Azure. After covering the core of Azure, it introduces the rest of the Windows Azure Platform with a particular focus on SQL Azure Database.",
    "status": "PUBLISH",
    "authors": ["Chris Hay", "Brian H. Prince"],
    "categories": ["Microsoft .NET", "SQL", "BackEnd", "Database"],
    "timesSold": 82,
    "saleprice": 81.78,
    "id": 95,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hay.jpg",
    "discount": 0,
    "stock": 4
  },
  {
    "name": "SCBCD Exam Study Kit",
    "isbn": "1932394400",
    "pages": 488,
    "year": 2005,
    "longDescription": "There is probably no Java certification more valuable to you than Sun Certified Business Component Developer CX-310-090. To pass you need a readable, no-nonsense book focused like a laser beam on the exam goals. SCBCD Exam Study Kit is that book. The study kit makes sure you first understand all the concepts you need to know, large and small, and then covers every single exam topic. It provides more than 130 review questions with answers distributed over all chapters and an Exam's Eye View section at the end of each chapter on the important points to remember. Although SCBCD Exam Study Kit has only one purpose - to help you get certified - you will find yourself returning to it as a reference after passing the exam. A demo on how to install the necessary software, write a simple bean, deploy the bean, and execute it, as well as a free SCBCD exam simulator can be downloaded from the publisher's website.",
    "status": "PUBLISH",
    "authors": ["Paul Sanghera"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 82,
    "saleprice": 113.37,
    "id": 220,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sanghera.jpg",
    "discount": 0,
    "stock": 43
  },
  {
    "name": "Groovy in Action, Second Edition",
    "isbn": "1935182447",
    "pages": 700,
    "shortDescription": "Groovy in Action, Second Edition is a thoroughly-revised, comprehensive guide to Groovy programming. It introduces Java developers to the dynamic features that Groovy provides, and shows you how to apply Groovy to a range of tasks including building new apps, integration with existing code, and DSL development.",
    "longDescription": "The first edition of Groovy in Action is the undisputed definitive reference on the Groovy language. Written by core members of the Groovy language team, this book presents Groovy like none other can from the inside out. Since its introduction a few years back, Groovy has grown from an upstart dynamic language for the JVM to become an integral part of any Java developer's toolbox. Projects like Grails and Griffon have extended Groovy's reach into the web and desktop app world. Groovy in Action, Second Edition is a thoroughly-revised, comprehensive guide to Groovy programming. It introduces Java developers to the dynamic features that Groovy provides, and shows you how to apply Groovy to a range of tasks including building new apps, integration with existing code, and DSL development. This book introduces Groovy by example, presenting lots of reusable code while explaining the underlying concepts. Java developers new to Groovy find a smooth transition into the dynamic programming world. Groovy experts gain a solid reference that challenges them to explore Groovy deeply and creatively. For readers learning it from scratch. Groovy in Action thoroughly moves through the Groovy basics, including: Groovy's unique approach of optional typing Simple and collective Groovy data types Working with closures and Groovy control structures The merits of Metaprogramming Readers are presented with rich and detailed examples illustrating Groovy's enhancements to Java, including: How to work with builders and the GDK Database and XML programming with Groovy Concurrency for the multicore era: actors, asynchronous collections and dataflow Building Domain Specific languages a very hot topic! Groovy in Action then demonstrates how to integrate Groovy in Java projects and provides: Tips and Tricks Unit testing and build support Groovy frameworks, including Grails, Griffon, and Groovy on Windows",
    "status": "MEAP",
    "authors": [
      "Dierk Knig",
      "Guillaume Laforge",
      "Paul King",
      "Cdric Champeau",
      "Hamlet D'Arcy",
      "Erik Pragt",
      "Jon Skeet"
    ],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 62,
    "saleprice": 17.3,
    "id": 121,
    "type": ["hardcover", "paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/koenig2.jpg",
    "year": 1984,
    "discount": 0,
    "stock": 4
  },
  {
    "name": "JDK 1.4 Tutorial",
    "isbn": "1930110456",
    "pages": 408,
    "year": 2002,
    "longDescription": "Java is a success. It is now used across the programming landscape, from embedded devices to enterprise-class distributed systems. As Java's use increases, the pressure grows for it to expand to meet the diverse needs of the developer communities. The latest edition of Java, JDK 1.4 (or J2SE 1.4), includes new features like a new I/O system, a persistent preferences framework, Java Web Start, and Java regular expressions. This book lets experienced developers as well as novices learn JDK 1.4's new features quickly. It provides a clear exposition of the important new topics with plenty of well documented code. All the examples are substantial and solve real-world problems but aren't cluttered with unnecessary details. The new features are covered in a comprehensive and matter-of-fact way without digressions into philosophy or theory. After reading this book, a developer will be able to use Java's new features with confidence and skill.",
    "status": "PUBLISH",
    "authors": ["Gregory M. Travis"],
    "categories": ["Java", "Internet", "Java", "BackEnd"],
    "timesSold": 53,
    "saleprice": 11.28,
    "id": 250,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/travis.jpg",
    "discount": 0,
    "stock": 26
  },
  {
    "name": "Java Foundation Classes",
    "isbn": "1884777678",
    "pages": 1088,
    "year": 2001,
    "longDescription": "Java Foundation Classes: Swing Reference is the comprehensive guide to Swing 1.1 and Java 2's Swing package. Written by the programmers that maintain the Internet's Swing FAQ, this book is based on the much enhanced, most recent release of Swing. All documentation in this book is based on the authors' experience with the Swing source code and their digging under the surface to make sure what they are saying is correct. This book offers solid reference material, extensive examples and an introductory tutorial provide programmers with a quick start and ongoing support as their daily Swing reference. The authors have not trusted a single description of the Swing JavaDoc--this book is verified, correct documentation for the Swing library. For programmers wondering which methods are unimplemented or empty, which are synchronized, which throw runtime exceptions, the JavaDoc won't tell them, but this book will.",
    "status": "PUBLISH",
    "authors": ["Stephen C. Drye", "William C. Wake"],
    "categories": ["Java", "Java", "BackEnd"],
    "timesSold": 52,
    "saleprice": 37.04,
    "id": 68,
    "type": ["ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/drye.jpg",
    "discount": 17,
    "stock": 40
  },
  {
    "name": "JSTL in Action",
    "isbn": "1930110529",
    "pages": 480,
    "year": 2002,
    "longDescription": "JSTL is an important simplification of the Java web platform. With JSTL, page authors can now write dynamic pages using standard HTML-like tags and an easy-to-learn expression language. JSTL is a standard from the Java Community Process, and its expression language will become part of JSP 2.0. JSTL in Action shows you how to write rich, dynamic web pages without programming. From simple loops to tricky XML processing, every feature of JSTL is covered and exercised in numerous useful examples. Whether you are a novice page author or an experienced Java programmer, this book shows you easy ways to create powerful web sites. To help readers who don't already have a JSP container run the examples in the book, there's a free companion download here. This bundle contains a ready-to-run JSP container, a JSTL implementation, and all the book's examples.",
    "status": "PUBLISH",
    "authors": ["Shawn Bayern"],
    "categories": ["Internet", "HTML", "Java", "BackEnd", "FrontEnd"],
    "timesSold": 49,
    "saleprice": 169.61,
    "id": 23,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bayern.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "SQR in PeopleSoft and Other Applications",
    "isbn": "1884777775",
    "pages": 600,
    "year": 2003,
    "longDescription": "A software system is the realization of a set of concerns. One of the central premises of object-oriented programming is that each concern should be implemented as a separate module. However, there are certain system-wide concerns, such as logging, security, performance, and so forth, that often need to be addressed in many, if not all of the modules. Consequently, the code to handle these system-wide concerns may be mixed in with the core logic of a huge number of modules, resulting in lower productivity, poor quality, and systems that are hard to evolve. Aspect-oriented programming overcomes these problems by modularizing the system-wide concerns. AspectJ enables AOP programming in Java by adding a few new language constructs. By using Java as the base language and creating a final system that is compatible with Java byte code specification, AspectJ passes on all the benefits of Java. The use of Java as the base language also makes AspectJ a relatively easy language to learn. AspectJ in Action is a practical guide to AOP and AspectJ. The reusable code examples that are provided will enable quick implementation of functionality in your system. The book is divided into three parts. The first part introduces AOP and AspectJ and will be helpful to developers wanting to learn or advance their knowledge of AspectJ. The second and third parts present examples of everyday situations in which you can use simple and easy AspectJ solutions to implement common system requirements such as logging, policy enforcement, resource pooling, business rules, thread-safety, authentication and authorization, as well as transaction management.",
    "status": "PUBLISH",
    "authors": ["Galina", "Vlad Landres"],
    "categories": ["Business", "Client-Server", "Java", "BackEnd"],
    "timesSold": 45,
    "saleprice": 112.13,
    "id": 133,
    "type": ["hardcover", "ebook"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/landres.jpg",
    "discount": 0,
    "stock": 30
  },
  {
    "name": "SQR in PeopleSoft and Other Applications, Second Edition",
    "isbn": "1932394001",
    "pages": 696,
    "year": 2003,
    "longDescription": "Programmers, database developers, administrators responsible for PeopleSoft support, functional users, and project managers are discovering SQR, or Structured Query Report Writer, which has become increasingly popular since PeopleSoft selected it as its main SQL processing and reporting tool. This new language liberates programmers from the constraints of SQL and allows them to concentrate on the application aspects of their programs. This new edition covers all SQR language elements and features, showing developers the best ways of utilizing the languages capabilities and demonstrating good programming habits. Written in a \"let's do it together\" tutorial style, this book starts with the basics and leads users toward a full understanding of the subject. Part one describes the SQR language with all of its features, while part two covers all aspects of interaction between SQR programs and PeopleSoft. This makes the book a working manual for both SQR programmers and PeopleSoft developers.",
    "status": "PUBLISH",
    "authors": ["Galina Landres", "Vlad Landres"],
    "categories": ["Business", "Client-Server", "SQL", "BackEnd", "Database"],
    "timesSold": 32,
    "saleprice": 47.9,
    "id": 134,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/landres2.jpg",
    "discount": 0,
    "stock": 13
  },
  {
    "name": "Instant Messaging in Java",
    "isbn": "1930110464",
    "pages": 402,
    "year": 2002,
    "shortDescription": "This intermediate Java programming book provides Java programmers with the information and tools needed to create your own IM client and server software.",
    "longDescription": "Instant Messaging has exploded into the online world and is a wildly popular service of the largest Internet Service Providers (ISP) like AOL with AOL Instant Messenger, MSN with Microsoft Messenger, and Yahoo with Yahoo Messenger. Millions of Internet users everyday exchange IM s and its use beyond messaging is just around the corner. For example, the new Microsoft .NET platform will be using instant messaging technology for data exchange. This intermediate Java programming book provides Java programmers with the information and tools needed to create your own IM client and server software. You can use the software to create your own IM systems or integrate IM features into your existing software. Imagine allowing your customers to chat directly with technical support or other users from within your application! This book focuses on the open source Jabber XML-based IM protocols (www.jabber.org) to create Java IM software. These open protocols allows your IM software to seamlessly communicate with the large number of other Jabber clients and servers available including commercial Jabber systems like the one that powers Disney's go.com IM. Readers are assumed to know how to program in Java. No prior knowledge of Jabber or IM is needed.",
    "status": "PUBLISH",
    "authors": ["Iain Shigeoka"],
    "categories": ["Internet", "Java", "Java", "BackEnd"],
    "timesSold": 23,
    "saleprice": 153.63,
    "id": 229,
    "type": ["hardcover"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/shigeoka.jpg",
    "discount": 0,
    "stock": 0
  },
  {
    "name": "JUnit in Action, Second Edition",
    "isbn": "1935182021",
    "pages": 504,
    "year": 2010,
    "shortDescription": "JUnit in Action, Second Edition is an up-to-date guide to unit testing Java applications (including Java EE applications) using the JUnit framework and its extensions. This book provides techniques for solving real-world problems such as testing AJAX applications, using mocks to achieve testing isolation, in-container testing for Java EE and database applications, and test automation.",
    "longDescription": "When JUnit was first introduced a decade ago by Kent Beck and Erich Gamma, the Agile movement was in its infancy, \"Test Driven Development\" was unknown, and unit testing was just starting to move into the typical developer's vocabulary. Today, most developers acknowledge the benefits of unit testing and rely on the increasingly sophisticated tools now available. The recently released JUnit 4.5 represents the state of the art in unit testing frameworks, and provides significant new features to improve the Java development process. JUnit in Action, Second Edition is an up-to-date guide to unit testing Java applications (including Java EE applications) using the JUnit framework and its extensions. This book provides techniques for solving real-world problems such as testing AJAX applications, using mocks to achieve testing isolation, in-container testing for Java EE and database applications, and test automation. Written to help readers exploit JUnit 4.5, the book covers recent innovations such as the new annotations that simplify test writing, improved exception handling, and the new assertion methods. You'll also discover how to use JUnit extensions to test new application styles and frameworks including Ajax, OSGi, and HTML-based presentation layers. Using a sample-driven approach, various unit testing strategies are covered, such as how to unit test EJBs, database applications, and web applications. Also addressed are testing strategies using freely available open source frameworks and tools, and how to unit test in isolation with Mock Objects. The book will also bring you up to speed on the latest thinking in TDD, BDD, Continuous Integration, and other practices related to unit testing. ",
    "status": "PUBLISH",
    "authors": [
      "Petar Tahchiev",
      "Felipe Leme",
      "Vincent Massol",
      "Gary Gregory"
    ],
    "categories": ["Java", "HTML", "Java", "BackEnd", "FrontEnd"],
    "timesSold": 12,
    "saleprice": 79.59,
    "id": 246,
    "type": ["paperback"],
    "imageurl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/tahchiev.jpg",
    "discount": 0,
    "stock": 38
  }
]
